<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>x</title>
</head>
<body>
<small><i>por Alan Knowles (alan_k@php.net)
tracido por Jes&uacute;s M. Castagnetto (jmcastagetto@php.net)</i>
</small>
<p>
Despu&eacute;s de la gran actividad de la semana pasada, esta semana las
cosas fueron mas calmadas con el lanzamiento de solo 2 paquetes estables
y 2 en Beta, junto con la continua discusi&oacute;n acerca de hacer el
proceso de documentaci&oacute;n mas sencillo, el tener nuevas
estad&iacute;sticas para los paquetes, el firmar los paquetes ejecutables,
PHPDoc resurgiendo al mundo de los vivos, y 2 nuevas extensiones en C en
PECL.<br>
</p>

<hr>

<h2>Nuevos Lanzamientos</h2>

<h3>Estable</h3>
<ul>
<li><b>HTML_Javascript -</b> para trabajar con Javascript.</li>
<li><b>Science_Chemistry</b> - clases para representar Atomos, Moleculas and Macromoleculas.</li>
</ul>

<h3>Beta</h3>
<ul>
<li><b>Math_Vector</b> - para manipular vectores en 2D y 3D.</li>
<li><b>MDB</b> - la versi&oacute;n en PEAR de la abstracci&oacute;n de base de
datos Metabase.</li>
</ul>

<hr>

<h2>Tr&aacute;fico en PEAR-DEV</h2>

<h3>Ejecutable Pre-compilados y el Firmado de los Paquetes</h3>
Siguiendo a una discusi&oacute;n en IRC, 
Marko Karppinen mostr&oacute; en la lista los planes para
distribuir ejectuables pre-compilados de PECL (extensiones de PHP).
En vista del reciente incidente en OpenSSH donde alguien inserto
c&oacute;digo malicioso en la distribuci&oacute;n de c&oacute;digo fuente,
hay una necesidad mayor de ofrecer seguridad adicional y procedimientos
que permitan el chequeo de la informaci&oacute;n.
Para mas detalles en la propuesta lean el <a
 href="http://marc.theaimsgroup.com/?l=pear-dev&m=102769689219883&w=2">mensaje
 enviado a la lista</a>.

<h3>Haciendo la Documentaci&oacute;n sencilla</h3>
En la actualidad (y bajo consideraci&oacute;n) hay 3 proyectos par
tratar de hace el escibir documentaci&oacute;n en PEAR mas f&aacute;cil.
<ul>
  <li>Convertir HTML a DocBook, Martin Jansen ha propuesta un simple mapeo
  de algunas marcas en HTML (como &lt;H1&gt;) a las correspondientes en
  DocBook - vean el <a
 href="http://marc.theaimsgroup.com/?l=pear-dev&m=102770762000379&w=2">mensaje</a>
 con la propuesta.</li>
  <li>Convertir PHPDoc a DocBook, Alexander y Alan mencionaron esta idea - 
  Alan se acerco al problema desde el punto de vista de extende la herramienta
  PHP_Codedoc que el ha escrito para este efecto. Alexander va a escribir
  una extensi&oacute;n para que PHPDoc entienda DocBook directamente, 
  resultando en documentaci&oacute;n que puede insertarse directamente
  en el manual de PEAR</li>
  <li>Convertir de OpenOffice a DocBbook, Wolfram Kriesing esta considerando
  el escribir un convertidor del XML de OpenOffice a DocBook</li>
</ul>

<h3>Mejoras a las Estad&iacute;sticas de los Paquetes</h3>
Tal Peer, a&ntilde;adi&oacute; un <a
href="http://pear.php.net/package-stats.php">resumen completo</a>
a las estad&iacute;sticas de los paquetes, de esta manera se puede ver
una lista de cuantas veces cada uno de los paquetes ha sido descargado.

<h3>Acceso de Alta Velocidad a los archivos</h3>
Despu&eacute;s de una corta discusi&oacute;n acerca de performance y el leer
archivos, Tomas Cox envi&oacute; un mensaje con
<a  href="http://marc.theaimsgroup.com/?l=pear-dev&m=102819831726965&w=2">una
prueba compartiva</a> que ilustra que fread() es m&aacute;s r&aacute;pido
que el usar implode('',file()).

<h3>PHPDoc resurge a la vida</h3>
Derick Rethans, 
<a href="http://www.ActiveState.com/ActiveAwards2002">quien fu&eacute; premiado
recientemente</a>, a recogido el guante y esta arreglando los problemas
en PHPDoc, &eacute;l esta buscando sugerencias de que puede ser a&ntilde;adido
a ese paquete.

<h3>Problemas y Soluciones</h3>
Gracias a las siguientes personas por encontrar y solucionar problemas en los
paquetes de PEAR, Pawe&#322; Go&#322;aszewski,
Thomas Schulz, James Flemer and Peter Bowen.

<hr>

<h2>Paquetes Nuevos y Propuestos</h2>

<h3>picoSQL</h3>
Funciones para la base de datos <a 
href="http://www.picosoft.it/picosql/index.html">picoSQL</a>
fueron a&ntilde;adidas a PECL, picoSQL es una base de datos
relacional propietaria que ha sido 
'abierta al mundo entero' con la licensia LGPL.

<h3>Python</h3>
John Praise a&ntilde;adi&oacute; su extensi&oacute;n a python en PECL, 
la cual permite el mezclar Python y PHP, y acceder a variables de Python en PHP.

<hr>

<h2>Desarrollo</h2>
Activos en CVS en esta semana ha sido PECL::picoSQL, PECL::python, Cache_Lite,
DB, MDB, PHPDoc, Archive_Tar, Mail, Auth, HTML_TreeMenu, HTML_JavaScript,
Net_Pop3, Net_Sieve, Net_URL, Pager, Mail_Mime, HTTP_Request, Tree,
Math_Vector, y Science_Chemistry.

</body>
</html>
