<!-- EN-Revision: 1.3 -->
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>x</title>
</head>
<body>

<p><i><small>por Alexander Merz - alexmerz@php.net (traduzido por Ant&ocirc;nio Carlos Ven&acirc;ncio J&uacute;nior - floripa@php.net)</small></i></p>

<p>
A fam&iacute;lia de Alan Knowles o for&ccedil;ou a ficar longe dos computadores por alguns dias ;-)<br>
Espero que eu possa escrever as not&iacute;cias semanais com a mesma qualidade que ele faz.<br>
Um breve resumo: o t&oacute;pico dominante foi o LiveUser, al&eacute;m do fato de Stig ter registrado novos dom&iacute;nios relacionados ao PEAR e uma discuss&atilde;o sobre a privacidade no PEAR.
</p>

<hr>  

<h2>Novos Lan&ccedil;amentos</h2>

<h3>Est&aacute;vel</h3>
<ul>
  <li><b>XML_Transformer</b> - transforma tags XML em c&oacute;digo PHP ou texto (conceito similar ao XSLT)</li>
  <li><b>XML_RPC</b> - uma API para gerenciar Remote Procedure Calls</li>
  <li><b>PEAR</b> - o pacote base do PEAR</li>
</ul>

<h3>Beta</h3>
<ul>
  <li><b>Translation</b> - uma API para gerenciar I18N de recursos em string</li>
  <li><b>Config</b> - uma API para processar e editar configura&ccedil;&otilde;es de fontes de dados</li>
</ul>

<h3>Alpha</h3>
<ul>
  <li><b>LiveUser</b> - autentica&ccedil;&atilde;o de usu&aacute;rio e gerenciamento de permiss&otilde;es</li>
  <li><b>XML_XSLT_Wrapper</b> - camada de abstra&ccedil;&atilde;o para a transforma&ccedil;&atilde;o XSL</li>
</ul>

<hr>

<h2>Tr&aacute;fego na Lista PEAR-DEV</h2>

<h3>Categoria Perm?</h3>
<p>Markus Wolff solicitou uma nova categoria para o LiveUser chamada Perm. N&atilde;o houve concenso e Markus lan&ccedil;ou o LiveUser sob a categoria Authentication.</p>

<h3>Vai PEAR, vai!</h3>
<p>Stig Bakken registrou os dom&iacute;nios <a href="http://go-pear.org" target="_blank">go-pear.org</a>|.com|.net. Eles servir&atilde;o para o script go-pear, o qual instala a base atual do sistema PEAR incluindo o instalador. Se voc&ecirc; desejar um PEAR funcionando no seu sistema basta rodar no seu prompt:<br>
<pre>lynx -source go-pear.org|php</pre></p>

<h3>Privacidade do PEAR</h3>
<p>Derick Rethans notou alguns poss&iacute;veis problemas na p&aacute;gina web do PEAR. Se voc&ecirc; baixar um pacote, seu IP ser&aacute; guardado para fins estat&iacute;sticos. Isto poderia ferir leis em alguns pa&iacute;ses europeus. N&atilde;o se decidiu uma forma para lidar com isto - n&oacute;s somos programadores, n&atilde;o advogados. Se voc&ecirc; sabe mais do que n&oacute;s sobre este assunto escreva uma nota para a lista de discuss&atilde;o pear-dev.</p>

<hr>

<h2>Pacotes Novos e Propostos</h2>

<h3>HTML_Select_Country</h3>
<p>Richard Heyes e Marten Stolte postaram algumas id&eacute;ias sobre um pacote para criar menus em HTML para selecionar um nome de pa&iacute;s. Isto inclui listas localizadas dos nomes.</p>

<hr>

<h2>Desenvolvimento</h2>
<p>Ativo no CVS esta semana: bcompiler, LiveUser, DBA_Rational, MDB, Config, Cache_Lite, phyton, PEAR, XML_RPC, XML_XSLT_Wrapper, HTML_OOH-Forms e XML_Transformer.</p>

</body>
</html>
