<!-- EN-Revision: 1.11 -->
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"><html><head><title>x</title></head>
<body>
<small><i>por Alan Knowles alan_k@php.net (traduzido por Ant&ocirc;nio Carlos Ven&acirc;ncio J&uacute;nior - floripa arroba php.net)</i></small>
<p>Considerando as f&eacute;rias de ver&atilde;o (Europa/EUA), o PEAR teve mais uma semana extremamente cheia com 10 novos lan&ccedil;amentos est&aacute;veis, 4 lan&ccedil;amentos beta e discuss&otilde;es sobre o PEAR no Gentoo, novas categorias, um novo manual e um &iacute;cone "Powered by PEAR".</p> 

<hr>

<h2>Novos Lan&ccedil;amentos</h2>

<h3>Est&aacute;vel</h3>
<ul>
<li><b>File_SearchReplace</b> para encontrar e substituir dados dentro de arquivos.</li>
<li><b>HTTP_Request</b> para postar e receber dados de servidores web.</li>
<li><b>HTML_Table</b> para montar tabelas em HTML.</li>
<li><b>HTML_TreeMenu</b> para criar arvores em HTML para navega&ccedil;&atilde;o.</li>
<li><b>Log</b> - um framework para logar para arquivos, syslog, SQL, etc.</li>
<li><b>Mail</b> - a classe para enviar e-mails.</li>
<li><b>Mail_Mime</b> para manipular mensagens MIME.</li>
<li><b>Net_POP3</b> para acessar caixas de correio POP3.</li>
<li><b>Net_Sieve</b> para conversar com servidores "timsieved".</li>
<li><b>Net_URL</b> para analisar URLs.</li>
<li><b>Pager</b> para fazer pagina&ccedil;&atilde;o.</li>
</ul>

<h3>Beta</h3>
<ul>
<li><b>bcompiler</b> - um compilador de PHP bytecode (no momento apenas para classes).</li>
<li><b>HTML_Javascript</b> - ferramentas para trabalhar com Javascript.</li>
<li><b>PEAR_Frontend_Gtk</b> - a interface de desktop para o instalador do PEAR (inicializado com pear -G e requer o <a href="http://gtk.php.net">PHP-Gtk</a>).</li>
<li><b>PHPDoc</b> - ferramenta de documenta&ccedil;&atilde;o via coment&aacute;rios.</li>
</ul>

<hr>

<h2>Tr&aacute;fego na lista PEAR-DEV</h2>

<h3>PEAR e Gentoo</h3>
Gentoo adicionou alguns pacotes do PEAR ao seu portage tree (o sistema de instala&ccedil;&atilde;o de pacotes). A lista de pacotes dispon&iacute;veis podem ser vistas em <a href="http://www.gentoo.org/packages/dev-php/index.html">Gentoo dev-php</a>.
 

<h3>Novas Categorias: PHP e Template</h3>
Seguindo a introdu&ccedil;&atilde;o do bcompiler, foi sugerido que uma categoria PHP seria &uacute;til e poderia conter pacotes como PHPDoc, PHPUnit e bcompiler, j&aacute; que eles s&atilde;o todos pacotes e m&oacute;dulos que tratam de an&aacute;lise gramatical, compila&ccedil;&atilde;o, etc. Foi aceito que esta &eacute; uma id&eacute;ia razo&aacute;vel. A outra sugest&atilde;o sobre a categoria Template, para pacotes como HTML_Template_IT, Template_Flexy, Template_Smart, levaram a alguma discuss&atilde;o e foi indicado que estas classes de Template (as quais residem sobre o HTML) poderiam ser usadas para outros tipos de arquivos (XML, Email, RTF, etc). O estado atual da vota&ccedil;&atilde;o est&aacute; 2-3 votos a favor e 1 contra.

<h3>Not&iacute;cias Semanais e HTML</h3>
A maioria dos tradutores indicaram que o HTML atual 'gerado pelo Mozilla' para as not&iacute;cias semanais estava um pouco dif&iacute;cil para traduzir no vi, emacs, etc (j&aacute; que ele estava um pouco 'sujo'). Alan concordou em arrumar o HTML antes de envi&aacute;-lo. Mais tradu&ccedil;&otilde;es foram adicionadas: Ant&ocirc;nio Carlos Ven&acirc;ncio J&uacute;nior (Portugu&ecirc;s Brasileiro) e Robert Janeczek (Polon&ecirc;s). O PWN deve estar usando a extens&atilde;o do gettext no PHP (para os t&iacute;tulos principais), mas estamos esperando a confirma&ccedil;&atilde;o do webmaster para saber se isto pode ser disponibilizado.

<h3>Smarty e PEAR</h3>
Foi concordado que ja &eacute; hora do <a href="http://smarty.php.net">Smarty</a> estar dispon&iacute;vel como um pacote do PEAR (mesmo se ele n&atilde;o sequir os padr&otilde;es do PEAR) e apenas pequenas mudan&ccedil;as seriam feitas para garantir que ele funcione corretamente com o instalador do PEAR.

<h3>Movimenta&ccedil;&otilde;es no PEAR</h3>
Stig continuou a remover partes n&atilde;o essenciais do PEAR da distribui&ccedil;&atilde;o do PHP (a qual eventualmente conter&aacute; o suficiente para deixar o PEAR packager funcionando). O Net_SMTP, Net_Curl e o Mail est&atilde;o agora no diret&oacute;rio principal do PEAR no CVS (apenas arquivos de pacotes ser&atilde;o distribu&iacute;dos com o PHP-4.3 devido a um teste de QA que ser&aacute; realizado em breve).

<h3>Trocando Banco de Dados no DB, MDB e ODBC</h3>
A quest&atilde;o surgiu sobre como trocar de banco de dados quando usando a camada de abstra&ccedil;&atilde;o de banco de dados do PEAR. Ap&oacute;s algumas discuss&otilde;es a sugest&atilde;o atual &eacute; usar:

<pre>
$db-&gt;disconnect();
$db = DB::connect($new_dsn);
</pre>

Esta &eacute; a forma recomendada, j&aacute; que nem todos os backends de banco de dados (ao n&iacute;vel do PHP) suportam trocar de banco de dados, entretanto algu&eacute;m que queira implementar tal solu&ccedil;&atilde;o que permite a troca (para banco de dados que suportam) e desconectando (para os que deixam) &eacute; bem-vindo para mandar patches. Lukas comentou que ele acredita que o MDB pode lidar com isto.<br>
Num t&oacute;pico parecido, Tomas indicou que ele estar&aacute; adicionando suporte a um cursor ODBC para o formato do dsn para o exemplo:
<pre>odbc://user:pass@ds?cursor_type=SQL_CUR_USE_ODBC</pre>

<h3>Guia para Desenvolvedores e PEARdoc2</h3>
Martin Jansen adicionou um novo guia para os desenvolvedores que foi adicionado ao Manual do PEAR, para ajudar a responder aquelas d&uacute;vidas dos desenvolvedores que aparecem frequentemente, do tipo: "Como eu escrevo um arquivo de pacot?" e "Porque existe um padr&atilde;o de programa&ccedil;&atilde;o?". Enquanto isso, Alexander completou sua revis&atilde;o do manual do PEAR, fazendo-o mais modular e mais f&aacute;cil de ser extendido, esperando ver um manual totalmente novo online muito em breve.

<h3>DB_Pager returning constant results</h3>
Richard Wall enviou um patch para fazer o DB_Pager::getData() retornar um n&uacute;mero constante, como &eacute; atualmente feito pelo m&eacute;todo do Google, o qual estava um pouco confuso para algumas pessoas. Foi concordado em fazer uma nova "vers&atilde;o amig&aacute;vel para desenvolvedor" como um extra ao m&eacute;todo padr&atilde;o atual.

<h3>Seguran&ccedil;a e Config_DB</h3>
Bertand Mansion notou que o container do pacote Config_DB estava imprimindo o DSN (usu&aacute;rio do banco de dados, etc) quando certos errors ocorriam. Este n&atilde;o era um efeito desej&aacute;vel e notou-se que os desenvolvedores devem ser cuidadosos ao mostrar mensagens de erro contendo senhas.

<h3>Passando por Refer&ecirc;ncia</h3>
Para aqueles que n&atilde;o sequem o PHP-DEV, dois artigos interessantes foram mencionados com rela&ccedil;&atilde;o a velocidade de passar par&acirc;metros por refer&ecirc;ncia - ao contr&aacute;rio do C, o PHP &eacute; atualmente mais lento quando passando (textos e n&uacute;meros) por refer&ecirc;ncia - ent&atilde;o seja um pouco cuidadoso usando esta caracter&iacute;stica em pacotes que precisam de alta performance. Refer&ecirc;ncias: [<a href="http://www.zend.com/zend/art/ref-count.php">http://www.zend.com/zend/art/ref-count.php</a>] e [<a href="http://phplens.com/lens/php-book/optimizing-debugging-php.php">http://phplens.com/lens/php-book/optimizing-debugging-php.php</a>].

<h3>Open office and Abiword for writing docbook</h3>
Foi mencionado que o <a href="http://www.openoffice.org">Open office</a> estava considerando adicionar um modo de edi&ccedil;&atilde;o docbook, e que o <a href="http://www.abiword.org">AbiWord</a> poderia exportar para o docbook. Entretanto, nenhuma das duas s&atilde;o "solu&ccedil;&otilde;es 100%" e a melhor sa&iacute;da no momento &eacute; ainda o emacs, vim ou outro editor de texto; ou o <a href="http://www.softquad.com/">XMetal</a> para usu&aacute;rios Windows. Uma dica de leitura para autores &eacute; o PHPDoc how-to dispon&iacute;vel em <a href="http://cvs.php.net/co.php/phpdoc/howto/howto.html.tar.gz">http://cvs.php.net/co.php/phpdoc/howto/howto.html.tar.gz</a>.

<h3>"Instant&acirc;neos" do PEAR</h3>
Foi perguntado se um "instant&acirc;neo" de todos os pacotes do PEAR poderia estar dispon&iacute;vel. Apesar da comunidade PEAR n&atilde;o ver uma grande vantagem em fazer isto (devido so grande tamanho que o PEAR acabaria tendo). Se algu&eacute;m desejar fazer seus pr&oacute;prios instant&acirc;neos ser&aacute; bem-vindo. Como resultado disto foi planejado adicionar
<pre>pear upgrade-all </pre>
o qual atualizaria todos os pacotes instalados para suas vers&otilde;es mais recentes.

<h3>Powered by PEAR</h3>
<img src="http://pear.php.net/gifs/pear-power.gif" alt="powered by pear" width="88" height="31" hspace="10" align="left">
Colin Viebrock adicionou um novo &iacute;cone "Powered by PEAR" para ser usado em sites que utilizem o PEAR. Voc&ecirc; pode baix&aacute;-lo em <a href="http://pear.php.net/gifs/pear-power.gif">http://pear.php.net/gifs/pear-power.gif</a>.

<h3>Erros e Corre&ccedil;&otilde;es</h3>
Obrigado a Pawe&#322; Go&#322;aszewski, Matt Allen, James E. Flemer, Tal Peer e Dave Clark pela detec&ccedil;&atilde;o de erros e algumas corre&ccedil;&otilde;es.
 
<hr>

<h2>Pacotes Propostos</h2>

<h3>Cache_Lite - SpeedyGonzales's Caching.</h3>
Marty Fabien prop&ocirc;s uma vers&atilde;o mais enxuta da classe Cache que estaria focada no desempenho (numa classe simples), seguran&ccedil;a em NFS e Block Caching. Ap&oacute;s muita discuss&atilde;o sobre o nome (incluindo sugest&otilde;es como Cache_Fast, Cache Simple, Cache_HighTraffic, Cache_RoadRunner, Cache_SpeedyGonzales and Cache_BeepBeep) o escolhido foi Cache_Lite. Notou-se que aceleradores como Zends, PHPAcelerator e APC poderiam fazer uma diferen&ccedil;a consider&aacute;vel se voc&ecirc; est&aacute; preocupado com velocidade/desempenho.

<hr>

<h2>Development</h2>
Ativos nesta semana no CVS: MDB, Manual do PEAR e FAQ, PECL::soap, DB, HTML_Table, XML_CSSML, PHPDoc, Mail, HTML_Javascript, Auth_HTTP, PECL::bcompiler, HTML_QuickForm, Config, Log, Auth, PEAR_FrontEnd_Gtk, XML_RPC e Net_NNTP.

<br>
</body></html>