<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"><html><head><title>x</title></head>

<body>
<p><i><small>by Alan Knowles(alan_k@php.net) (&uuml;bersetzt von Alexander Merz alexmerz(at)php.net)</small></i></p>

<p>
Kurz und b&uuml;ndig: ein Flut neuer Package-Vorschl&auml;ge, 
diese Woche gab es 1 neues Release, 6 Package-Vorschl&auml;ge, neues von PEARDoc2,
den Umgang mit Umgebungsvariablen in PEAR::System und ein beharrlicher Flu&szlig; an CVS Commits.
</p>

<hr>
<h2>Neue Releases</h2>

<h3>Stable</h3>

<ul>
	<li>
		<b>DB_ado</b> - Eine Schnittstelle f&uuml;r Microsofts ADODB.
	</li>
</ul>
 
<hr>
<h2>PEAR-DEV Meldungen</h2>

<h3>PEARDoc2</h3>
<p>
Die Arbeiten an einem flexibleren Layout f&uuml;r das PEAR Manual gehen weiter.
Alexander schrieb in einer Nachricht &uuml;ber das neue Layout und verwies auf den 
neuen Quellcode bereits vor einiger Zeit. Die neue Manual geht online, wenn noch einige 
wenige Package-Dokumentation konvertiert sind.<br>
Demo: <a href="http://www-user.tu-chemnitz.de/~meal/php/peardoc2">http://www-user.tu-chemnitz.de/~meal/php/peardoc2</a><br>
DocBook: <a href="http://www-user.tu-chemnitz.de/~meal/php/peardoc2/peardoc2.zip">http://www-user.tu-chemnitz.de/~meal/php/peardoc2/peardoc2.zip</a><br>
</p>

<h3>Bemerkung zu System.php</h3>
<p>
Das Package PEAR::System trat ins Rampenlicht durch die Benutzung der $_ENV-Variable.
Sie ist nicht immer verf&uuml;gbar. Die Alternative &uuml;ber einen 'langsamen' Aufruf der
Funktion getenv(). Zur Zeit wurde das Problem gel&ouml;st, indem zuerst 
die $_ENV-Variablen &uuml;berpr&uuml;ft werden, wenn sie nicht vorhanden sind, wird
getenv() benutzt.
</p>

<h3>Verteilung der Pear Weekly News mit RSS</h3>
<p>
Jesus Castagnetto schlug ein Vertrieb der 'News' im RSS-Format vor. Die Nachrichten
k&ouml;nnen so von anderen Webseiten verarbeitet werden. Das ist eine gute Idee;
sie wird hoffentlich in den n&auml;chsten Wochen weiter verfeinert.
</p>

<h3>Bugs und Fixes</h3>
<p>
Dank an 
Bjoern Frantzen, Ondrej Jombik, David Jean Louis, Jeroeon Derks, Haken Kuecuekyilmaz, Arnaud Limbourg, Kubo Atsuhiro.
f&uuml;r Bug-Meldungen und Korrekturen.
</p>
<hr>

<h2>Neue und vorgeschlagene Packages</h2>

<h3>PEAR::Auth - Alternative</h3>
<p>
Wolfram Kriesing schlug eine alternative Auth-Klasse vor.
Sie authentifiziert Benutzer &uuml;ber eine gro&szlig;e Anzahl an m&ouml;glichen 
Datenquellen: Datenbanken, LDAP, NIS, SOAP etc.
Weitere M&ouml;glichkeiten sind Schutz auf Verzeichniss-Ebene, automatisierter
Login und eine einfache Benutzer-Erkennung. 
</p>

<h3>APD, die "Advanced PHP Debugger"-Erweiterung</h3>
<p>
George Schlossnagle schlug die Aufnahme von APD in PECL auf. Nach breiter Zustimmung,
befindet es sich im PECL-CVS. APD enth&auml;lt Funktionen f&uuml;r Profiling
und Backtrace-Debugging, inklusive einer ferngesteurten, schrittweisen programmasuf&uuml;hrung.
</p>

<h3>Metar-Wetterinformationen</h3>
<p>
Yavor Shahpasov schlug eine Klasse f&uuml;r die &Uuml;bertragung von Wetter-Daten
von "Metar". Nach einigen Diskusssionen, wird der Name Weather_Metar favorisiert.
</p>

<h3>"Ogg Vorbis"-Erweiterung</h3>
<p>
Dave Broudy k&uuml;ndigte eine Erweitung f&uuml;r das lesen von "Ogg Vorbis"-
Dateien (ein MP3-Ersatz) an. Es wurde angenommen und wird bald in das CVS &uuml;bertragen.
</p>

<h3>Ein alternatives Package f&uuml;r die Erzeugung von Excel-Dateien</h3>
<p>
Xavier Noguer bot eine Neuimplementierung des File_Excel-Package an. Obwohl es 
noch nicht komplett ist, h&auml;lt er seine Implementierung f&uuml;r zukunfttr&auml;chtiger.
Mike Tuupola erwiderte darauf, das seine bestehende Klasse aufgrund seines Zeitmangels nicht
weiter pflegen kann und begr&uuml;&szlig;te die Neuimplementierung.
</p>

<h3>GNU-PGP Erweiterung f&uuml;r PECL</h3>
<p>
Patrick O'Lone programmierte eine Anbindung an die GNU-PGP-Schnittstelle.
Dies bringt &auml;hnliche Lizenz-Probleme mit sich, wie bereits bei der 
SMBClient-Erweiterung. Wenn dieses Problem gel&ouml;st ist, wird eine weitere 
interessante Erweiterung f&uuml;r PHP bereit.
</p>

<hr>

<h2>Development</h2>
<p>
CVS-Aktivit&auml;ten fanden letzte Woche bei Auth, Auth_HTTP,
Benchmark, Cache_Lite, DB, DB_DataObject, DB_ldap, DBA, HTML_QuickForm, HTML_Template_Flexy,
Image_Transform, Log, Mail, MDB, PECL::imagick, Perm_LiveUser, PHP_Doc, PHPUnit,
Tree, XML_Transformer statt.
</p>

<h3>Neue und &Uuml&uuml;berarbeite Dokumentation</h3>

&Auml;nderungen und Erg&auml;nzungen an XML_Transformer, 
DB_DataObject, PECL::SOAP und PECL:APD statt.



<br>
</body></html>
