<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>x</title>
</head>
  <body>
    
<p><i><small>by Alan Knowles(alan_k@php.net) (&uuml;bersetzt von Alexander Merz alexmerz(at)php.net)</small></i></p>
    
<p>
<b>Kurz und b&uuml;ndig</b>:
Auf der Mailingliste ging es etwas ruhiger zu - daf&uuml;r wurde kr&auml;ftig programmiert:
6 'stable', 2 'beta'-Releases und ein 'development'-Release. Davon hervor zu heben
ist der erste 'stable-Release von MDB. Diskussionen drehten sich unter anderem um
die PEAR-Installation bei Internet-Hostern und einige interessante Package-Vorschl&auml;ge,
z.B. Christian Stockers WebDAV-Server-Klasse.
</p>
    
<hr>  
<h2>Neue Releases</h2>
    
<h3>Stable</h3>
    
<ul>
	<li>
  		<b>Console_Getopt</b> - Zugriff auf Kommandozeilen-Parametern von PHP-Skripten
	</li>
  	<li>
		<b>HTML_Crypt</b> - Funktionen zur Verschl&uuml;sselung von Text und Entschl&uuml;sselung
		mit JavaScript
	</li>
  	<li>
		<b>HTML_Template_IT</b> - Package mit den Template-Klassen HTML_Template_IT und 
		HTML_Template_ITX. ITX ist eine PHPLib-kompatible Template-Klasse, 
		IT eine vereinfachte Version davon.
	</li>
	<li>
		<b>Pager</b> - Erzeugt eine Navigationsleiste f&uuml;r die Darstellung von Verzeichniss-Seiten 
		(<pre>prev 1 2 .. 10 next</pre>)
	</li>
	<li>
		<b>MDB</b> - Metabase-Databank-Abstraktions-Schicht für PEAR 
	</li>
	<li>
		<b>XML_Transformer</b> - Transformator für XML-Tags zu PHP-Code oder Text. Vergleichbar mit XSLT.
	</li>  
</ul>
    
<h3>Beta</h3>
    
<ul>
  	<li>
		<b>Image_Transform</b> - Abstraktionsschicht f&uuml;r die Bild-Bearbeitung.
		Zur Zeit unterst&uuml;tzte Treiber: GD, ImageMagick, imagick, NetPBM
	</li>
  	<li>
		<b>DB_DataObject</b> - Package für die Generierung von SQL-Anweisungen und Datenmodellierung.
	</li> 
</ul>
     
<h3>Development</h3>
    
<ul>
	  <li>
	  	<b>DBA</b> - 
	  	Bereitstellung einer dateibasierenden Datenbanken &uuml;ber die PHP-DBA-Funktionen oder per Emulation,
  		einschlie&szlig;lich einer einfachen SQL-Implementierung
	</li>    
</ul>
    
<hr>  
<h2>PEAR-DEV Meldungen</h2>
    
<h3>PEAR-Lizenz-FAQ</h3>
<p>
Nach einer Anfrage von Richard Stallman, erg&auml;nzte Rasmus Lerdorf die Liste an m&ouml;glichen Lizenzen 
f&uuml;r PEAR-Packages. Diese Lizenzen wurden gepr&uuml;ft durch das OSI (Open Source Institute) und der
FSF (Free Software Foundation)
</p>

<h3>PEAR_Config - neuer Parser</h3>
<p>
Bertrand Mansion &uuml;berarbeitete das Config-Package. Er f&uuml;gte neue
Treiber-Klassen hinzu, und implementierte die alten neu. Die neue Version
ist nicht mehr kompatibel mit fr&uuml;heren Releases! Wird noch die alte API genutzt,
muss bei der Installation des Packages explizit die alte Version angegeben werden.
</p>

<h3>MDB-Manager-Skizze</h3>
<p>
Lukas  postete eine <a
href="http://lists.php.net/article.php?group=php.pear.dev&amp;article=8951">Zusammenfassung</a>
des MDB-Managers. Sie zeigt Unterschiede und Vorteile von MDB auf. Er dokumentierte ausserdem
einige Interna von MDB, um das Programmieren von Datenbank-Treibern zu erleichteren.
</p>

<h3>Tomas V. Cox im Stress</h3>
PEAR-Core-Entwickler Tomas Cox schrieb, dass er in den n&auml;chsten Wochen sich von PEAR zur&uuml;ckziehen muss.
Dass f&uuml;hrt zu einigen lustigen Kommentaren Marke "Ist die Katze aus dem Haus...".

<h3>Phpdoc2peardoc</h3>
<p>
Alexander Merz <a href="http://lists.php.net/article.php?group=php.pear.dev&amp;article=9004">ver&uuml;ffentlichte</a>
die erste Version eines programms, um PHPDoc-Quellcode-Kommentare nach DocBoc zu konvertieren. Das erzeugte
DocBook-XML kann direkt in das PEAR-Manual eingef&uuml;gt werden. Damit wird sich die Dokumentation von PEAR deutlich verbessern.
</p> 

<h3>Wie man PEAR ausserhalb des PEAR-Verzeichnisse zum Laufen bekommt.</h3>
<p>
Peter Schoenster fragte wie man PEAR-Packages ausserhalb des standardm&auml;&szlig;igen
PEAR-Pfades installiert - ein typisches Problem bei Internet-Hostern. Es gibt eine Reihe von 
L&ouml;sungen:
</p>
<p>
Erste M&ouml;glichkeit:
<pre>pear config-set php_dir /where/i/want/pear</pre>. Dieser Befehl &auml;ndert das 
Installationsverzeichniss f&uuml;r den gegenw&auml;rtigen Nutzer. 
</p>
<p>
Zweite: Manuelles Downloaden und Entpacken des Packages in ein Verzeichniss, da&szlig; im
Include-Pfad enthalten ist.
</p>
<p>
Der Include-Pfad kann mit <code>ini_set('include_path','/Wo/PEAR/ist');</code> im Skript
gesetzt werden. Diese Zeile kann in einem "auto_prepend"-Skript stehen oder einer
Config-Datei f&uuml;r jedes Skript (z.B.: <code>require_once 'config.inc.php'</code>)
</p>
<p>
Letztendlich kann der Pfad mit <code>php_value include_path /wo/PEAR/ist</code> auch in der
Datei .htaccess gesetzt werden.
</p>
    
<h3>Bugs und Fixes</h3>
<p>
Dank an Pawe&#322; Go&#322;aszewski, 
Michael Dransfield, Jeremy Pointer, Alexy Borzov 
f&uuml;r Bug-Meldungen und Korrekturen. 
</p>
<hr>   

<h2>Neue und vorgeschlagene Packages</h2>
    
<h3>DB_DOM oder DB_XML</h3>
<p>
Sandro Zic schlug einen neue Klasse vor, um ein XML-Document-Model (DOM) in einer Datenbank &uuml;ber PEAR::DB 
zu speichern. Damit ist ein schneller Zugriff auf gro&szlig;e XML-Dokumente m&ouml;glich.
 Die API ist vergleichbar mit der DOMXML-Erweiterung von PHP. 
</p>

<h3>HTTP_Webdav_Server </h3>
<p>
Christian Stockers Package erm&ouml;glicht es, PHP 4.3 als WebDAV-Server einzusetzen.
Das Package enth&auml;lt als Beispiel einen Datei-basierten Server.
</p>

<h3>Tree_Manager</h3>
<p>
Bj&ouml;rn Schotte w&uuml;rde gerne seine Tree_Manager-Klasse 
PEAR hinzuf&uuml;gen. Es folgte eine Diskussion, ob es nicht sinnvoller ist,
die Funktionen dem existerendem Tree-Package hinzu zu f&uuml;gen.
</p>

<hr>   
<h2>Development</h2>
<p>
CVS-Aktivit&auml;ten fanden letzte Woche bei
 Cache_Lite, DB_DataObject, DB_ldap, 
DBA, HTML_QuickForm, HTML_Template_Flexy, HTML_Template_IT, Image_Transform,
 Log, Mail_Mime, MDB, Pager, PECL::bcompiler, PECL::mailpars, PECL::threads,
 PECL::vpopmail, Perm_LiveUserTree, XML_Transformer und PEAR core packages
 statt.
</p>
   
<h3>Neue und &uuml;berarbeitete Dokumentation</h3>
<p>
&Auml;nderungen und Erg&auml;nzungen fanden bei
XML_Transformer, Contributing und der FAQ statt.
</p>

</body>
</html>
