<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>x</title>
</head>
<body>
<p><i><small>by Alan Knowles(alan_k@php.net) (&uuml;bersetzt von Alexander Merz alexmerz(at)php.net)</small></i></p>

<p>
Kurz und b&uuml;ndig: 5 neue Releases, z.B. MDB RC2, und zwei neue Packages; neue PEAR-Helfer arbeiteten an Bugfixes, 
Code-Erweiterungen und brachten neue Ideen.
Das Dokumentationsproblem wird kontinuierlich von vielen Seiten angegangen: PHPDoc-zu-Docbook-Werkzeuge und OpenOffice-Konverter.
Bestehende Klassen wie Auth/Permisssion und Config wurden &uuml;berpr&uuml;ft und sollen verbessert werden.
Rasmus diskutierte Probleme mit Lizenzkonflikten von GPL-Code.
+underway for major improvements. Meanwhile, Rasmus has been heping out with the issues of Licencing conficts with GPL code.
 </p>

<hr>
<h2>Neue Releases</h2>

<h3>Stable</h3>
<ul>
	<li>
		<b>Net_IPv4</b> - Berechnung von Netzadressen (z.B.: Broadcast etc.)
	</li>
</ul>

<h3>Beta</h3>

<ul>
	<li>
	 	<b>DB_DataObject</b> - Eine SQL- und Daten-Modelierungs-Schicht.	
	</li>
	<li>
		<b>Math_Vector</b> - Objektorientierte Darstellung und Manipulation von 2D- und 3D-Vektoren
	</li>
	<li>
		<b>Tree</b> - Funktionen zur Bearbeitung von Baumstrukturen aus XML-Daten oder Datenbanken
	</li>		
</ul>

<h3>Alpha</h3>

<ul>
	<li>
		<b>Validate</b> - Funktionen zur Daten&uuml;berpr&uuml;fung (z.B Nummern, EMail-Adressen, Kredit-Karten-Daten)
	</li>
</ul>

<h3>Development</h3>

<ul>
	<li>
	 	<b>MDB </b>- "Release Candidate 2" von PEAR MDB, der "Metabase
		Merger Database Abastraction Layer".
	</li>
</ul>

<hr>
<h2>PEAR-DEV Meldungen</h2>

<h3>Fortsetzung der Diskussion der letzten Woche</h3>
<p>
Die Diskussion um Math_Vector, Math_Distance und Mail_Queue 
laufen weiter. Aktuell besprochen werden die Probleme mit PEAR::System 
unter der neuen ZendEngine und Wolframs Forderung nach einem 
strikterem PHPUnit.

</p>

<h3>phpDocumentator in PEAR?</h3>
<p>
Mit dem Team von phpDocumentator laufen Gespr&auml;che &uuml;ber einen
Aufnahme ins PEAR. phpDocumentator l&ouml;st langsam PHPDoc als 
Tool zur Erzeugung einer API-Dokumentation ab.
Da die Weiterentwicklung von PHPDoc anscheinend nicht sichergestellt ist,
wird eine Aufnahme wahrscheinlich.
</p>

<h3>Neue API f&uuml;r PEAR::Config</h3>
<p>
Bertrand Mansion &auml;nderte und erweiterte die Funktionen
von PEAR::Config. Da diese &Auml;nderungen Einflu&szlig; auf die API
hat, ist dies der erste Testfall f&uuml;r den PEAR-Installer
mit verschiedenen Versionen eines Packages umgehen zu k&ouml;nnen.
</p>

<h3>Perm_LiveUser im CVS</h3>
<p>
Marcus Wolff f&uuml;gte Perm_LiveUser in das PEAR-CVS ein.
Im Voraus gab es eine durchaus witzige Namensdiskussion.
W&auml;hrenddessen arbeitete Lukas Smith an einem Problem 
nicht unerheblichen Problem: Die &Auml;nderung der Rechte eines Benutzers
durch einen Administrator, <i>w&auml;hrend</i> der Benutzer eingeloggt ist.
</p>

<h3>Spracherkennung f&uuml;r die "Weekly News"</h3>
<p>
Wolfram Kriesing schlug vor, nichtenglischen Lesern die lokalisierte Variante 
der "Weekly News" automatisch anzuzeigen. Zur Erkennung der Sprache wird das 
neue Package "I18N_Negotiator" genutzt. Derzeit wird noch die Installation des
Packages auf dem PEAR-Webserver abgekl&auml;rt.
</p>
<p>
Umd von dieser Funktion zu profitieren, muss im Browser die Muttersprache 
als "default language" gesetzt werden.
</p>
<p>
Ondrej Jombik riet zur Benutzung von Net_Geo oder vergleichbarer Klassen 
f&uuml;r diese Funktionen. Sie ermitteln die Sprache auf Basis der IP-Adresse.
Alan bemerkte, dass ein Leser aus Honk-Kong nicht unbedingt Chinesisch beherrscht.
Die manuelle Auswahl der Sprache &uuml;ber den die Browser-Einstellungen sei sicherer.
</p>

<h3>MDB - "Release Candidate 2"</h3>
<p>
Lukas Smith beendete die Arbeiten am zweiten "Release Candidate" 
der Metabase-PEAR-DB-Abstraktion. Es enth&auml;lt &Auml;nderungen
am Manager und einen verbesserten XML-Schema-Parser. Er hofft
auf schnelles Feedback, um m&ouml;glichst n&auml;chste Woche 
MDB-Version 1.0 ver&ouml;ffentlichen zu k&ouml;nnen.
</p>

<h3>PECL::Smbclient GPL-Probleme</h3>
<p>
Jelmer Vernooij's SMB-Client-Erweiterung zeigte einige Probleme
mit GPL-Code unter PHP auf. PHP hat eine BSD &auml;hnliche Lizenz;
sie f&uuml;hrt zu Problemen, wenn GPL-Code &uuml;ber eine 
Extension eingebunden wird.
</p>
<p>
Vergleichbare Probleme hat ebenfalls das Mozilla-Projekt. Es enth&auml;lt 
ebenfalls Programmteile unter der GPL. Das f&uuml;hrte zur Situation mit
drei verschiedenen Lizenzen.
</p>
<p>
Deshalb erg&auml;nzte Rasmus eine entsprechende Bemerkung in der FAQ: GPL-Code in 
PHP-Extensions sollte vermieden werden - dies gilt nicht f&uuml;r Code unter der
LGPL.
</p>
<p>
Die zur Zeit einzige rechtlich einwandfreie L&ouml;sung besteht darin, eine gesonderte Erlaubnis ('grant')
des Samba-Teams einzuholen, wenn die smbclient-Bibliothek in die Extension eingebunden 
werden soll.
</p>

<h3>Bugs und Fixes</h3>

Dank an Chuck Hagenbuch, Adam Maccabee
Trachtenberg, Keith Schoenefeld, Pawe&#322;
Go&#322;aszewski, Ondrej Jombik, Tabata Tomoyuki, Aaron
Hawley f&uuml;r Bug-Meldungen und Korrekturen.

<hr>

<h2>Neue und vorgeschlagene Packages</h2>

<h3>Net_IPv4</h3>
<p>
Berechnungen von Broadcast- und Netz-Adressen.
Erics Package wird demn&auml;chst aufgenommen.
</p> 

<h3>Benchmark_Profiler</h3>
<p>
Mathias Englert Package arbeitet &auml;hnlich Benchmark_Timer,
bietet aber feinere Kontroll-M&ouml;glichkeiten.
</p>

<hr>

<h2>Entwicklung</h2>
<p>
CVS-Aktivit&auml;ten fanden letzte Woche bei Auth, Cache_Lite,
DB_DataObject, Image_Transform, Math_Vector, MDB, Net_CheckIP,
Net_DNS, NetIPv4, PECL::smbc, PECL::tclink, Perm_LiveUser, PHPDoc,
SOAP, Tree, Validate statt.
</p>

<h3>Neue und &uuml;berarbeitet Dokumentationen</h3>

&Auml;nderungen und Erg&auml;nzungen an PECL::Soap, Net_IPv4 und
PEAR selbst.

</body>
</html>

