<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"><html><head><title></title></head><body>
<small><i>by Alan Knowles alan_k@php.net (&uuml;bersetzt von Alexander Merz alexmerz(at)php.net)</i></small>
<p>Mal wieder rege T&auml;tigkeit in PEAR, 2 Stable- und 5 Beta-Releases. Eine interessante Diskussion &uuml;ber einen SQL-Parser, -Erzeugung, -Fehler und -Standards. PEAR-RPMs in der polnischen Linux-Distribution PLD. Und jede Menge neuer Code-Beitr&auml;ge und drei Package-Vorschl&auml;ge<br>

</p>
<hr>
<h2>New Releases </h2>
<h3>Stable</h3>
<p>
PHPUnit - eine Code-Testumgebung<br> Net_SMTP - eine API f&uuml;r einen einfachen Umgang mit dem STMP-Protokoll zum Versenden von E-Mails
</p>
<h3>Beta</h3>
<p>  
Net_Dime - eine API f&uuml;r "Direct Internet Message Encapsulation"<br>
verbesserter Support f&uuml;r das SOAP-Protokoll und -Packages<br>
DBA - eine API f&uuml;r DBM-&auml;hnliche Datenbanken, kann auch DBM-Datenbanken mit Hilfe von Datein emulieren<br>
PEAR_Frontend_Web - ein Web-Interface f&uuml;r den PEAR-Installer<br>
DB_DataObject - eine API f&uuml;r die Erzeugung von SQL-Statments und fungiert als
"Data Modeling Layer".

</p>
<hr>
<h2>PEAR-DEV Meldungen </h2>

<h3>DB::Sybase - Sybase Fehlermeldungen f&uuml;r die DB-Abstraktionsschicht</h3>
<p>
Anotonio Carlos Venancio Junior sucht noch Freiwillige, die ihn bei der Erarbeitungung von Fehlermeldungen f&uuml;r den Sybase-Treiber helfen
</p>
<h3>DBA - Berkley DB Wrapper und SQL Parser </h3>
<p>
Brent Cook hat das DBA (Berkley DB) Interface fast fertig. 
Das schliesst einen SQL-Parser f&uuml;r dateibasierte Datenbanken ein, um mit Hilfe von SQL auf diese zuzugreifen. Der Parser wird weiterentwickelt und wird zuk&uuml;nftig auch f&uuml;r andere Projekte genutzt. (Dieses Projekt hie&szlig; fr&uuml;her &uuml;brigens DB_DBA)
</p>

<h3>Zend Engine 2 und Errors </h3>
<p>
PHP5 und die Zend Engine 2 werfen in Form des Catch-Throw-Mechanismus und dem
neuem reserviertem Schl&uuml;sselwort 'delete' ihre Schatten auch auf PEAR.
</p>
<p>
Stig testet die ZE2 und entwarf daraufhin eine vereinfachte Version von raiseError(). 
</p>
<p>
Sebastian Bergmann implementiert f&uuml;r PHP_Assert_Unit mit assertSame() derzeit eine Funktion zum Vergleich von Variablen.
Der Vergleich von Objekten ist dabei nur unter der ZE2 m&ouml;glich. 
</p>
<p>
Hinsichtlich 'delete' gibt es hier Probleme bei DB_DBA und DB_DataObject, sie benutzen 
'delete' bereits als Methodename. Brent &auml;ndert die Bezeichnung in DB_DBA zu 'remove'.
Alan begann dazu eine Diskussion mit Andi auf der Zend-Engine2-Mailingliste, schliesslich
k&ouml;nnte 'delete' als Name f&uuml;r Methoden erlaubt sein. Eine endg&uuml;ltige Entscheidung 
ist erst nach Ende von Andis Urlaub zu erwarten.
</p>

<h3>Danke an die folgenden Entwickler f&uuml;r Fixes und Bug-Meldungen</h3>
<p>
Dan Allen, James Flemmer, Paul Cooper, Marco Wittwer, Yavor Shahpsov
</p>

<h3>Weekly News - Herausgabe and &Uuml;bersetzungen</h3>
<p>
Alexander Merz &uuml;bersetzt derzeit die "Weekly News" ins Deutsche. 
Wenn Sie ebenfalls bereit sind, eine Stunde pro Woche f&uuml;r eine &Uuml;bersetzung in ihre
Sprache zu investieren oder &Uuml;bersetzer/Schreiber bei ihrer Arbeit helfen m&ouml;chten, dann
schicken sie einfach eine Nachricht an die PEAR-Dev Mailingliste. 
Der Zeitplan f&uuml;r die Herausgabe sieht eine Ausgabe der endg&uuml;ltigen englischsprachigen
"Weekly News" f&uuml;r Freitag vor. &Uuml;bersetzungen sollten sollten m&ouml;glichst bis Montag/Dienstag der 
darauffolgenden Woche vorliegen. Die Ank&uuml;ndigung einer neuen "Weekly News" erfolgt jeweils 
Montags. Wer Vorschl&auml;ge zur Ver&ouml;ffentlichung der "Weekly News" auf anderen Webseiten hat, kann diese
an die PEAR-Dev-Mailingliste schreiben.
</p>

<h3>PLD Linux Distribution inklusive PEAR </h3>
<p>
PLD Linux Distribution (www.pld.org.pl) stellt PEAR-Packages als RPMs bereit.
Stig sagte, dass dies im Sinne des PEAR-Install-Konzeptes ist. 
Schliesslich wurde der PEAR-Package-Manager auch in Hinblick auf die Einbettung in andere
Package-Systeme entwickelt. Er wies darauf hin, dass zuk&uuml;nftig nur die 3 
PEAR-Core-Packages mit PHP selbst ausgeliefert werden, die &uuml;brigen 
m&uuml;ssen nachtr&auml;glich installiert werden
</p>

<h3>Absolute vs. Relative Pfade</h3>
<p>
Lukas Smith brachte die Idee "dirname(__FILE__) . '/filename.php'",
anstatt "'package/filename.php'" f&uuml;r include- und require-Befehle zu nutzen.
Es gab daf&uuml;r nur geringe Zustimmung. Er stellte fest, das es dabei u.U. zu Problemen 
mit dem PEAR-Installer hinsichtlich der automatischen Aufl&ouml;sung von Package-Abh&auml;ngigkeiten
kommen kann.
</p>
<p>
Es wurde angemerkt, dass viele Entwickler nicht unbedingt die PEAR-Packages unmittelbar aus dem
Standard-PEAR-Verzeichniss nutzen, sondern aus applikationsspezifischen Verzeichnissen und daher 
mit der ini_set()-Funktion ihren Include-Path verbiegen.
</p>

<h3>Lizenzen und kompiliertes PHP</h3>
<p>
Brent Cook schrieb einen interessanten  <a href="http://lists.php.net/article.php?group=php.pear.cvs&amp;article=4936">Artikel</a>, 
warum er f&uuml;r DB_DBA die LGPL statt der PHP License w&auml;hlte.<br>
In einer &auml;hnlichen Diskussion wurde gefragt, ob PEAR bzw. einzelne Komponenten 
in compilierter bzw. bin&auml;rer Form vertrieben werden d&uuml;rfen (z.B. erzeugt durch den Zend Bytecode Compiler).
Alle derzeit in PEAR eingesetzen Lizenzen erlauben diese Form des Vertriebs (zumindest wenn der Quellcode nicht 
ver&auml;ndert wurden).
</p>

<h3>XML_RPC und SOAP - "pluggable transport layers"</h3>
<p>
James Flemmer schrieb einen Patch f&uuml;r XML_RPC, der zus&auml;tzliche Plug-ins f&uuml;r die Transportschicht erlaubt.
So k&ouml;nnen Request &uuml;ber HTTP, HTTPS, Unix Sockets, Brieftauben, etc ... abgesendet werden.
Shane Caraveo schlug vor die betreffende Arbeiten an der Plug-In-Schnittstelle f&uuml;r den Nachrichtentransport
mit dem SOAP-Package zu koordinieren, damit doppelte Arbeit vermieden wird.
</p>

<h3>Standardbezeichnung f&uuml;r "Verbindung trennen". </h3>
<p>
Alexander Merz schlug vor die Methodennamen f&uuml;r jegliche Arten von Verbindungsaufbau und -abbau zu standarisieren.
Damit soll der Wildwuchs von "quit", "close", "open", "connect" etc. beendet werden. Der Vorschlag wurde einhellig angenommen.
</p>
<hr>

<h2>Package-Vorschl&auml;ge:</h2>
<h3>Managment-Package f&uuml;r Benutzer-Authentifizierung und Zugriffs-Kontroll</h3>
<p>
Markus Wolff schlug vor, seine <a href="http://projects.21st-hq.de/liveuser/">User and ACL management classes</a> an PEAR anzupassen und hinzuzuf&uuml;gen.
Er bat um entsprechendes Feedback.
</p>
<h3>Template_Flexy - Yet Another Templating class</h3>
<p>
Alan Knowles, schlug seine <a href="http://docs.akbkhome.com/Template_Flexy/">Template_Flexy</a>-
Klasse f&uuml;r PEAR vor. Er bekam einen gewissen Zuspruch. Die Klasse bietet eine einfache API 
kombiniert mit einer schnellen Templating-Engine, basierend auf Wolframs Kriesings
"simpletemplate"-Klasse.
</p>
<h3>
</h3>
<h3>PECL-SMBC-C Modul f&uuml;r Samba client access</h3>
<p>
Jelmer Vernooij k&uuml;ndigte eine PHP-Extension f&uuml;r den Samba Client an.
Damit ist die Samba-Client-API auch in PHP nutzbar.
</p>

<hr>

<h2>Entwicklung</h2>
<p>
CVS-Aktivit&auml;ten fanden letzte Woche bei DBA, Net_Dime, SOAP,
DB, PEAR, PECL::soap, Mail_Mime, HTML_QuickForm, File_Password, Date,
MDB, XML_CSSML, PHP_Unit, Net_SMTP und PEAR_Frontend_Web statt.
</p>
<hr>
<h2>Dokumentation</h2>
<p>
DB_DataObject wurde in die Dokumentation aufgenommen.
</p>
<br>


</body></html>
