<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>x</title>
</head>
  <body>
            
<p><i><small>by Pierre-Alain Joye (paj@pearfr.org) (&uuml;bersetzt von Alexander Merz alexmerz(at)php.net)</small></i></p>
            
<p>
<b>Kurz und b&uuml;ndig:</b>
Viele Aktivit&auml;ten - eine Reihe von Updates, Erg&auml;nzungen und Korrekturen.
Die diskutierten Themen variierten vom klassischem "Namensbenennung&amp;Coding Standards"
bis hin zu automatisierten &Uuml;bersetzungen. Sebastian Bergmann und Kristian K&ouml;hntopp
arbeiteten intensiv an XML_Transformer.<br>
Last but not least - vier "stable"-Releases und ein "beta"-Release.
</p>
         
<hr>      
<h2>New Releases</h2>
           
<h3>Stable</h3>
            
<ul>
    <li>
	  	<b>HTTP_Request</b> - für das Senden an und Empfangen von Daten eines HTTP-Servers
	</li>
    <li>
		<b>Log</b> - ein Logging-Framework auf der Basis von Dateien/Syslog/SQL/etc
	</li>
    <li>
		<b>Net_DNS</b> - Eine API für DNS-Abfragen, Zonen-Vermittlungen und dynamischer DNS-Aktualisierungen
    </li>
    <li>
		<b>Var_Dump</b> - Eine aufpolierte Variante der var_dump()-Funktion
	</li>
    <li>  
		<b>XML_Transformer</b> - Transformator für XML-Tags zu PHP-Code oder Text. Vergleichbar mit XSLT.
	</li>                 
</ul>
     
<h3>Beta</h3>
     
<ul>
	<li>
		<b>Mail_Queue</b> - API zum Versenden von EMails im Hinterground
    </li>     
</ul>            
            
<hr>      
<h2>PEAR-DEV - Stichpunkte</h2>
     
<h3>PEAR-Website und Package Manager</h3>
<p>
Die PEAR-Web-Gruppe arbeitet intensiv an den letzten Details und Funktionen.
Um die Stabilit&auml;t und Benutzbarkeit zu verbessern, bitten sie um R&uuml;ckmeldungen
von Benutzern und PEAR-Entwicklern.
Wenn Sie die PEAR-Website benutzen oder einen der PEAR-Installer nutzen, informieren Sie sie bitte
&uuml;ber Probleme oder vermisste Funktionen. Scheiben Sie entweder eine E-Mail an die 
<a href="http://pear.php.net/support.php">PEAR-Dev-Mailingliste</a> oder nutzen die
<a href="http://bugs.php.net/">PHP-Bugs-Webseite</a>. Danke f&uuml;r die Hilfe!
</p>
<p>
PS: Um Zugriff auf die Beta-Version der PEAR-Website zu erhalten, m&uuml;ssen Sie 
das "devme"-Cookie aktivieren. Folgen Sie einfach diesem Link
<a href="http://pear.php.net/?devme">http://PEAR.php.net/?devme</a>
</p>
     
<h3>MDB - Beschreibung, R&uuml;ckmeldungen und Beitr&auml;ge</h3>
<p>
W&auml;hrend dieser Woche bemerkte der Autor, dass viele die Idee hinter MDB nicht kennen, bzw. falsche Vorstellungen 
davon haben. Pierre bat deshalb den Maintainer Lukas Smith um eine kurze Erkl&auml;rung zum MDB-Package:
</p> 
<p>
<h4>Der Unterschied zwischen
<a href="http://pear.php.net/package-info.php?package=DB">PEAR::DB</a> und 
<a href="http://pear.php.net/package-info.php?pacid=54">PEAR::MDB</a>
</h4>
Beide Packages besitzen eine &auml;hnliche Befehlssatz um auf eine Reihe von
RDBMS zuzugreifen. PEAR::MDB geht dabei einen Schritt weiter als PEAR::DB in
der Abstraktion -
neben der Emulation von Sequencen beherrscht es ebenfalls abstrakte Datentypen,
z.B. unterst&uuml;tzen nicht alle RDBMS Timestamps. Gleichfalls bietet es ein
datenbankunabh&auml;ngiges Verwaltungsschemas f&uuml;r die Indizierung und 
Tabellen- und Datenbankerzeugung. Es ist nicht notwendig, spezifische SQL-Skripte
bereitzustellen, damit das eigene Programm mehrere Datenbanken unterst&uuml;tzt.
Der MDB-Manager ist ebenfalls in der Lage, eine existierende Datenbank zu ver&auml;ndern,
wenn sich die Schema-Datei &auml;ndert.
PEAR::MDB profitiert dabei von den <a href="http://marc.theaimsgroup.com/?l=PEAR-dev&amp;m=100793507904834&amp;w=2">
Erfahrungen</a> bei der PEAR::DB-Entwicklung und ist mittlerweile <a href="http://freshmeat.net/screenshots/30313/">
ann&auml;hernd so schnell</a> wie PEAR::DB.
</p> 

<h4>Disclaimer:</h4>
<p>
Zur Zeit unterst&uuml;tzt PEAR::MDB nocht nicht so viele Treiber wie PEAR::DB.
Deshalb und aufgrund seiner Neuheit hat es noch nicht die Stabilit&auml;t von
PEAR::DB erreicht. Diese Situation soll bis Ende Herbst &uuml;berwunden werden. 
In <a href="http://cvs.php.net/co.php/PEAR/MDB/Readme.txt?r=1.27">Readme.txt</a>
finden sich weitere Ausf&uuml;hrungen dazu.
</p>
<p>
Lukas Smith sucht deshalb insbesondere Unterst&uuml;tzer f&uuml;r die Programmierung
neuer Treiber und Tester, die PEAR::MDB einem Feldtests unterziehen. Das gilt 
besonders f&uuml;r den Einsatz mit SqlServer und Oracle.
Er ist zu erreichen &uuml;ber die <a
href="http://pear.php.net/support.php">PEAR-Dev-Mailingliste</a> oder
die <a href="http://pear.php.net/package-info.php?pacid=54">PEAR::MDB</a>-Seite.
</p>
      
<h3>PEAR "Weekly News" Bestandteil des Nexen-Newsletter</h3>
<p>
Dank an Damien Seguy f&uuml;r die Erg&auml;nzung des Nexen-Newsletter um die 
PEAR "Weekly News".
BTW: Die PEAR "Weekly News" k&ouml;nnen auch in anderen Webseiten oder Newslettern
wiedergegeben werden. Einzige Bedingung: Der Verweis auf das PEAR-Copyright mu&szlig; 
erhalten bleiben.
</p>
     
<h2>PEAR-DEV Meldungen</h2>
            
<h3>PEAR-Lizenz-FAQ verf&uuml;gbar</h3>
<p>
Die Liste der empfohlenen Lizenzen f&uuml;r PEAR-Packages
ist im  <a
 href="http://PEAR.php.net/manual/en/faq.licenses.php">Manual</a>
 verf&uuml;gbar
</p>
         
<h3>PHP-Quell-Code-Versch&ouml;nerer</h3>
<p>
Jens Bierkandt stellte sein Package zur Diskussion. Es formatiert
Code u.a. gem&auml;&szlig; den PEAR-Standards. Einige Features:

<ul>
	<li>
   		automatische Einr&uuml;ckung von Code basierend auf
		Leerzeichen
	</li>
	<li>
		automatische Erg&auml;nzung von Leerzeilen
	</li>
   	<li>
		Formatierungen auf Basis des PEAR-Standards oder typischer C-Stil.
	</li> 
</ul>
Es wird bald im PEAR-CVS verf&uuml;gbar sein.
</p>

<h3>Inline::C in PHP?</h3>
<p>
George Schlossnagle schlug eine Funktion von Perl f&uuml;r PHP vor:
Inline::C. Denkbar ist folgender Code:
<pre>&lt;?pseudocode<br>$function_def = &lt;&lt;&lt;EOF<br>php_function(times){<br>&nbsp;&nbsp;&nbsp; int i,j;<br>&nbsp;&nbsp;&nbsp; return if (zend_parse_parameters(ZEND_NUM_ARGS() TSRMLS_CC, &amp;i,&amp;j) = FAILURE)<br>	RETURN_LONG(i*j);<br>}<br>EOF<br>Inline_C($function_def);<br>times(2,2);<br>?&gt;</pre>
Inline_C erwartet eine Zeichenkette mit C-Code, erg&auml;nzt die
notwendigen Informationen, um ein Modul zu erzeugen. Nach der 
Kompilierung des Binarys wird es in den Speicher geladen und via
dl() gestartet.
</p>
    
<h3>Namensbenennung und RFC</h3>
<p>
Mika Tuupola <a href="http://marc.theaimsgroup.com/?l=PEAR-dev&amp;m=103246883300565&amp;w=2">
schlug</a> eine Reihe von Empfehlungen f&uuml;r die Benennung von Konstruktoren und
Factory-Funktionen vor.
</p>

<h3>I18N und &Uuml;bsersetzungssysteme</h3>
<p>
Wojciech Zieli&ntilde;ski brachte erneut die Diskussion
um Packages f&uuml;r automatisierte &Uuml;bersetzungen auf.
Wolfgang Kriesing arbeitet bereits daran im Rahmen des 
I18N-Packages - zur Zeit nur im CVS verf&uuml;gbar.
Wenn Sie Funktionen zur automatischen &uuml;bersetzungen oder
Internationalisierungen ben&ouml;tigen oder darin Erfahrung haben, nehmen
Sie bitte Kontakt mit ihnen &uuml;ber die PEAR-Dev-Mailingliste auf.
</p>
<p>
In diesem Zusammenhang <a
 href="http://marc.theaimsgroup.com/?l=PEAR-dev&amp;m=103186684103620&amp;w=2">
schlug</a> James E. Flemer ein Package f&uuml;r ein
Web-Oberfl&auml;che um gettext-Kataloge zu erzeugen/betreuen.
</p>   
           
<h3>Bugs und Fixes</h3>
<p>
Dank an Nigel Armstrong, Adam Morton, Rob und Richard Heyes
f&uuml;r Bug-Meldungen und Korrekturen.   
</p>
<hr>       

<h2>Neue und vorgeschlagene Packages</h2>
            
<h3>Mail_Queue</h3>
<p>
Beim Versenden von E-Mails treten h&auml;ufig Laufzeitprobleme auf. Das wirkt sich insbesondere
st&ouml;rend bei der Generierung von Webseiten aus.
Mail_Queue l&ouml;st dieses Problem, es &uuml;bernimmt f&uuml;nf T&auml;tigkeiten:
<ul>
	<li>
	 	Speicherung der E-Mails in einem tempor&auml;reren Container, bevor sie
	 	an den MTA weitergeleitet werden - put($from, $recipient, $headers, $body);<br>
	  	$headers und $body m&uuml;ssen im Mime-Format sein.
	</li>	
	<li>
		Kontrolle der Zeitabst&auml;nde zwischen denen die
		E-Mails gesendet werden.
	</li>
   	<li>
		Backup oder L&ouml;schen von E-Mails nach dem Senden.
	</li>
	<li>
		&Uuml;berpr&uuml;fung nicht zugestellter E-Mails, erneutes
		Senden dieser bei der n&auml;chsten M&ouml;glichkeit - entweder
		bis zum Erfolg oder einer maximalen Anzahl von Wiederholungen.
	</li>
	<li>
		Versenden von E-Mails als Hintergrundprozess per Crontab&amp;Co.
	</li>
</ul>
</p>
   
<h3>DB_Grid</h3>
<p>
<a href="http://lists.php.net/article.php?group=php.PEAR.dev&amp;article=9202">Yavor Shahpasov's Package</a>
erlaubt eine dynamische Verbindungen zwischen
einer SQL-Datenbanktabelle mit einer HTML/Text-Tabelle.
</p>
 
<h3>File_Repository </h3>
<p>
Mike McCallister propagierte seine Klasse f&uuml;r die Behandlung einer
gr&ouml;&szlig;eren Anzahl von Dateien in einem Verzeichniss.
Viele Dateisysteme werden in solchen Situationen deutlich langsamer. Die
Klasse l&ouml;st das Problem auf interessante Weise, <a
 href="http://lists.php.net/article.php?group=php.PEAR.dev&amp;article=9226">seine E-Mail</a> beschreibt
den L&ouml;sungsweg.
</p>
              
<h3>Spread f&uuml;r PECL</h3>
<p>
George Schlossnagles PHP-Erweiterung ist eine Schnittstelle f&uuml;r "Spread", ein
Satz an Werkzeugen f&uuml;r die schnelle Nachrichten&uuml;bermittlung.
Es ist resistent gegen&uuml;ber &Uuml;bertragungsfehlern in Intranets und im Internet. Weitere
Informationen sind auf der <a href="http://www.spread.org">Spread-Website</a> erh&auml;ltlich.
Der Code der PHP-Erweiterung ist unter 
<a href="http://www.omniti.com/%7Egeorge/php_spread/php_spread-1.1.tar.gz">http://www.omniti.com/~george/php_spread/php_spread-1.1.tar.gz</a>
verf&uuml;gbar.
</p>
     
<h3>Audio PHP-Erweiterung f&uuml;r PECL</h3>
Tony Leake's <a href="http://lists.php.net/article.php?group=php.PEAR.dev&amp;article=9300">
PHP-Erweiterung</a> erm&ouml;glicht das Schreiben von fortgeschrittenen
Audio-Aufnahme- und Bearbeitungsprogrammen, z.B. von Multitrack-Rekordern.
Er plant f&uuml;r die Zukunft einen abstrakteren Befehlssatz um den
ecasound-Syntax zu vereinfachen.
Weitere Information sind auf <a
 href="http://www.webwise-data.co.uk/php_audio/php_audio_extension.html">http://www.webwise-data.co.uk/php_audio/php_audio_extension.html</a>
 zu finden.
     
<hr>       
<h2>Entwicklung</h2>
CVS-Aktivit&auml;ten fanden letzte Woche bei Log, LiveUser, Python, XML_Transformer, 
 HTTP_Request, DB_DataObject, DBA, HTML_QuickForm, 
 Net_Ping, Tree, Net_DNS, Net_Whois, Crypt_RC4, HTTP_WebDav, MDB, PEARDoc/FAQ und
 Mail_Queue statt.
  
</body>
</html>
