<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>x</title>
</head>
<body>
    
<p><i><small>von Alexander Merz (alexmerz@php.net)</small></i></p>
    
<p>
Alan Knowles Familie zwang ihn einige Tage Computer-Abstinenz zu &uuml;ben;-), deshalb 
die "Weekly News" diesmal von mir. <br>
<b>Kurz und b&uuml;ndig:</b>
das dominierende Thema war LiveUser, Stig registrierte einige Domains f&uuml;r PEAR
und PEAR&amp;Datenschutz.
</p>

    
<hr>  
<h2>Neue Releases</h2>
    
<h3>Stable</h3>
    
<ul>
  <li><b>XML_Transformer</b> - 
  Transformator für XML-Tags zu PHP-Code oder Text. Vergleichbar mit XSLT.</li>
  <li><b>XML_RPC</b> - 
  Befehlssatz zur Behandlung von Remote Procedure Calls</li>
  <li><b>PEAR</b> - 
  Das PEAR-Basis-System</li>
</ul>

<h3>Beta</h3>  
<ul>
  <li><b>Translation</b> - 
  Befehlssatz zum Internationalisierung von Zeichenketten</li>
  <li><b>Config</b> - 
  Befehlssatz um Konfigurationsdaten zu bearbeiten und zu schreiben</li>
</ul>

<h3>Alpha</h3>  
<ul>
  <li><b>LiveUser</b> - Benutzer- und Zugriffsrechteverwaltung</li>
  <li><b>XML_XSLT_Wrapper</b> - 
  Abstraktionsschicht für XSL-Transformationen</li>
</ul>
         
<hr>  
<h2>PEAR-DEV-Meldungen</h2>
    
<h3>Kategorie Perm?</h3>
<p>
Markus Wolff fragte ob f&uuml;r LiveUser die Kategorie Perm eingef&uuml;hrt werden soll.
Daf&uuml;r gab es keine Zustimmung; LiveUser befindet sich nun in der Kategorie Authentication.
</p>

<h3>Go PEAR, go!</h3>
<p>
Stig Bakken registrierte die Domainnamen <a href="http://go-pear.org" target="_blank">go-pear.org</a>|.com|.net.
Sie liefern das go-pear-Skript; es installiert das aktuelle PEAR-Basis-Systemeinschlie&szlig;lich des PEAR-Installers.
Um PEAR auf dem eigenen Computer zu installieren, reicht die Eingabe folgender Zeile auf der Kommandozeile<br>
<pre>lynx -source go-pear.org|php</pre><br>
</p>

<h3>PEAR&amp;Datenschutz</h3>
<p>
Derick Rethans bemerkte ein m&ouml;gliches Datenschutzproblem auf der PEAR-Website. L&auml;dt man sich
ein Package herunter, wird die IP des Herunterladers zu statistischen Zwecken gespeichert. Das 
verst&ouml;&szlig;t m&ouml;glicherweise gegen Datenschutzgesetze in einigen europ&auml;ischen L&auml;ndern.
Es gab kein endg&uuml;ltiger Entschlu&szlig; wie man mit dem Problem umgeht - wir sind Programmierer, keine
Anw&auml;lte. Wenn Sie dar&uuml;ber mehr wissen als wir, bitten wir um entsprechende Bemerkungen auf der
PEAR-Dev-Mailingliste.
</p>

<hr>   
<h2>Neue und vorgeschlagene Packages</h2>
    
<h3>HTML_Select_Country</h3>
<p>
Richard Heyes und Martin Stolten beschrieben einige Ideen f&uuml;r ein Package zur Erzeugung 
eines HTML-Men&uuml;s zur Auswahl eines L&auml;ndernamens. Das schlie&szlig;t lokal angepa&szlig;te 
L&auml;ndernamen mit ein.
</p>

<hr>    
<h2>Entwicklung</h2>
<p>
CVS-Aktivit&auml;ten gab es diese Woche bei
  bcompiler, LiveUser, DBA_Rational, MDB, Config, Cache_Lite, phyton, PEAR,
  XML_RPC, XML_XSLT_Wrapper, HTML_OOH-Forms und XML_Transformer
</p>

</body>
</html>
