<!-- EN-Revision: 1.8 -->
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>x</title>
</head>
<body>
<small><i>por Alan Knowles alan_k@php.net (traduzido por Ant&ocirc;nio Carlos Ven&acirc;ncio J&uacute;nior - floripa arroba php.net)</i></small>
<p>Ap&oacute;s algumas semanas de atividade intensa esta semana foi mais calma, com apenas 2 lan&ccedil;amentos est&aacute;veis e 2 beta. Al&eacute;m disso, continuou a discuss&atilde;o sobre fazer a documenta&ccedil;&atilde;o t&atilde;o simples quanto poss&iacute;vel, novas estat&iacute;sticas de pacotes, lan&ccedil;amentos Signed Binary, PHPDoc voltando a vida e 2 novas extens&otilde;es em C no PECL.</p>

<hr>

<h2>Novos Lan&ccedil;amentos</h2>

<h3>Est&aacute;vel</h3>
<ul>
<li><b>HTML_Javascript</b> - para trabalhar com Javascript.</li>
<li><b>Science_Chemistry</b> - classes para representar &aacute;tomos, mol&eacute;culas e macromol&eacute;culas.</li>
</ul>

<h3>Beta</h3>
<ul>
<li><b>Math_Vector</b> - para fazer c&aacute;lculos matem&aacute;ticos em vetores 2D e 3D.</li>
<li><b>MDB</b> - a camada de abstra&ccedil;&atilde;o ao Metabase do PEAR.</li>
</ul>

<hr>

<h2>Tr&aacute;fego na Lista PEAR-DEV</h2>

<h3>BIn&aacute;rios Prontos e Assinatura de Pacotes</h3>
Seguindo algumas discuss&otilde;es no IRC, Marko Karppinen postou os planos para distribuir bin&aacute;rios do PECL (extens&otilde;es PHP). Ap&oacute;s o incidente recente com o OpenSSH one algu&eacute;m colocou c&oacute;digo malicioso nos fontes da distribui&ccedil;&atilde;o, existe uma necessidade &oacute;bvia de ter uma seguran&ccedil;a adicional e checagens neste caso. Para mais detalhes leia o mail falando sobre o assunto <a href="http://marc.theaimsgroup.com/?l=pear-dev&m=102769689219883&w=2">aqui</a>.

<h3>Fazendo Documenta&ccedil;&atilde;o Mais F&aacute;cil</h3>
Atualmente est&atilde;o sendo levados em considera&ccedil;&atilde;o 3 projetos para tentar tornar a escrita de documenta&ccedil;&atilde;o para o PEAR mais f&aacute;cil.
<ul>
  <li><b>HTML to DocBook</b> - Martin Jansen prop&ocirc;s um mapeamento simples da tag de HTML &lt;H1&gt; para o DocBook - veja as notas <a  href="http://marc.theaimsgroup.com/?l=pear-dev&m=102770762000379&w=2">aqui</a>.</li>
  <li><b>PHPDoc to DocBook</b> - Alexander and Alan mencionaram que a vis&atilde;o de Alan foi de extender a ferramenta PHP_Codedoc que ele escreveu para fazer isto. Alexander escrever&aacute; um renderizador DocBook para o PHPDoc e a sa&iacute;da dever&aacute; ser diretamente adicion&aacute;vel ao Manual do PEAR.</li>
  <li><b>OpenOffice to DocBbook</b> - Wolfram Kriesing considerou escrever um conversor do XML OpenOffice -&gt; DocBook.</li>
</ul>

<h3>Estat&iacute;sticas de Pacotes Melhoradas</h3>
Tal Peer adicionou um <a href="http://pear.php.net/package-stats.php">sum&aacute;rio completo</a> para as estat&iacute;sticas dos pacotes, ent&atilde;o voc&ecirc; pode ver uma lista de quantas vezes cada pacote foi baixado.

<h3>Alta Velocidade de Acesso a Arquivos</h3>
Ap&oacute;s uma breve discuss&atilde;o sobre desempenho e leitura de arquivos, Tomas Cox postou um <a  href="http://marc.theaimsgroup.com/?l=pear-dev&m=102819831726965&w=2">r&aacute;pido benchmark</a> mostando o fread() sendo notavelmente mais r&aacute;pido do que implode('',file()).

<h3>PHPDoc Voltando a Vida</h3>
O <a href="http://www.ActiveState.com/ActiveAwards2002">consagrado</a> Derick Rethans tomou responsabilidade em arrumar o PHPDoc e ele est&aacute; procurando sugest&otilde;es sobre o que poderia ser adicionado a ele.

<h3>Erros e Corre&ccedil;&otilde;es</h3>
Obrigado a estas pessoas pela detec&ccedil;&atilde;o e corre&ccedil;ao de alguns erros: Pawe&#322; Go&#322;aszewski, Thomas Schulz, James Flemer e Peter Bowen.

<hr>

<h2>Pacotes Novos e Propostos</h2>

<h3>picoSQL</h3>
Liga&ccedil;&otilde;es ao banco de dados <a href="http://www.picosoft.it/picosql/index.html">picoSQL</a> fora adicionados ao PECL. picoSQL &eacute; um banco de dados relacional propriet&aacute;rio que tem um 'brought out into the open' com uma licen&ccedil;a LGPL.

<h3>Python</h3>
John Praise adicionou sua extens&atilde;o do Python ao PECL, permitindo que voc&ecirc; misture Python e PHP e acesse vari&aacute;veis do Python do PHP.

<hr>

<h2>Desenvolvimento</h2>
Ativo no CVS esta semana: PECL::picoSQL, PECL::python, Cache_Lite, DB, MDB, PHPDoc, Archive_Tar, Mail, Auth, HTML_TreeMenu, HTML_JavaScript, Net_Pop3, Net_Sieve, Net_URL, Pager, Mail_Mime, HTTP_Request, Tree, Math_Vector e Science_Chemistry.

</body>
</html>