<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>x</title>
</head>
<body>
<p><i><small>by Alan Knowles (alan_k@php.net) - &uuml;bersetzt von Alexander
Merz &nbsp;(alexmerz(a)php.net)</small></i></p>
<p>Die Weekly News kommen diesmal direkt aus dem "Speakers Room" der PHP-Konferenz
in Frankfurt a.M. - wo jeder an seinen Vortr&auml;gen arbeitet; Alexander
hat morgen (Mittwoch Vormittag) zwei Vortr&auml;ge &uuml;ber PEAR. Es ist
ein gesch&auml;ftige Konferenz &nbsp;und Alan wird versuchen ein paar Bilder
vom PEAR- und PHP-Team zu schie&szlig;en.<br>
<br>
Kurz und b&uuml;ndig: Diskussion um das Payment_Bibit package; der PEAR-Installer
f&uuml;rs Web ist bald verf&uuml;gbar; PEAR wurde von Yahoo erw&auml;hnt
(und wir fragen uns wann wir bei Yahoo ein "Powered bei PEAR"-Logo sehen
werden); und ein Java DataObjects-Klone f&uuml;r PEAR. Dazu zwei neue Package-Vorschl&auml;ge,
eine spezielle Klasse zur Familienforschung und eine weitere PHP-Erweiterung
von Georg Schlossnagle - ein Bytecode-Optimizer. Und letztlich noch die Liste
mit neuen Releases.</p>
<hr>
<h2>Neue Releases</h2>
<h3>Stable</h3>
<ul>
  <li><b>...</b>&nbsp;  -kommt noch.</li>
</ul>
<h3>Beta</h3>
<ul>
  <li><b>..</b>&nbsp;   -...</li>
</ul>
<hr>
<h2>PEAR-DEV-Meldungen</h2>
<h3>Payment_Bibit am Leben</h3>
Dave Mertens bekam eine Menge Post, nach dem er seine Klasse aus PEAR entfernt
hatte. Er tat dies, da er zu wenig Zeit f&uuml;r eine endg&uuml;ltige Fertigstellung
hatte. Aufgrund des Feedbacks entschlo&szlig; er sich doch wieder an die
Arbeit zu machen. <br>
<br>
<h3>go-pear web-basiert</h3>
Christian Dickmann k&uuml;ndigte eine neue Testversion seines Web-basierten
PEAR-Installers an. Er kann schnell und einfach installiert werden. Damit
ist auch eine PEAR-Installation auf Servern moglich, auf denen man kein Zugriff
auf die Kommandozeile hat. Wer Christan unterst&uuml;tzen m&ouml;chte oder
das Programm einfach nur ausprobieren m&ouml;chte erh&auml;lt es von:<br>
<br>
<a
 href="http://dickmann.homeunix.org/pear/pearweb/public_html/go-pear.php">http://dickmann.homeunix.org/pear/pearweb/public_html/go-pear.php</a><br>
<br>
<h3>Erw&auml;hnung von PEAR auf der PHPCon (USA) - Yahoo setzt auf PHP</h3>
PEAR wurde w&auml;hrend eines Vortrags auf der PHPCon erw&auml;hnt. Ein Yahoo-Mitarbeiter
besprach die Migration einer gro&szlig;en Anzahl von Seiten bei Yahoo nach
PHP. Er bemerkte, da&szlig; PEAR noch nicht mit CPAN vergleichbar ist - die
regelm&auml;&szlig;igen Leser wissen, dass mit PHP 4.3 PEAR &nbsp;qualitativ
besser sein wird als CPAN. <br>
<br>
<h3>Java DataObjects-Klone in PEAR</h3>
Andi Guntmans (von Zend) fragte nach einen &Auml;quivalent f&uuml;r Java's
DataObjects in PEAR. DB_DataObjects besitzt einige Merkmale, die er ben&ouml;tigt
- aber ist interessiert an einer vollst&auml;ndigen Implementierung analog
der Java-Version .<br>
&nbsp;
<h3>Bugs und Fixes</h3>
Danke an Andres Salomon, Lorenzo Alberton and Javier Conti f&uuml;r ihre
Korrekturen und Fehlermeldungen.
<p></p>
<hr>
<h2>Neue und vorgeschlagene Packages</h2>
<h3>Bytecode Optimizer</h3>
<p>George Schlossnagle's Erweiterung optimiert PHP Bytecode und unterst&uuml;tzt
dabei APC und bcompiler - das erm&ouml;glicht eine OpenSource Alternative
zu den Optimierern von Zend und InCube.</p>
<h3> Genealogy_Gedcom</h3>
Olivier Vanhoucke's Package unterst&uuml;tzt den Benutzer bei der Stammbaum-Forschung
- wer sich damit besch&auml;ftigt, kann sich jetzt dabei vom Computer unterst&uuml;tzen
lassen.<br>
<br>
<hr>
<h2>Entwicklung<br>
</h2>
<p> Aktivit&auml;ten im CVS gab es diese Woch bei Auth, Auth_HTTP, Date,
DBA, File_HtAccess, File_Password, HTML_Quickform, HTML_Select, HTML_Talbe,
HTML_TReeMenu, I18N, Image_Transform, Log, Mail, MDB, Net_UserAgent, Pager,
PECL::apd, Tree, dazu einige Updates f&uuml;r peardoc2, die auf Basis von
Alexanders neuem Programm pd2pm erzeugt wurden - es erzeugt Docbook f&uuml;r
peardoc unmittelbar aus den PHPDoc-Kommentaren.</p>
s<br>
</body>
</html>
