<!-- EN-Revision: 1.4 -->
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>x</title>
</head>
<body>

<p><i><small>por Alan Knowles - alan_k@php.net (traduzido por Ant&ocirc;nio Carlos Ven&acirc;ncio J&uacute;nior - floripa@php.net)</small></i></p>

<p>Esta semana foi um pouco mais tranquila na lista de desenvolvimento, ent&atilde;o as not&iacute;cias desta semanas devem ser poucas e boas, sendo a maior parte da discuss&atilde;o focada na mudan&ccedil;a para dirname(__FILE__) como forma de incluir arquivos. Al&eacute;m disto temos 3 novos lan&ccedil;amentos, sendo 1 est&aacute;vel e 2 betas.</p>

<hr>

<h2>Novos Lan&ccedil;amentos</h2>
    
<h3>Est&aacute;vel</h3>
<ul>
  <li><b>Date</b> - um pacote para permitir a manipula&ccedil;&atilde;o e formata&ccedil;&atilde;o de datas.</li>
</ul>

<h3>Beta</h3>
<ul>
  <li><b>spread</b> - uma extens&atilde;o PHP que fornece uma interface completa ao protocolo de comunica&ccedil;&atilde;o <a href="http://www.spread.org">spread</a>.</li>
  <li><b>APD</b> - &eacute; uma extens&atilde;o PHP que prov&ecirc; um debugger e profiler repleto de recursos para o PHP.</li>
</ul>

<hr> 

<h2>Tr&aacute;fego na Lista PEAR-DEV</h2>
    
<h3>HTML_Select, um conjunto de padr&otilde;es para caixas de sele&ccedil;&atilde;o</h3>
<p>Continuaram as discuss&otilde;es sobre o HTML_Select, um conjunto comun de menus de sele&ccedil;&atilde;o, como pa&iacute;ses, condados, etc; e como isto deveria funcionar com o pacote HTML.</p>

<h3>Caminhos do PEAR no require_once e usando dirname(__FILE__)</h3>
<p>Lukas Smith trouxe de volta uma discuss&atilde;o sobre mudar a estrutura de require_once do PEAR para dirname(__FILE__), ao inv&eacute;s de depender da correta escolha do include path pelo usu&aacute;rio. Isto parece ser um fato comum quando trabalahndo com ambientes de hosts compartilhados e foi argumentado que isto poderia levar a um pequeno aumento na velocidade, j&aacute; que o PHP n&atilde;o precisaria pesquisar cada diret&oacute;rio no include path antes de incluir o arquivo. As discuss&otilde;es continuam.</p>

<h3>Estrutura de arquivos do MDB</h3>
<p>Lukas mencionou que ele colocaria mais um item na lista de pend&ecirc;ncias do MDB, movendo os arquivos do MDB para a estrutura padr&atilde;o do PEAR.</p>

<hr>

<h2>Pacotes Novos e Propostos</h2>
    
<h3>Apache_LogParser</h3>
<p>Sagi Bashari anunciou um pacote para analisar os arquivos de log do Apache e construir estat&iacute;sticas baseadas nas informa&ccedil;&otilde;es contidas nele. Isto tamb&eacute;m &eacute; &uacute;til quando analisando outros aplicativos que possuem arquivos de log em formatos semelhantes aos do Apache, como o do Squid.</p>

<hr>

<h2>Desenvolvimento</h2>
<p>Ativo no CVS esta semana: Date, DBA, DB_Relational, MDB, PECL::apd,
PECL::bcompiler, PECL:python, PECL::spread, XML_XSLT_Wrapper. Al&eacute;m de alguns poucos commits ao PEARDoc2, o novo manual do PEAR.</p>
</body>
</html>
