<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>x</title>
</head>
  <body>
  
<p><i><small>by Alan Knowles(alan_k@php.net) traduit par Arnaud Limbourg
(arnaud@limbourg.com)</small></i></p>
  
<p>Dans un mail sur la liste de diffusion Wolfram Kriesing a remerci&eacute;
tous les contributeurs de PEAR pour leur travail. Gr&acirc;ce &agrave; PEAR
il a pu d&eacute;velopper son projet rapidement et fa&ccedil;ilement, ce,
d&ucirc; &agrave; une grande qualit&eacute; de code. PEAR montre ainsi ses
qualit&eacute;s par son homog&eacute;n&eacute;it&eacute;, une attitude souple
de "choix sur &eacute;tag&egrave;re", facilitant ainsi la vie des d&eacute;veloppeurs
et du projet en simplifiant la maintenance et la gestion. Comme d'habitude
cette semaine fut mouvement&eacute;e avec une discussion sur les syst&egrave;mes
de fichiers virtuel, les plans pour pear.php.net (avec les pr&eacute;parations
pour la sortie officielle de PEAR avec php 4.3.0). Le package DBA s'est fait
d&eacute;coup&eacute; en morceaux. De nouveaux fruits sont apparus. 4 packages
tables et 3 beta ainsi que deux propositions.</p>
  
<hr> 
<h2>Nouvelles sorties</h2>
  
<h3>Stable</h3>
  
<ul>
   <li><b>Image_GraphViz</b>&nbsp; - Une librairie pour travailler avec les
outils GraphViz d'AAT&amp;T (Une librairie graphique et de visualisation)</li>
   <li><b>Benchmark</b>&nbsp; - Permet de faire des bancs de tests sur des
scripts et fonctions.</li>
   <li><b>PHPUnit</b>&nbsp; - un framework de tests de non-regression pour
&ecirc;tre s&ucirc;r que les m&eacute;thodes d'une application produisent
les r&eacute;sultats escompt&eacute;s.</li>
   <li><b>XML_Transformer</b>&nbsp; - Une librairie permettant de de lier
des fonctions php   &agrave; des tags XML.</li>
 
</ul>
  
<h3>Beta</h3>
  
<ul>
   <li><b>DBA</b>&nbsp;  - Un wrapper autour des fonctions php, incluant
un &eacute;mulateur de fichiers DBA</li>
   <li><b>Net_Dict</b>&nbsp; - permet d'interroger les serveurs internet
de dictionnaires</li>
   <li><b>Mail_Queue</b>&nbsp; - une librairie permettant de g&eacute;rer
des files d'attentes d'envoi d'un grand nombre de mails.</li>
 
</ul>
  
<hr> 
<h2>Trafic de la liste de diffusion PEAR-DEV</h2>
  
<h3>Syst&egrave;me de fichiers virtuel</h3>
 Jon Wood &agrave; annon&ccedil;&eacute; son intention de d&eacute;velopper
un package de Syst&egrave;me de fichiers virtuel. Cette annonce &agrave;
&eacute;t&eacute; suivie d'une int&eacute;ressante discussion sur l'utilisation
du package idoine provenant de Horde. A cette fin Chuck Hagenbuch a "packager" 
Horde_VFS en tant que package pear (s'intallant donc avec la commande pear).
Cependant, l'impl&eacute;mentation d'une API orient&eacute;e objet reste
une id&eacute;e ouverte. La r&eacute;utilisation de la base de code de Horde_VFS
avec l'ajout d'une API orient&eacute;e objet est &agrave; l'&eacute;tude
sur pear-dev.  
<h3>Weeks Weekly News de la semaine derni&egrave;re</h3>
 Un grand merci &agrave; Pierre-Alain Joye d'avoir &eacute;crit &agrave;
ma place le weekly news (j'&eacute;tais occup&eacute; &agrave; tester PHP
sur de nouveaux serveurs). Il &eacute;tait int&eacute;ressant  de lire un
point de vue diff&eacute;rent sur les &eacute;v&eacute;nements li&eacute;s
&agrave; PEAR. Cela sera peut-&ecirc;tre l'une des voies &agrave; suivre,
permettant &agrave; difff&eacute;rentes personnes de vous donner une perspective 
diff&eacute;rente sur PEAR.  
<h3>Plans concernant pear.php.net</h3>
 Martin Jansen a post&eacute; un message expliquant ses id&eacute;es pour
le site web de PEAR. Parmi les id&eacute;es nous pouvons retenir un nouveau
syst&egrave;me de proposition de package, &eacute;vitant ainsi que les propositions
sur la liste ne soit noy&eacute;s dans le trafic et rendre le processus plus
transparent. Parmi les autres id&eacute;es nous trouvons une page plus d&eacute;taill&eacute;e
sur les d&eacute;veloppeurs, la liste des bugs ouvert, les demandes de fonctionnalit&eacute;s
et plus encore. Une discussion anim&eacute;e &agrave; suivie cette annonce
sur l'utilit&eacute; d'une fonctionnalit&eacute; comme "Le top ten des correcteurs",
inspir&eacute;e d'une id&eacute;e sur php-dev, sur le fait que la correction
de bugs ne devait pas &ecirc;tre motiv&eacute; par devenir un "top correcteur". 
Les bugs doivent &ecirc;tre trait&eacute;s de fa&ccedil;on plus professionnelle. 
 
<h3>PEAR::Error, un r&eacute;sum&eacute;</h3>
 Sebastian Bergmann &agrave; demand&eacute; quelle &eacute;tait la meilleure
fa&ccedil;on d'utiliser les gestion d'erreurs de PEAR. Brent Cook a post&eacute;
un <a
 href="http://lists.php.net/article.php?group=php.pear.dev&amp;article=9462">bon
r&eacute;sum&eacute;</a> sur l'utilisation de PEAR::Error. Brent &agrave;
not&eacute; que les fonctionnalit&eacute;s de PEAR::Error n'avaient pas &eacute;t&eacute;
&eacute;tendues, &eacute;tant donn&eacute; le remaniement que va impliquer
PHP5 (gr&acirc;ce aux fonctions try et catch).  
<h3>DBA divis&eacute; en trois - SQL_Parser, DBA_Relational and classic DBA.</h3>
 Brent Cook &agrave; annonc&eacute; qu'il divise DBA en trois : SQL_Parser,
package permettant d'analyser et lire des instructions SQL; DBA_Relational
fournissant des fonctionnalit&eacute;s relationnelles aux bases de donn&eacute;es
DBA; et le package DBA de base qui offre une API unif&eacute;e pour travailler
avec DB2,GDBM et les bases de donn&eacute;es cl&eacute;s/valeurs bas&eacute;es
sur des fichiers.  
<h3>Cr&eacute;ation d'une branche Zend Engine 2 (PHP5) pour la suite de tests
PHPUnit</h3>
 Sebastian Bergmann a annonc&eacute; la cr&eacute;ation d'une branche sp&eacute;ciale
Zend Engine 2 (PHP5) pour PHPUnit. Cette branche fournit les fonctionnalit&eacute;s
de tests d'espaces de noms, le nouveau passage par r&eacute;f&eacute;rence
et de vrais propri&eacute;t&eacute;s priv&eacute;es.  
<h3>Des bananes dans PEAR?</h3>
 Sebastian a eu une semaine occup&eacute;e, il a propos&eacute; l'ajout de
packages <a href="http://www.vl-srm.net">SRM</a> (serveur d'application PHP)
dans PEAR.  Les classes pour SRM sont appel&eacute;es 'Banana'. Apr&egrave;s
quelques &eacute;changes la cr&eacute;ation  d'une classe de base Banana
&agrave; &eacute;t&eacute; d&eacute;cid&eacute;e. Vous trouverez donc des
bananes dans la  librairie la plus fruit&eacute;e...  
<h3>Bugs et corrections</h3>
   Merci &agrave; ces personnes pour avoir signal&eacute; des bugs et/ou 
fournit  des patches : Pawe&#322; Go&#322;aszewski, Michael Kefeder, Michael Fork,
phpsurf, Francisco Benza. 
<hr>  
<h2>Propositions et nouveaux Packages</h2>
  
<h3>Net_Dict, permet d'interroger les serveurs internet de dictionnaires</h3>
 Chandrashekar Bhosle a propos&eacute; uen classe permettant d'interroger
les dictionnaires utilisant le protocole DICT. Cette classe &agrave; &eacute;t&eacute;
ajout&eacute;e au CVS dans la semaine. Cette classe davrait grandir jusqu'&agrave;
inclure une partie du travail que Jesus Castagnetto a effectu&eacute; sur
une classes similaire.  
<h3>XSLT, un wrapper pour les outils PHP XML Stylesheet</h3>
 Pierre-Alain Joye a annonc&eacute; un wrapper autour d'XSLT (language de
transformation de feuilles de style XML), qui fournit une API unifi&eacute;e
pour supporter les diff&eacute;rentes librairies disponibles en PHP (comme
domxsl, libxslt ou msxml4).  
<hr> 
<h2>Development</h2>
   Actif cette semaine sur le CVS : Auth, Benchmark, Cache_Lite, DB, DB_DataObject, 
DBA, DBA_Relational, HTML_Common, HTML_Quickform, Image_GraphViz, Image_Transform, 
Inline_C, Log, Mail_Queue, MDB, Net_Dict, Net_DNS, PECL:apd, PECL:bcompiler, 
PECL:mailparse, PECL:smbd, PECL:spread, Perm_LiveUser, PHPUnit, SQL_Parser, 
XML_Transformer. 
<h3>Documentation et mises &agrave; jour</h3>
 PHPdoc2 sera ajout&eacute; cette semaine sur le CVS, autorisant ainsi le
portage de la documentation existante vers le nouveau format. <br>
</body>
</html>
