<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>x</title>
</head>
<body>
<p><i><small>by Alan Knowles (alan_k@php.net) &uuml;bersetzt von Alexander
Merz (alexmerz (at) php.net)</small></i></p>
<b>Kurz und b&uuml;ndig:</b> Nach einer Woche Erholung von der PHP-Konferenz
und dem Jetlag behandeln die Weekly News die Ereignisse der letzten zwei
Wochen. Jede Menge Diskussionen und eine ganze Reihe neuer Packages - die
sonst &uuml;bliche &Uuml;bersicht der neuen Packages-Releases wurde ausgelassen,
eine automatisch generierte &Uuml;bersicht befindet sich am Ende der News.
Daf&uuml;r konzentriert sie die News st&auml;rker auf die Diskussionen und
einer &Uuml;bersicht der neuen Packages.<br>
<br>
<hr>
<h2>PEAR-DEV Meldungen</h2>
<h3>Include-Path L&ouml;sungen</h3>
Nach einigen Diskussionen in den letzten Monaten, wie mit dem PEAR-Installations-Verzeichniss
umzugehen ist - insbesondere bei Webhostern - k&uuml;ndigte Stig Bakken an,
PHP um neue Befehle zu erg&auml;nzen: '{get|set|restore}_include_path()'.
Sie erlauben die Modifikation des Include-Paths auch bei Hostern im Safe-Mode<br>
mit deaktivierten ini_set().<br>
<h3>PHPdoc-zu-PEAR-Manual-Konverter</h3>
Alexander k&uuml;ndigte die Herausgabe seines Konverters an:<br>
<p><a class="moz-txt-link-freetext"
 href="http://www-user.tu-chemnitz.de/%7Emeal/pd2pm-0.5.zip">http://www-user.tu-chemnitz.de/~meal/pd2pm-0.5.zip</a></p>
Dazu k&uuml;ndigte Greg Beaver ebenso seinen phpdocumentator-zu-peardoc2-Konverter
an. Er soll zu 85&amp; fertig sein.<br>
Beide erlauben eine schnelle Erstellung von Dokumentation.<br>
<h3>Neue Peardoc-Mailing-Liste</h3>
Die PEAR-Manual-Autoren haben jetzt ihre eigene Mailing-Liste. Wenn Sie beim
Schreiben helfen m&ouml;chten, senden Sie einfach an:
<pre wrap="">  <a class="moz-txt-link-rfc2396E"
 href="mailto:pear-doc-subscribe@lists.php.net">pear-doc-subscribe@lists.php.net</a></pre>
<h3>PHP Documentor kommt zu PEAR</h3>
Greg Beaver verk&uuml;ndete eine neue Version von phpDocumentor an, es erzeugt
aus phpdoc-Kommentaren HTML/PDF etc. Greg will das Programm<br>
als PEAR-Package bereitstellen. 
<h3>Grafische Packages in PEAR</h3>
Richard Udovich arbeit an einem Package zur Grafik-Erzeugung. Voraus ging
eine Diskussion um JpGraphPackage, da&szlig; sich bereits im PHP-CVS befindet.<br>
Kritisch dabei: seine duale Lizenz - QPL und eine kommerzielle.<br>
<h3>Bugs und Fixes</h3>
Dank an Pawe&#322; Go&#322;aszewski, Arnaud Limbourg, Mika Tuupola and Yavor Shahpasov
f&uuml;r Korrekturen und Erweiterungen Da in den letzten<br>
zwei Wochen mehr als 500 Commits stattfanden, fehlt eventuell der ein oder
andere.&nbsp;
<hr>
<h2>Neue und vorgeschlagene Packages</h2>
<h3>Spreadsheet_Excel</h3>
Xavier Noguer's Package erlaubt das schreiben von Excel-Dateien; es basiert
auf dem CPAN-Modul Spreadsheet::WriteExcel von John McNamara. Es enth&auml;lt
viele<br>
Funktionen zum Schreiben und Erzeugen von Excel-Dateien 'on-the-fly'; einschlie&szlig;lich
Formatierung, Formularen, Bildern etc. Nach der Namensdiskussion sollte es
bald in PEAR verf&uuml;gbar sein.<br>
<h3>XDB - eine XML-Datenbank-Schnittstelle</h3>
Richard Samars XDB ist ein Wrapper f&uuml;r die XML-Datenbanken Xindice und
Tamino.
<h3>Pager_Sliding - eine m&auml;chtigere Pager-Klasse</h3>
Lorenzo Albertons Package hat eine verleichbare API wie die existierende
Pager-Klasse in PEAR, aber besitzt einige weitere Funktionen; insbesondere
ist es<br>
jetzt einfacher in Templates zu integrieren.<br>
<h3>PECL::SPPLUS - Zugriff auf franz&ouml;sische Payment-System</h3>
Nicolas Chaillan's PHP-Erweiterung erlaubt den Zugriff auf das Payment-System
der&nbsp; franz&ouml;sischen Bank "Caisse Epargne".<br>
<h3>HTML_Template_SmartyLite - SimpleTemplate</h3>
Nach einer Diskussion mit Alan auf der PHP-Konferenz stellte Wolfram Kriesing
sein SimpleTemplate vor - eine Smarty-&auml;hnliche Template-Engine mit Unterst&uuml;tzung
des I18N- und Cache-Packages n PEAR. Er soll die Funktionalit&auml;t von
HTML_Template_Flexy bereitstellen - dieses Package war eine Abspaltung einer
fr&uuml;heren<br>
Version von SimpleTemplate - und es ersetzen.<br>
<h3>MySQL UDF - embedded PHP in MySQL</h3>
David Sklar's PHP-Erweiterung erlaubt PHP-basierte Stored Procedures in MySQL.
Sie basiert auf der neuen embedded-PHP-Version von PHP 4.3.
<h3>DataObjects f&uuml;r LDAP</h3>
Christian Stocker will das DataObjects-Package um eine Schnittstelle f&uuml;r
LDAP erweitern.<br>
<h3>Mnogosearch - eine neue Schnittstelle f&uuml;r die Suchmaschine</h3>
Bertrand Mansions Package erlaubt die komfortable Verkn&uuml;pfung der Suchmaschine
mit Template-Systemen wie Smarty and HTML_Template_IT.
<h3>Numbers_Spell</h3>
Piotr Klaban's Package wandelt Zahlen in die entsprechenden Zahlw&ouml;rter
um, derzeit wird amerikanisch/britisches Englisch und Polnisch unterst&uuml;tzt.
<h3>Data Structures</h3>
Robin Johnson Package soll eine Sammlung von Klassen f&uuml;r einen Datenstrukturen-Container
bereitstellen - analog zu Javas Collections.<br>
<hr>
<h2>Development</h2>
<p> CVS-Aktivit&auml;ten fanden die Woche statt bei: Cache, Cache_Lite, Date,
DB, DB_DataObject, DB_ldap, DBA, File_Find, File_HtAccess, FSM, HTML_Javascript,
HTML_QuickFrom, HTML_TreeMenu, Log, MDB, Net_URL, PECL::apd, PECL::mailparse,
PECL::optimizer, PECL::python, PECL::spplus, SOAP, Text_Password, XML_Transformer
und PEAR.</p>
<br>
</body>
</html>
