<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>x</title>
</head>
<body>
    
<p><i><small>par Alexander Merz (alexmerz@php.net), traduit par Damien Seguy
(damien.seguy@nexen.net)</small></i></p>
    
<p>
La famille d'Alan Knowles l'a forc&eacute; &agrave; rester loin des ordinateurs pour quelques jours.<br>
J'esp&egrave;re que je pourrais &eacute;crire la lettre hebdomadaire de PEAR avec le m&ecirc;me souci
de qualit&eacute; qu'il l'a fait. <br>
En bref : le sujet dominant fut LiveUser; Stig are r&eacute;serv&eacute; un nouveau nom de domaine
PEAR; PEAR et confidentialit&eacute;.
</p>

    
<hr>  
<h2>Nouvelles publications</h2>
    
<h3>Stable</h3>
    
<ul>
  <li><b>XML_Transformer</b> - Transforme des balises XML en code PHP ou en texte (concept similaire &agrave; XSLT)</li>
  <li><b>XML_RPC</b> - Une API pour g&eacute;rer les RPC (Remote Procedure Calls) : ex&eacute;cution &agrave; distance</li>
  <li><b>PEAR</b> - Le package de base PEAR</li>
</ul>

<h3>Beta</h3>  
<ul>
  <li><b>Translation</b> - Une API pour g&eacute;rer les ressources I18N</li>
  <li><b>Config</b> - Une API pour acc&eacute;der et &eacute;diter des fichiers de sources.
</ul>

<h3>Alpha</h3>  
<ul>
  <li><b>LiveUser</b> - Identification des utilisateurs, et gestion des droits.
  <li><b>XML_XSLT_Wrapper</b> - couche d'abstraction pour les moteurs XSL
</ul>
         
<hr>  
<h2>Trafic de la liste de diffusion PEAR-DEV</h2>
    
<h3>Categorie droits</h3>
<p>
Markus Wolff a demand&eacute; une nouvelle cat&eacute;gorie appel&eacute;e Perm (pour 'permissions', droits) dans LiveUser. Il n'y a pas eu d'accord, et Markus a publi&eacute; LiveUser sous la cat&eacute;gorie Authentication.
</p>

<h3>Go PEAR, go!</h3>
<p>
Stig Bakken a r&eacute;serv&eacute; les noms de domaines <a href="http://go-pear.org" target="_blank">go-pear.org</a>|.com|.net.
Ils sont utilis&eacute;s par le script go-pear, qui installe la version courante et fonctionnelle de PEAR. Si vous voulez travailler avec PEAR sur votre syst&egrave;me, utilisez la commande suivante : <br>
<pre>lynx -source go-pear.org|php</pre><br>
</p>

<h3>PEAR et confidentialit&eacute;</h3>
<p>
Derick Rethans a rep&eacute;r&eacute; des probl&egrave;mes possibles avec la confidentialit&eacute; sur le site web de PEAR. Si vous t&eacute;l&eacute;charger un package, votre IP sera stock&eacute;e pour des utilisations &agrave; fin de statistiques. Cela peut poser des probl&egrave;mes avec certaines lois europ&eacute;ennes. Il n'y a pas eu de d&eacute;cision pour r&eacute;soudre le probl&egrave;me : nous sommes des programmeurs, pas des avocats. Si vous en savez plus que nous, adressez une note &agrave; la liste PEAR-Dev.
</p>

<hr>   
<h2>Nouvelles propositiosn de packages</h2>
    
<h3>HTML_Select_Country</h3>
<p>
Richard Heyes et Marten Stolte ont soumis des id&eacute;es pour un package qui cr&eacute;erait un menu d&eacute;roulant afin de choisir un nom de pays. Il incluerait des listes de noms traduites.
</p>

<hr>    
<h2>D&eacute;velopments</h2>
<p>
  Les packages actifs sur CVS cette semaine &eacute;taient : 
  bcompiler, LiveUser, DBA_Rational, MDB, Config, Cache_Lite, phyton, PEAR,
  XML_RPC, XML_XSLT_Wrapper, HTML_OOH-Forms, XML_Transformer
</p>

</body>
</html>
