<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"><html><head><title>x</title></head><body>
<small><i>by Alan Knowles (alan_k@php.net) traduit par Arnaud Limbourg (arnaud@limbourg.com)</i></small>
<p>Toujours une semaine charg&eacute;e dans le monde de PEAR. Cinq nouvelles sorties et deux nouveaux packages ajout&eacute;s. Des discussions sur le
statut du site web pear, la renaissance du Forum et MDB en Release Candidate (ndt: version propos&eacute; au public pour faire des beta-tests)</p>

<hr>

<h2>Nouvelles Sorties</h2>

<h3>Stable</h3>
<ul>
<li><b>Var_Dump -</b> Version graphique de la fonction php var_dump</li>
<li><b>Cache</b> - Un syst&egrave;me complet de gestion de cache pour toutes sortes de donn&eacute;es</li>
<li><b>Date</b>- Une classe de gestion des dates qui peut g&eacute;rer les dates en dehors de la fen&ecirc;tre de temps Unix (1970-2038)</li>
</ul>

<h3>Beta</h3>
<ul>
<li><b>Cache_Lite</b> - Un package rapide et sur pour mettre en cache le r&eacute;sultat d'un script php.</li>
</ul>

<h3>D&eacute;veloppement</h3>
<ul>
  <li><b>MDB</b> - Une fusion entre PEAR DB et la couche d'abstraction de bases de donn&eacute;es Metabase.</li>
</ul>
<br />

<hr>

<h2>Trafic de la liste de diffusion</h2>

<h3>Trouver la liste des packages</h3>
Une petite discussion a eu lieu pour mettre un lien vers la <a href="http://pear.php.net/packages.php">liste des packages</a> depuis la page d'accueil. Le probl&egrave;me est que l'utilisation
de pear avec les versions actuelles de php n&eacute;cessite l'ex&eacute;cution du script :
<pre>lynx -source http://pear.php.net/go-pear | php</pre>
Cependant, &agrave; partir de la version 4.3.0 de php cela ne sera plus necessaire (l'installeur pear sera livr&eacute; avec la distribution php).
L'utilisation et l'acc&egrave;s aux packages n'en sera que plus simple. De plus, le site subit encore quelques changements, il serait mieux de
pr&eacute;senter un syst&egrave;me de distribution compl&egrave;tement fonctionnel plutôt que de trop "vendre" le packager (ndt: d&eacute;sol&eacute;, je n'ai pas trouv&eacute;
mieux) pear alors qu'il contient quelques bugs. Pour utiliser le site dans sa totalit&eacute; il faut, pour le moment, utiliser l'adresse :
<pre><a href="http://pear.php.net/?devme">http://pear.php.net/?devme</a></pre>
et rafraîchir la page.

L'un des probl&egrave;mes les plus agaçant &agrave; &eacute;t&eacute; corrig&eacute; cette semaine par Tomas Cox. Gr&acirc;ce &agrave; un travail fournit le processus de cr&eacute;ation de
nouveaux packages et d'upload de nouvelles sorties est beaucoup plus simple.

<h3>Un nouveau language pour les nouvelles de la semaine (ndt: traduction lit&eacute;ral de "weekly news", ce que vous &ecirc;tes en train de lire ;)</h3>
Jesus M. Castagnetto, (co-auteur du livre Professional PHP Programming ainsi que quelques packages pear) s'occupe de la traduction en
espagnol du weekly news.

<h3>MDB Release Candidate 1</h3>
Lukas Smith a consid&eacute;r&eacute; MDB comme &eacute;tant pr&ecirc;t pour le passage en release candidate. Toutes br&ecirc;che d&eacute;couverte sera combl&eacute;e avant le passage
en version 1.0 finale.

<h3>La cat&eacute;gorie PHP commence &agrave; se remplir</h3>
Apr&egrave;s quelques &eacute;changes Frederic Poeydomenge's a *upload&eacute;* sa classe Var_Dump dans la nouvelle cat&eacute;gorie PHP. PHPDoc, PHPUnit et bcompiler
oont &eacute;t&eacute; d&eacute;plac&eacute; dans le m&ecirc;me temps de la cat&eacute;gorie PEAR &agrave; PHP. Var_Dump doit &ecirc;tre renomm&eacute;e afin de respecter les conventions de nommage,
ex: PHP_VarDump ou PHP_Var_Dump.

<h3>Les questions soulev&eacute;es par le moteur Zend 2 (Zeng Engine)</h3>
Brad Bulger a remarqu&eacute; que l'utilisation du nouveau moteur Zend avait des effets secondaires int&eacute;ressants dont il est int&eacute;ressant de
suivre l'&eacute;volution. L'effet en question concerne la fonction mkdir du package System, cette m&eacute;thode a le m&ecirc;me nom que la fonction standard
PHP. Comme il n'est plus obligatoire, dans le moteur Zend 2, d'utiliser $this-&gt;mkdir() pour appeler une m&eacute;thode locale, le moteur
confond l'appel de la fonction mkdir et de la m&eacute;thode mkdir...

<h3>Le Forum revient &agrave; la vie</h3>
&#1050;&#1074;&#1086;&#1090;&#1080;&#1088;&#1086;&#1085;&#1080;&#1077; Wodzu a demand&eacute; s'il pouvait reprendre le d&eacute;veloppement du package
Forum afin de convertir les noms aux standards de codage et ajouter de nouvelles fonctionnalit&eacute;s. Comme toujours cette demande &agrave; &eacute;t&eacute;
acceuilli avec beaucoup d'enthousiasme et encouragements.

<h3>Docbook rendu facile - OpenOffice XSLT</h3>
Sandro Zic a indiqu&eacute; l'existence de convertisseurs OpenOffice vers Docbook XSLT disponibles &agrave; l'adresse
<a href="http://www.chez.com/ebellot/ooo2sdbk/">http://www.chez.com/ebellot/ooo2sdbk/</a>.
Si quelqu'un d&eacute;sire l'essayer, la communaut&eacute; PEAR serait ravie de voir les r&eacute;sultats.

<h3>Bugs et Corrections</h3>
Merci &agrave; ces personnes d'avoir trouv&eacute; et corrig&eacute; des bugs : James Flemer, Mika
Tuupola, Matt Allen, Rob, Pierre-Alain Joye, Arnaud Limbourg, Troels Arvin et
Wim Vinckier

<hr />

<h2>Nouveaut&eacute;s et propositions de packages</h2>

<h3>Var_Dump</h3>
Var_Dump  est une classe permettant d'afficher de façon plus d&eacute;taill&eacute;e et &eacute;l&eacute;gante le contenu de variables. Pour l'instant elle est
orient&eacute;e vers une sortie HTML.


<h3>PECL::Threads</h3>
Apr&egrave;s avoir r&eacute;solu les difficult&eacute;s techniques li&eacute;s &agrave; l'ajout du support des Threads (ndt: je n'ai pas de bonne traduction pour ce mot) &agrave;
PHP, Alan Knowles and Shane Caraveo ont conçu un prototype se trouvant dans PECL. Cette extension multi plate-forme vous permet, pour
l'instant, de d&eacute;marrer l'ex&eacute;cution d'un script php &agrave; l'int&eacute;rieur d'un script php en train de s'ex&eacute;cuter avec une syntaxe proche de
include. Des variables peuvent &ecirc;tre &eacute;chang&eacute;s entre les deux Threads. Cette extension est tr&egrave;s pratique des serveurs TCP ou des
applications GTK ... La cr&eacute;ation d'une fonction plus standard thread_create('function_name') est &agrave; l'&eacute;tude.

<hr />

<h2>D&eacute;veloppement</h2>
Ont &eacute;t&eacute; actif cette semaine sur le CVS MDB, HTML_Javascript,
HTML_Post, DB_DataObject, PECL::Threads, I18N, Console_Getopt, Cache_Lite,
Auth, DB, Date, HTML_QuickForm, DB_ldap, HTTP_Upload, Math_Numbers and Net_Ping.


<br />
</body></html>
