<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"><html><head><title></title></head><body>
<small><i>by Alan Knowles alan_k@php.net (&uuml;bersetzt von Alexander Merz alexmerz(at)php.net)</i></small>

<p>Willkommen zur ersten Ausgabe der w&ouml;chentlichen PEAR-Neuigkeiten, der hoffentlich noch viele 
folgen werden. 
Inhaltliches Ziel ist der Überblick &uuml;ber die neusten PEAR Packages und eine Zusammenfassung der
wichtigsten Diskussion auf den PEAR Mailing-Listen.
<br>

</p>
<h2>New Releases </h2>
<h3>Stable</h3>
<p>Diese Woche gab es das erste Release von Config und Updates f&uuml;r PEAR::DB, der zentralen PEAR-Klassen, 
Auth_HTTP, Net_Ping und HTML_Tree.
<br>

<br>
Besonders hervorzuheben ist eine verbesserte Version des PEAR-Installers. Wie man ihn herunterladen 
und testen kann, erf&auml;hrt man im Manual:
<a href="http://pear.php.net/manual/en/installation.getting.php">http://pear.php.net/manual/en/installation.getting.php</a>

<br>
</p>
<h3>Beta</h3>
<p>Beta-Releases gab es von XML_svg2image und der "Pearified" Metabase Datenbank-Abstraktion (kurz: MDB). MDB macht große 
Vorschritte und kann bereits ausgiebig auf Herz und Nieren getestet werden.

</p>
<h2>PEAR-DEV Meldungen </h2>

<h3>Benutzer-Authentifizierung </h3>  
Ein altes Thema ist wieder einmal in Form einer API f&uuml;r Benutzerregistrierung und -authentifizierung
aufgetaucht. Im Vorfeld der Diskussion war man sich bereits einig, dass eine allgemeine API f&uuml;r alle m&ouml;glichen 
Anwendungsf&auml;lle kaum zu realisieren sei. Trotzdessen wurde w&auml;hrend der Diskussion interessantes 
Referenzmaterial genannt und die Entwicklung scheint Richtung LDAP&amp;Co zu gehen.
<br>

<h3>Neues Feature f&uuml;r den PEAR-Installer </h3>  
Alexander pr&auml;sentierte eine Idee f&uuml;r die Installation von Anwendungen auf Basis
des PEAR-Package-Managers (aka PEAR-Installer). Zwar erhielt er auf der PEAR-Dev-Mailingliste
keine Antwort, daf&uuml;r wurde der Vorschlag im #pear-IRC-channel intensiv diskutiert. Die Verantwortlichen 
des Package-Managers wollen den Vorschlag umsetzen, wenn die derzeitige Version des Package-Manager 
vern&uuml;nftig unter Windows
und Unix l&auml;uft.
<br>

<h3>Caching f&uuml;r XML-RPC </h3> 
Christian Dickmann entwickelte einen Cache f&uuml;r das PEAR XML-RPC-Interface um die 
Performance des PEAR-Installers zu verbessern.
<br>

<h3>Pear Log und Windows/Unix Unterschiede </h3>  
Wie in einigen Experimenten festgestellt wurde, benutzen Windows und Unix verschiedene Syslog-Fehlercodes. 
Dies hat unmittelbar Einfluß auf das PEAR::Log-Package. Als L&ouml;sung bietet es sich an, die vordefinierten Konstanten 
komplett zu ignorieren und stattdessen systemabh&auml;ngig PEAR-eigene PEAR_LOG_*-Konstanten zu definieren.
<br>

<h3>Pear Weekly News </h3>
Nach einigen Diskussion wie man diese Neuigkeiten am besten verwalten kann, entschied man sich
zun&auml;chst f&uuml;r eine Datei-basierte L&ouml;sung. Langfristig k&ouml;nnte diese aber durch eine Datenbank-basierte 
L&ouml;sung ersetzt werden - wenn sich ein Freiwilliger für die Programmierung findet.
Der erste Programmcode f&uuml;r die Auslieferung der neusten PEAR-Neuigkeiten unterst&uuml;tzt
verschieden Sprachen und die automatische sonnt&auml;gliche Herausgabe 
<br>
<br>
<br>

<hr>

<h2>Development </h2>

CVS-Aktivit&auml;ten fanden letze Woche bei Pager, HTML_Tree_Menu, PEAR_Frontend_Web, MDB, DB, DB_DBA, HTML_Quickform, Tree 
und Image_Transform statt.<br>
<br>
</body></html>
