<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>x</title>
</head>
<body>
<p>
<small><i>por Alan Knowles (alan_k@php.net)
traducido por Jes&uacute;s M. Castagnetto (jmcastagetto@php.net)</i>
</small>
</p>

<p>Con 5 nuevos lanzamientos esta semana, incuyendo el Segundo Candidadato
de Lanzamiento de MDB y 2 nuevos paquetes, PEAR continua su crecimiento
beneficiandose grandemente de nuevos contrubuidores que enviaron
c&oacute;digo, soluciones a problemas, y nuevas ideas. El eterno problema
de crear documentaci&oacute;n para esta creciente colecci&oacute;n de
herramientes esta siendo atacado en varios frentes con herramientas que
convierten phpdoc a docbook, y con convertidores desde OpenOffice. Esta
semana algunas clases tales como Auth/Permissions y Config, han sido
reexaminadas y hay planes para hace mejoras de importancia en estas.
Tambi&eacute;n, Rasmus ha ayudado en clarificar algunos de los problemas
al usar c&oacute;digo licensiado baje la GPL.
</p>

<hr>
<h2>Nuevo Lanzamientos</h2>

<h3>Estable</h3>

<ul>
<li><b>Net_IPv4</b> - Una clase para hacer c&aacute;lculos en direcciones IP
(como direcciones de difusi&oacute;n, etc.)</li>
</ul>

<h3>Beta</h3>

<ul>
<li><b>DB_DataObject</b> - Un creador de SQL y Capa de Modelaje de Datos.</li>
<li><b>Math_Vector</b> -  Clases que representan vectores en 2D, 3D, etc., 
junto con clases para operar en esto vectores.</li>
<li><b>Tree</b> - Provee una forma sencilla de manipular &aacute;rboles de
datos creados de un archivo de XML o de una base de datos.</li>
</ul>

<h3>Alpha</h3>

<ul>
<li><b>Validate</b> - Una colecci&oacute;n de m&eacute;todos para comprobar la
validez de datos (tales como n&uacute;meros, email, tarjetas de
cr&eacute;dito, etc.)</li>
</ul>

<h3>En Desarrollo</h3>

<ul>
<li><b>MDB -</b> Candidato de Lanzamiento 2 del PEAR MDB, 
la capa de abstracci&oacute;n de bases de datos creada a partir
de Metabase.</li>
</ul>

<hr>
<h2>Tr&aacute;fico en PEAR-DEV</h2>

<h3>Seguimientos de los temas de la semanas pasadas</h3>

Hubo mucha discusi&oacute;n acerca de algunos t&oacute;picos que
aparecieron en las semanas pasadas, incluyendo Math_Vector, Math_Distance,
el paquete para envio de email en masa Mail_Queue, conflictos en 
System y la nueva Zend Engine, y Wolfram que continuo su an&aacute;lisis
de que PHPUnit es a veces mas exacto que lo necesario.

<h3>Integraci&oacute;n de PHPdocumentor (phpdocu) en PEAR</h3>

Como en general el desarrollo de PHPDoc ha esta algo lento, y
con PHPDocumentor (phpdocu) convirtiendose en el standard de facto
para generar documentaci&oacute;n, despues de unos mensajes on el
grupo de phpdocu, parece que este sera adoptado como la nueva
herramienta de documentaci&oacute;n de PEAR, y hay planes en
desarrollo para integrarlo como un paquete de PEAR.

<h3>Una nueva API para la clase Config</h3>

Bertrand Mansion ha hecho cambios y extensiones a la funcionalidad de
la clase Config. Estos cambios mayores hara uso de la capacidad del
instalador de PEAR para poder manejar paquetes nuevos y viejos, pues
los cambios no son compatibles con versiones anteriores de la clase.

<h3>Perm_LiveUser ahora en CVS</h3>

Marcus Wolff ha an&ntilde;adido Perm_LiveUser a CVS, siguiendo los
intentos divertidos de escojer el nombre correcto para el paquete. 
fun getting the naming right. Mientras, Lukas Smith tambi&eacute;n
ha estado trabajando en Perm_LiveUser resolviendo las situaciones en
las cuales los administradores pueden cambiar los permisos de un
usuario, mientras este esta conectado.

<h3>Detecci&oacute;n de lenguaje en las Noticias Semanales</h3>

Wolfram Kriesing sugiri&oacute; que usemos el nuevo I18N_Negotiator
para determinar en que lenguaje mostrar las noticias semanales.
Asumiendo que el paquete sea instalado en el servidor de PEAR, Alan
esta muy interesado en que se use. Esto significa que si tu has
seleccionado un lenguaje por defecto en tu navegador, entonces 
iras directamente a la p&aacute;gina adecuada.
Ondrej Jombik sugiri&oacute; el usar Net_Geo o algo similar para
determinar el pais usando la direcci&oacute;n de IP, Alan no estaba
tan contento con esto, pues al estar en Hong Kong recibir&iacute;a
Chino Tradicional (el cual no puede leer), asi que se prefiri&oacute;
que el usuario decida manualmente usando la configuraci&oacute;n de
su navegador.

<h3>Candidato de Lanzamiento 2 de MDB</h3>

Lukas Smith anunci&oacute; que ha terminado el Candidato de Lanzamiento 2
del proyecto de combinar Metabase y PEAR DB, esta nueva versi&oacute;n
incluye cambios al administrador y un interpretador del esquema de XML
mejorado. Es espera recibir comentarios (prontamente) de tal manera que la
siguiente semana se pueda lanzar la versi&oacute;n 1.0 de MDB.

<h3>Problemas con la licensia de GPL de PECL::Smbclient</h3>

La extensi&oacute;n smbclient de Jelmer Vernooij fu&eacute; puesta en PEAR,
creando preocupaci&oacute;n acerca de como manejar c&oacute;digo GPL
que esta enlazado con PHP, pues PHP usa una licencia de tipo BSD y el
enlazar c&oacute;digo que usa GPL no es permitido por la GPL. Hay
problemas similares en el Projecto Mozilla al incorporar trabajos creados
con la GPL, lo cual eventualmente llevo al usar tres licensias para
el c&oacute;digo. Rasmus ha puesto una nota en la PEAR FAQ acerca de
este asunto indicando que en lo posible se evite el enlazar c&oacute;digo
licensiado en GPL (LGPL es aceptable). La &uacute;nica soluci&oacute;n
a este problema es el tener un 'permiso' especial del grupo de Samba
para que smbclient pueda ser enlazado con la extensi&oacute;n de Jelmer.

<h3>Bugs and Fixes</h3>

Alot of Bugs and Fixes where added this week, Thanks to these
people for spotting them, Chuck Hagenbuch, Adam Maccabee
Trachtenberg, Keith Schoenefeld, Pawe&#322;
Go&#322;aszewski, Ondrej Jombik, Tabata Tomoyuki, Aaron
Hawley



<hr>

<h3>Problemas y Soluciones</h3>

<h3>Net_IPv4, calculando direcciones de difusi&oacute;n y de red</h3>

Eric ofreci&oacute; un peque&ntilde;o paquete que puede hacer
c&aacute;lculos de red, como no hubo objeciones a esto esperamos
tener pronto otra herramienta &uacute;til en PEAR.

<h3>Benchmark_Profiler</h3>

Mathias Englert anunci&oacute; Benchmark_Profiler, que si bien
es similar a Benchmark_Timer, tiene ciertas ventajas cuando se
quiere saber el tiempo usado en m&eacute;todos y funciones.


<hr>
<h2>En Desarrollo</h2>

Activos en CVS esta semana han sido Auth, Cache_Lite,
DB_DataObject, Image_Transform, Math_Vector, MDB, Net_CheckIP,
Net_DNS, NetIPv4, PECL::smbc, PECL::tclink, Perm_LiveUser, PHPDoc,
SOAP, Tree, y Validate.

<h3>Documentaci&oacute;n nueva y mejorada</h3>

Cambios a la documentaci&oacute;n de PECL::Soap, Net_IPv4 y pear
deberian de aparecer esta semana.

</body>
</html>

