<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<!-- $Id$ -->
  <title>x</title>
  
</head>
<body>
<p> <i>  <small>   by     <a
 href="http://www.appelsiini.net/%7Etuupola/">Mika Tuupola</a> (tuupola@appelsiini.net),
   <a href="http://pear.php.net/account-info.php?handle=pajoye">Pierre-Alain
Joye</a> (paj@pearfr.org), &uuml;bersetzt von Alexander Merz (alexmerz[at]php.net)<br>
  </small> </i></p>
<p>Mit dieser Ausgabe gibt es zum ersten Mal das "Package der Woche", diese
Woche im Focus: APD von <a
 href="http://pear.php.net/account-info.php?handle=gschlossnagle">George Schlossnagle</a>
- ein vollst&auml;ndiger Profiler und Debugger.<br>
 Auf der Mailingliste ging es eher ruhig zu, daf&uuml;r mehr CVS-Verkehr und
Releases (14!) als &uuml;blich.&nbsp;&nbsp;</p>
<p>Diese Woche Informationen zur Fehlerbehandlung im Konstruktor, neue phpDocumentator-Funktionen,
ein weiters Mac OS X-Tutorial und sieben Package-Vorschl&auml;ge.</p>
<hr> <!-- SECTION --><a name="1"></a>
<h2>Package der Woche</h2>
<h3>George Schlossnagles APD - ein Profiler und Debugger</h3>
<h3>Wer ist George Schlossnagle?</h3>
Georg begann vor 12 Jahren mit UNIX zu arbeiten, damals programmierte er mit
FORTRAN Programme f&uuml;r das L&ouml;sen partiell-differenzialer Gleichungen.
Erste Erfahrungen mit dem Web machte er vor 8 Jahren und seit 5 Jahren auch
beruflich. Derzeit arbeitet er als leitender Berater bei <a
 href="http://www.omniti.com/">OmniTI Computer   Consulting</a>, einer Beratungsfirma
spezialisiert auf die Erarbeitung und den Betrieb skalierbarer Web- und EMail-Systeme.<br>
<h3>Was sind die Vor- und Nachteil bei der Ver&ouml;ffentlichung unter PEAR/PECL?</h3>
 
<p>Ich denke, der einzige Fehler bei der Ver&ouml;ffentlichung von APD in
PECL war, es nicht fr&uuml;her zu tun. Von der Code- und Versions-Verwaltung
aus gibt es keinen Unterschied zwischen der Arbeit innerhalb PECLs und einem
lokal betreuten Projekt. Die PEAR-Release-Verwaltung macht es unglaublich
einfach eine neue Version heraus zu bringen und zu verteilen. Auch sehe ich
eine steigende Beachtung und Anteilnahme von Seiten der PHP-Community. Es
war verdammt cool zu sehen, dass APD unter PHP 4.3 mit dem PEAR Installer
sauber installiert wurde, ohne dass besondere Anstengungen meinerseits notwendig
waren.<br>
</p>
<h3>Was hoffst du f&uuml;r die Zukunft von PEAR/PECL?</h3>
Ich denke PEAR und PECL sind die Zukunft f&uuml;r die Verwaltung von Erweiterungen
und Paketen f&uuml;r PHP. Mit der Entkopplung von PHP-Versionen und Extension-Versionen
werden wir die Gechwindigkeit, Qualit&auml;t und Frequenz von PHP-Versionen
hoffentlich verbessern. Ich pers&ouml;nlich w&uuml;rde gerne mehr Unit-Tests
von PEAR- und PECL-Packages sehen (meine eigenen Packages haben davon unglaublich
profitiert). Unit-Tests machen das Re-Factoring einfacher und verringern das
Z&ouml;gern von Programmieren Erweiterungen/Packages Anderer zu bearbeiten,
aus ihrer Angst unerwartete Effekte hervorzurufen. Wenn Unit-Tests im PHP-Build-Prozess
sich weiter verbreiten und weitere Erweiterungen nach PECL verschoben werden,
hoffe ich auf eine Verbesserung der versions-&uuml;bergreifenden Kompatibilit&auml;t
f&uuml;r viele Erweiterungen in PECL.<br>
<br>
<h3>APD - was ist das Package?</h3>
<p>APD ist eine Zend-Erweiterung, die die Zend Engine um Profiling und Debug-Fahigkeiten
erweitert. APD hatte bescheidene Anf&auml;nge. Mein fr&uuml;herer Kollege
Dan Cowgill war extrem frustriert von den mangelnden M&ouml;glichkeit einen
Backtrace anzufertigen (das war damals zu Zeiten von PHP 4.1, bevor es debug_backtrace()
gab). Nachdem es die Backtrace-Fahigkeiten erg&auml;nzt wurden, wurde es augenscheinlich,
dass die unsere Engine ein exzellentes Interface f&uuml;r die Erzeugung von
Profiling Informationen von Scripts besa&szlig;.</p>
<p>Die Profiling-Fahigkeit war eine unglaubliche Arbeitserleichterung. Zur
damaligen Zeit war ich besch&auml;ftigt mit der Performance-Optimierung unter
Produktionsbedingungen einiger Webseiten mit mehreren Millionen Zeilen. Ohne
Profiling ist das tuning von Scripts reines R&auml;tselraten. Mit der Version
pre-0.1 von APD konnten wir bei einer Reihe von Seiten einen 500% Performance-Gewinn
erreichen, innerhalb eines Tages!<br>
</p>
<p>Fr&uuml;h nach dem ersten Release, fragte Thies Arntzen nach der M&ouml;glichkeit
die Ausgabedaten so zu &auml;ndern, dass das Programm gprof damit etwas anfangen
kann. Nach einer Weile wurde mit der Version 0.3 das 'pprof'-Format Standard,
und das Werkzeug 'pprofp' wurde erg&auml;nzt umd die Daten auszuwerten. Das
war ein gro&szlig;er Schritt, es erlaubte nun eine einfache und robuste nachtr&auml;gliche
Analyse (Anzeige von Aufrufgraphen, geordnet nach der Ausf&uuml;hrungszeit
etc.)<br>
</p>
<p>APD hat eine Anzahl weiterer Funktionen. Hervorzuheben ist der interaktive
Debugger von Alan Knowles. Damit kann eine IDE ein Script Schritt-f&uuml;r-Schritt
ausf&uuml;hren, und sie kann dabei nicht nur die Variableninhalte anzeigen,
sondern sie auch modifizieren. Die einzige IDE, die ich kenne welche diese
Funktionen vollst&auml;ndig unterst&uuml;tzt, ist Alans beeindruckendes phpMole,
das ich jedem empfehle, der sich f&uuml;r eine PHP IDE interessiert.<br>
</p>
<p>Einige selten genutzte - aber coole Funktionen sind rename_function() und
override_function(), sie erlauben den Ersatz existierender Funktionen in
der Symboltabelle durch eigenen Kreationen. Es w&auml;re sch&ouml;n, wenn
&auml;hnliche Funktionen direkt in die Zend Engine integriert w&auml;ren.
Andere Funktionen sollte man mit der Zeit eher nicht mehr benutzen. Die Backtrace-Funktionen
wurde verdr&auml;ngt von debug_backtrace und debug_print_backtrace und die
Funktionen zur &Uuml;berwachung der Symboltabelle sind nicht sonderlich n&uuml;tzlich.<br>
</p>
<h3>Welche Unterst&uuml;tzung w&uuml;nschst du dir von der Community?</h3>
<p>Eine Milliarde Dollar... mwahaha!<br>
Ernsthaft, als ich 1999 mit dem Schreiben von OpenSource-Softwar begann, hatte
ich f&auml;lschlicherweise den Gedanken, ich k&ouml;nnte ein Projekt starten
und die Leute w&uuml;rden heranstr&ouml;men um die Funktionen zu erg&auml;nzen,
die ich will. Genauso funktioniert es aber nicht! Tats&auml;chlich aber verbringe
ich (und die meisten OpenSource-Programmierer ebenfalls) viel Zeit damit,
Funktionen zu implementieren, die andere wollen, weniger mit Dinge, die mich
pers&ouml;nlich interessieren. Mein Ziel mit APD war urspr&uuml;nglich ein
Werkzeug, dass mir in meinem Job hilft, und als n&auml;chstes anderen mit
&auml;hnlichen Aufgaben zu helfen. Wen APD hilft schnelleren und besseren
Code zu schreiben, dann is es f&uuml;r mich ein erfolgreiches Projekt.<br>
<br>
Ich m&ouml;chte den Nutzer von APD danken f&uuml;r:<br>
<br>
</p>
<li>durchg&auml;ngig gute Bug-Reports, die das Bug-Fixing vereinfachten</li>
<li>f&uuml;r das Verst&auml;ndniss, das einige Fixes etwas dauerten</li>
<br>
Mit der Erwartung, dass es die Leute interessiert hier meine pers&ouml;nliche
TODO Liste f&uuml;r APD, f&uuml;r welche ich immer Hilfe suche:<br>
<br>
<li>Verbesserung der Speicherbenutzungs-Statistiken.  Ich bin nicht sicher,
ob es m&ouml;glich ist, aber es ist ein permanentes Thema, und ich bin unzufrieden
mit der derzeitigen Implementierung</li>
<li>Eine vollst&auml;ndige Portierung auf Windows.  Markus Fischer tat das
f&uuml;r v0.1, aber der neue Profiler ben&ouml;tigt neue Arbeit und ich bin
kein Windows-Programmierer.</li>
<li>Integration innerhalb der IDEs</li>
<br>
Letzlich ist es immer sch&ouml;n Erfolgsgeschichten von Leuten zu h&ouml;ren.
Auf der PHP-Con 2002, erfuhr ich, dass Yahoo APD f&uuml;r das interne Script-profiling
benutzt benutzt. Was f&uuml;r ein Auftrieb! Zu wissen, dass Leute deine Software
benutzen und gl&uuml;cklich damit sind, macht es die ganze Arbeit wert.Danke
an Georg f&uuml;r das Interview.
<h2>In der Presse</h2>
<!-- SECTION --><a name="2"></a>
<h3>PEAR auf Mac OS X erneut</h3>
<p> Das in der letzten Ausgabe genannte Mac OS X Tutorial wurde jetzt auch
<a
 href="http://www.macdevcenter.com/pub/a/mac/2003/01/21/pear_macosx.html">MacDevCenter</a>
ver&ouml;ffentlich. Da diese Seite zum   <a
 href="http://www.oreillynet.com/">O'Reilly Network</a> geh&ouml;rt, bedeutet
das gute Publicity f&uuml;r PEAR.</p>
<hr>
<p>Wen Sie weitere PEAR bezogene Artikel sehen, dann senden Sie sie uns bitte
eine Referenz&nbsp; zu&nbsp; (<a href="mailto:pear-dev@lists.php.net">pear-dev@lists.php.net</a>)
und wir werden sie in die Weekly News aufnehmen.</p>
<hr>
<h2>PEAR-DEV Meldungen</h2>
<!-- SECTION --><a name="3"></a>
<h3>Fehlerbehandlung im Konstruktor?</h3>
<p> Es gab eine kurze Diskussion &uuml;ber die empfohlene Fehlerbehandlung
innerhalb eines Klassen-Konstruktors. Die Antwort ist einfach: Obwohl es m&ouml;glich
ist $this auf eine Instanz von PEAR_Error zu setzten, sollte das tunlichst
vermieden werden; das ist ein undokumentiertes Feature und wird sich mit
PHP 5 &auml;ndern Ein besserer Ansatz ist jede Art von Fehlerbehandlung im
Konstruktor zu vermeiden und in eine separate Methode zu verschieben, die
ein Fehler zur&uuml;ckliefern kann. Eine gute M&ouml;glichkeit ist der Einsatz
des Factory-Patterns.<br>
</p>
<a name="4"></a>
<h3>Neue phpDocumentor-Funktionen</h3>
<p> Das <a href="http://phpdocu.sourceforge.net/">phpDocumentor</a>  -Entwicklerteam
erg&auml;nzte neue Tags f&uuml;r die Dokumentation: @source,  @internal,
@filesource, @example und @internal. Weitere Informationen finden sich in
den <a href="http://phpdocu.sourceforge.net/Release-1.2.0beta2">release 
notes</a>.</p>
<h3>Fehler und Korrekturen</h3>
<p>  Danke an die Menschen f&uuml;r ihre Fehlermeldungen und Korrekturen:
  Ondrej Jombik, Andres K&auml;ver, Patrick O'Lone, Bruno Pedro und   Samuli
Tuomola</p>
<hr>
<h2>Neue und vorgeschlagene Packages</h2>
<!-- SECTION --><a name="5"></a>
<h3>MDB_QueryTool</h3>
<p> Lorenzo Alberton arbeitet Wolfram Kriesings DB_QueryTool auf die Nutzung
mit MDB um.</p>
<!-- SECTION --><a name="6"></a>
<h3>Net_UserAgent_Mobile</h3>
<p> Kubo Atsuhiro's Package liefert Informationen zu den Browser auf Mobiltelefonen.
Derzeit werden unterst&uuml;tzt: NTT DoCoMo's i-mode, KDDI's EZweb und J-PHONE's
J-Sky.</p>
<!-- SECTION --><a name="7"></a>
<h3>Auth_Container_POP3</h3>
<p> Yavor Shahpasov schlug einen weiteren Container f&uuml;r Auth vor. Damit
ist eine Authentifizierung &uuml;ber POP3-Server m&ouml;glich.</p>
<!-- SECTION --><a name="8"></a>
<h3>Auth_RADIUS, Auth_Container_Radius, Crypt_CHAP</h3>
<p> Michael Bretterklieber, der betreuer von PECL::radius, schlug mehrere
Authentifizierungs-Packages vor. Auth_RADIUS eine Wrapperklasse f&uuml;r
PECL::radius. Crypt_CHAP erzeugt CHAP-packets f&uuml;r die verschiedenen
Versionen von CHAP. Auth_Container_Radius ist ein weiterer neuer Container
f&uuml;r das<br>
Auth-Package.</p>
<!-- SECTION --><a name="9"></a>
<h3>SearchEngine_Mnogosearch</h3>
<p> Bertrand Mansion's neues Package ist ein PHP Frontend f&uuml;r die popul&auml;re
  <a href="http://www.mnogosearch.org/">mnoGoSearch-Suchmaschine</a></p>
<h2>Entwicklung<br>
</h2>
<p>  Aktivit&auml;ten gab es im CVS bei:   HTML_Template_Flexy, Cache_Lite,
PECL::Radius, PEAR, DBA,    DBA_Relational, HTTP_Header, MDB, Net_SMTP, Mail,
Log, File,   I18N, SpreadSheet_Excel_Writer, MDB_QueryTool, Payment_Clieop,
  PECL::bcompiler, Tree, DB_QueryTool, HTML_Template_Xipe,    DB_DataObject,
HTML_QuickForm, PECL::imagick, Auth,   SearchEngine_Mnogosearch, Net_URL,
HTTP_Request und PECL::apd.    </p>
<br>
</body>
</html>
