<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>x</title>
</head>
<body>
<p>
 <i>
  <small>
   por
   <a href="http://www.appelsiini.net/~tuupola/">Mika Tuupola</a> (tuupola@appelsiini.net) e
   <a href="http://pear.php.net/account-info.php?handle=pajoye">Pierre-Alain Joye</a> (paj@pearfr.org)<br>
   tradu&ccedil;&atilde;o de Ant&ocirc;nio Carlos Ven&acirc;ncio J&uacute;nior (<a href="mailto:antonio@php.net">antonio at php.net</a>)
  </small>
 </i>
</p>
<hr />
<p>Esta foi uma semana cheia de novos lan&ccedil;amentos e in&uacute;meras discuss&otilde;es interessantes sobre o encontro do PEAR na <a href="http://www.php-conference.com/">PHP Conference</a>, em Amsterd&atilde;. O PEAR continua evoluindo e est&aacute; num per&iacute;odo de grandes mudan&ccedil;as.</p>
<!-- SECTION --><a name="1"></a>
<h2>Na Imprensa</h2>
<!-- SECTION --><a name="2"></a>
<p>Um tutorial do PHPUnit est&aacute; dispon&iacute;vel em Ingl&ecirc;s, Franc&ecirc;s, Alem&atilde;o e Portugu&ecirc;s em <a href="http://www.pearfr.org/index.php/en/article/phpunit">www.pearfr.org</a>.</p>
<hr>
<p>Se voc&ecirc; encontrar algum artigo relacionado ao PEAR sinta-se a vontade para nos enviar (<a href="mailto:pear-dev@lists.php.net">pear-dev@lists.php.net</a>) refer&ecirc;ncias, ent&atilde;o tal artigo ser&aacute; adicionado aqui na not&iacute;cias semanais.</p>

<hr>

<h2>Tr&aacute;fego na PEAR-DEV</h2>

<!-- SECTION --><a name="3"></a>
<h3>Emcontro do PEAR em Amsterd&atilde;</h3>
<p>O encontro do PEAR est&aacute; agendado para dia 9 de maio de 2003, &agrave;s 19:30hs, hor&aacute;rio de Amsterd&atilde;. Lukas Smith prop&ocirc;s uma lista de assuntos a serem discutidos:
 <ul>
  <li>Qualidade x quantidade</li>
  <li>Poss&iacute;veis regras para evitar alguns conflitos recentemente ocorridos na lista de discuss&atilde;o</li>
  <li>PEAR CS (conven&ccedil;&otilde;es para nomes de m&eacute;todos)</li>
  <li>PFC RFC</li>
  <li>Instalador do PEAR</li>
  <li>PEAR no Windows</li>
  <li>PEARweb (sistema de vota&ccedil;&atilde;o, sistema de coment&aacute;rios, propostas de pacotes)</li>
  <li>Promo&ccedil;&atilde;o do PEAR</li>
  <li>PHP5</li>
 </ul>
  Para n&atilde;o superestimar os resultados do encontro, j&aacute; foram definidas as seguintes prioridades:
 <ul>
  <li>melhorar o sentimento geral dentro da comunidade PEAR</li>
  <li>ter uma melhor id&eacute;ia do que o PEAR deve ou n&atilde;o deve ser e a melhor maneira de alcan&ccedil;ar tal id&eacute;ia</li>
  <li>brainstorm sobre o futuro do PEAR</li>
 </ul>
</p>
<!-- SECTION --><a name="4"></a>
<h3>LiveUser, um pacote para autentica&ccedil;&atilde;o e gerenciamento de direitos de usu&aacute;rio</h3>
<p>LiveUser prov&ecirc; as ferramentas necess&aacute;rias para gerenciar permiss&otilde;es e autentica&ccedil;&otilde;es de uma forma simples e flex&iacute;vel. Seu "sistema container" torna poss&iacute;vel ter diferentes tipos de autentica&ccedil;&otilde;es e fontes de permiss&otilde;es. A integra&ccedil;&atilde;o em um sistema existente &eacute; poss&iacute;vel criando-se um container espec&iacute;fico, permitindo ao desenvolvedor sempre ter a disposi&ccedil;&atilde;o uma mesma interface, n&atilde;o importando o que s&atilde;o os m&eacute;todos usados.<br>
Muito trabalho foi finalizado esta semana e uma grande atualiza&ccedil;&atilde;o est&aacute; planejada para segunda, dando um passo significante para chegar a uma vers&atilde;o est&aacute;vel.</p>
<!-- SECTION --><a name="5"></a>
<h3>Nomes comuns para m&eacute;todos</h3>
<p>Novamente uma discuss&atilde;o sobre as fun&ccedil;&otilde;es de entrada/sa&iacute;da se instaurou no PEAR. Algumas sugest&otilde;es tiveram uma boa recep&ccedil;&atilde;o desta vez. As d&uacute;vidas est&atilde;o na obten&ccedil;&atilde;o de dados em um formato espec&iacute;fico: "toHtml" ou "outputHtml" correspondendo respectivamente a obten&ccedil;&atilde;o e envio de dados em HTML. A tend&ecirc;ncia geral &eacute; utilizar "display" ao inv&eacute;s de "output" num contexto servidor web/navegador.</p>
<!-- SECTION --><a name="6"></a>
<h3>Quickform e sistemas de template</h3>
<p>Esta semana marcou o come&ccedil;o de um trabalho de integra&ccedil;&atilde;o de v&aacute;rios sistemas de templates dentro deste gerenciador de formul&aacute;rios, tornando a configura&ccedil;&atilde;o de p&aacute;ginas mais simples. Alexy Borzov disponibilizou um "esqueleto" bem  como o <i>engine</i> de gerenciamento do IT[X] dispon&iacute;vel no pacote HTML_Template_IT package, ajudando a melhorar as funcionalidades.</p>
<h2>Desenvolvimento</h2>
<p>Ativos esta semana no CVS:  LiveUser, XML_RSS, HTML_Template_Xipe, Tree, HTTP_Header, HTML_QuickForm, MDB, PECL/soap, 
 Auth, XML_fo2pdf, Cache, DB_DataObject, Net_URL, Crypt_CHAP, DB_ldap, imagick, HTML_Template_Flexy,  PHPUnit e Image_GraphViz</p>
</body>
</html>

