<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<!-- $Id$ -->
  <title>x</title>
</head>
<body>
<p> <i>  <small>von Mika Tuupola (tuupola@appelsiini.net), Pierre-Alain Joye
(paj@pearfr.org), teilweise bearbeitet von Arnaud Limbourg (arnaud@limbourg.com)<br>
und &uuml;bersetzt von Alexander Merz (alexmerz[at]php.net)   </small> </i>
</p>
<p></p>
<hr>
<h2>Presseschau<br>
</h2>
<h3>International Ausgabe des PHP-Magazins</h3>
<p> Wir sind erfreut die erste internationale Ausgabe des <a
 href="http://www.php-mag.net">PHP Magazine</a> zu begr&uuml;&szlig;en. In
der ersten, qualitativ guten Ausgabe findet sich eine gute Einf&uuml;hrung
zu <a
 href="http://www.php-mag.net/itr/online_artikel/show.php3?id=283&amp;p=0&amp;nodeid=114">PEAR::MDB</a>
geschrieben von Lukas Smith. Bemerkenswert auch der Artikel &uuml;ber das
Schreiben von PHP-Erweiterungen von Zeev Suraski hochstselbst.</p>
<h3>PHP-Magazin</h3>
<p> Die erste Ausgabe 2003 des deutschen <a href="http://www.phpmag.de/">PHP-Magazin</a>s
enth&auml;lt einen Artikel von Alexander Merz (A. d. &Uuml;.: ja ich!), der
auf Setup, Installation und Verwaltung von PEAR eingeht. Hartmut Holzgraefe
f&uuml;hrte in PEAR::HTTP_WebDAV_Server ein und Richard Samar beschrieb den
Zugriff auf XML Datenbanken XPath and  XQuery mit PEAR::XDB, insbesondere
mit Tamino..<br>
 Ausserdem startete Alexander Merz mit der ersten Ausgabe 2003 eine regelm&auml;&szlig;ige
Kolumne &uuml;ber PEAR.</p>
<p>Es werden immer mehr Artikel zu PEAR geschrieben. Wenn sie einen Artikel
zu PEAR finden, w&uuml;rden wir uns freuen, wenn sie uns darauf aufmerksam
machen, damit wir sie zu den WeeklyNews erg&auml;nzen k&ouml;nnen.<br>
</p>
<hr>
<h2>PEAR-DEV Meldungen</h2>
<!-- might add this later

<h3>CS changes for PHP5?</h3>
<p>
</p>

-->
<h3>DB_DOM bereit f&uuml;rs CVS</h3>
<p> Sandro Zic informatierte die Mailingliste, dass er mit der "PEARification"
begonnen hat. Das Package f&uuml;r die DOM-&auml;hnliche Verwaltung von XML-Inhalten
in einer RDBMS-Tabelle wurde bereits von der Community akkzeptiert und ist
demn&auml;chst im CVS zu finden. Leider fand noch keine Einigung &uuml;ber
den Namen statt, weiter Kommentare <a
 href="mailto:pear-dev@lists.php.net">erw&uuml;nscht</a>!<br>
Namensvorschl&auml;ge bisher: DB_DOM, DB_XML, DB_XML_DOM, XML_DB  and XML_DB_DOM.&nbsp;
.</p>
<h3>PEAR-F&ouml;rderverein?</h3>
<p>  Es gab eine heftige Diskussion ob ein Sponsor- und F&ouml;rderverein
f&uuml;r die PEAR Entwickler gegr&uuml;ndet werden sollte oder nicht. Es
gibt bereits einige &auml;hnliche Vereine f&uuml;r andere gro&szlig;en Projekte
wie FreeBSD und PERL. PEAR spielt leider noch nicht in dieser Liga mit solchen
Open-Source-Projekten, ein F&ouml;rderverein scheint derzeit eher etwas &uuml;bertrieben
zu sein. Die derzeitige M&ouml;glichkeit der Angabe einer Amazon-Wishlist
wird derzeit als angemessen betrachtet.<br>
</p>
<h3>Bugs und Korrekturen<br>
</h3>
<p>Danke f&uuml;r das Finden und Beseitigen von Fehlern an:   Warren Konkel,
Demian Turner, Patrick O'Lone, Jeroen Houben,   Vlad Borisoff and Blake Schwendima.</p>
<hr>
<h2>Neue und Vorgschlagene Packages</h2>
<h3>Net_LMTP</h3>
<p> Damian Alejandro Fernandez Sosa's Package versendet EMail via LMTP (Local
Mail Transfer Protocol, definiert in <a
 href="http://www.faqs.org/rfcs/rfc2033.html">RFC 2033</a>). Als Namensvorschlag
wurde Net_LMTP akkzeptiert.  Net_LMTP basiet auf Net_SMTP.</p>
<h3>PhpDocumentor</h3>
<p> <a href="http://pear.php.net/package-info.php?pacid=173">PhpDocumentor</a>,
verf&uuml;gbar von <a href="http://www.phpdoc.org/">http://www.phpdoc.org/</a>,
kann jetzt auch per PEAR Installer installiert werden. Wer Probleme mit der
Installation der beta2 unter Windows hat, sollte unbedingt eine EMail an
die <a href="mailto:pear-dev@lists.php.net">Mailingliste</a> schicken.<a
 href="mailto:pear-general@lists.php.net"></a></p>
<h3>Gtk_VarDump</h3>
<p> <a href="http://pear.php.net/package-info.php?pacid=166">Gtk_VarDump</a>
wurde erstmals in PEAR releast.</p>
<h2>Entwicklung<br>
</h2>
<p>  Aktivit&auml;ten im CVS gab es bei:   Net_SMTP, Mail_Mbox, MDB, Image_GIS,
DB_QueryTool, I18N, HTTP_Header,   Spreadsheet_Excel_Writer,HTTP_Request,
PECL::apd, DB_DataObject,   PECL::bcompiler, Gtk_VarDump, PEAR, Perm_LiveUser,
DB, HTML_OOH_Form,   PECL::session_pgsql, PECL::imagick. PECL::spplus, PECL::radius,
  PECL::vpopmail und Console_Table.</p>
<br>
</body>
</html>
