<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<!-- $Id$ -->
  <title>x</title>
</head>
<body>
<p> <i>  <small>   von <a href="http://www.appelsiini.net/%7Etuupola/">Mika
Tuupola</a> (tuupola@appelsiini.net),    <a
 href="http://pear.php.net/account-info.php?handle=pajoye">Pierre-Alain Joye</a>
(paj@pearfr.org) &uuml;bersetzt von Alexander Merz (alexmerz[at]php.net) 
 </small> </i></p>
<p></p>
 Gesch&auml;tiges Treiben im PEAR-Land: neun Releases, darunter zwei neue
Packages - damit z&auml;hlt PEAR nun 151 Packages. Die gr&ouml;&szlig;te
Kategorie ist Networking mit 27 Packages, danach kommt HTML mit 15 und Database
mit 11 Eintr&auml;gen. Trotz der Vielzahl sollte nicht vergessen werden,
dass Qualit&auml;t der Quantit&auml;t immer noch vorgezogen wird.
<hr><!-- SECTION <a name="1"></a>
<h2>Package of the week</h2>
<h3></h3>
<h3></h3>
<p>
</p>
-->
<h2>In the press</h2>
<!-- SECTION --><a name="2"></a>
<h3></h3>
<p> Leider nichts &uuml;ber PEAR in der Presse</p>
<hr>
<p>Wenn Sie einen PEAR-bezogenen Artikel finden, senden Sie uns bitte eine
Referenz an <a href="mailto:pear-dev@lists.php.net">pear-dev@lists.php.net</a><br>
<br>
</p>
<hr>
<h2>PEAR-DEV Meldungen</h2>
<!-- SECTION --><a name="3"></a>
<h3>PEAR DB und MDB-Entwicklung</h3>
<p>Lukas Smith &auml;u&szlig;erte seine Sorge &uuml;ber die Integration neuer
Funktionen in PEAR::DB ohne R&uuml;cksichtnahme auf ihr Realisierung in MDB.
Wenn MDB die Standard-Abstraktionsschicht in PEAR werden soll, ist die R&uuml;ckw&auml;rts-Kompatibilit&auml;t
zu DB wichtig. Wenn nicht, w&uuml;nscht er sich mehr Freiheiten bei der MDB-Entwicklung.
Derzeit gibt es noch keine endg&uuml;ltige Entscheidung welche Stellung DB
und MDB in Zukunft besitzen, und ob MDB DB ersetzen soll bzw. ob ihre Entwicklung
unterschiedliche Wegen gehen wird.</p>
<!-- SECTION --><a name="4"></a>
<h3>Aufrechterhaltung von Qualit&auml;tstandards</h3>
<p>In einer anderen Nachricht beschrieb Lukas das Problem, dass es derzeit
nicht einfach ist zu Verfolgen wie Packages vorgeschlagen und akzeptiert
werden und warum. Er hat den Eindruck, dass die PEAR-Community ihre Erwartung
herunterschraubt und nicht alle Packages die Qualit&auml;tsforderungen erf&uuml;llen.<br>
</p>
<p>Als L&ouml;sung f&uuml;r Package-Vorschl&auml;ge und ihre Akzeptanz brachte
er die alte Idee einer "New Package Proposal"-Seite auf der PEAR-Website
wieder auf. Neue Packages w&uuml;rden &uuml;ber diese Seite pr&auml;sentiert
und dar&uuml;ber abgestimmt. Das aktuelle System funktioniert - wird aber
problematisch, wenn die Anzahl der Entwickler zunimmt.</p>
<p>Hinsichtlich des Qualit&auml;tsproblem liegt es an den PEAR-Entwicklern
zu entscheiden, ob sie der Qualit&auml;t gegen&uuml;ber der Quantit&auml;t
den Vorzug geben gegen.</p>
<!-- SECTION --><a name="5"></a>
<h3></h3>
<p></p>
<!--
<h3>Bugs and Fixes</h3>
<p>
  Thanks to these people for spotting and fixing some bugs:
</p>
<hr>
-->
<h2>Neue und vorgeschlagene Packages</h2>
<!-- SECTION --><a name="5"></a>
<h3>HTML_PageHandler</h3>
<p> Wolfram Kriesings HTML_PageHandler-Klasse &uuml;bernimmt typische Aufgaben
f&uuml;r die Verwaltung von Formularen. Sie fungiert als Wrapper f&uuml;r
Klassen wie DB_QueryTool und k&uuml;mmert sich um Ereigniss wie das Sichern,
Entfernen oder Bearbeiten von Daten.<br>
</p>
<!-- SECTION --><a name="6"></a>
<h3>HTTP_Session</h3>
<p> Alexander Radivanovich's Klasse ist ein Wrapper f&uuml;r die eingebauten
PHP-Session-Befehle, es bietet eine objektorientierte API und die Speicherung
von Session-Daten in Datenbanken via PEAR::DB.</p>
<!-- SECTION --><a name="7"></a>
<h3>Net_IMAP</h3>
<p> Damian Alejandro Fernandez Sosa entwickelt eine PHP-basierte Implementierung
des IMAP-Protokolls, damit ist der Zugriff auf IMAP auch ohne IMAP-Erweiterung
m&ouml;glich.</p>
<!-- SECTION --><a name="8"></a>
<h3>Crypt_DES</h3>
<p> Tim Thorpe schlug sein Package vor, es implementiert den DES-Algorithmus
in PHP oder greift auf dielibmcrypt-Erweiterung zur&uuml;ck, wenn sie vorhanden
ist. </p>
<h2>Entwicklung<br>
</h2>
<p>  Aktivit&auml;ten gab es diese Woche im CVS bei:   HTML_Form, HTML_Template_Xipe,
Config, DB_QueryTool,    HTTP_WebDAV_Server, Image_GraphViz, PEC::uuid, Auth_SAP,
  PEAR, PECL::ntuser, PECL::radius, Net_Ping, Tree,    HTML_QuickForm, Config,
HTML_Template_Flexy,    HTML_Template_PHPLIB, Auth_SASL, Perm_LiveUser, PECL::cybercash,
  DB_DataObject, Net_Ident, Spreadsheet_Excel_Writer,    Image_GIS, DB, HTML_Form,
File_HtAccess, Date und PECL::namazu</p>
<br>
</body>
</html>
