<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>x</title>
</head>
<body>
&lt;&lt;&lt;&lt;&lt;&lt;&lt; 20030119.en.html
<p> <i>  <small>   von Mika Tuupola (tuupola@appelsiini.net) &nbsp;- &uuml;bersetzt
von Alexander Merz (alexmerz[at]php.net)   </small> </i></p>
<p>Da PEAR aus dem BETA-Status heraus ist und PHP 4.3 der PEAR Installer standardm&auml;&szlig;ig
enth&auml;lt, leben die Weekly News wieder aus. Diese Woche gibt es Informationen
zum Abstimmungsprozess f&uuml;r vorgeschlagene Packages, &uuml;ber ein PEAR
Tutorial f&uuml;r MAc OS X, neue PHPDoc-Templates &nbsp;und zum fehlenden
PEAR Installer in der Windows-Binary-Paket. Und es gab acht neue Releases
diese Woche.<br>
</p>
<hr>
<h2>INTERVIEW MIT STIG BAKKEN</h2>
<small> by Pierre-Alain Joye (paj@pearfr.org)</small>
<h3>Wer ist Stig Bakken?</h3>
  Stig (30) ist seit 10 Jahren mit Unix und der Webentwicklung besch&auml;ftigt.
Seit 1999 arbeitet er als Senior-Software-Entwickler f&uuml;r Fast Search&amp;Transfer
in Trondheim, Norwegen. FAST ist Googles gr&ouml;&szlig;ter Konkurrent im
OEM-Suchmaschinen-Markt, Stig ist Technischer Leiter f&uuml;r FATSs Multimedia-Suchmaschine.<br>
Eine Demonstration findet sich auf <a target="_new"
 href="http://www.alltheweb.com/">www.alltheweb.com</a> (nat&uuml;rlich PHP-basiert).<br>
<h3>Was ist PEAR?</h3>
  PEAR ist ein PHP spin-off mit verschiedenen Zielen:   <li> eine Bibliothek
hohwertigen, wiederverwendbaren PHP-Codes und Erweiterungen</li>
  <li> Code-Richtlinien f&uuml;r Komponenten mit konsistenter API</li>
  <li> ein Vertriebs- und Installations-Framework zur verteilung dieser Komponenten</li>
Die Abk&uuml;rzung steht f&uuml;r: PHP Extension and Application Repository.
Die Abk&uuml;rzung entstand nat&uuml;rlich befor sie eine Bedeutung bekam.
<h3>Was ist PECL</h3>
  PECL (die PHP Extension Code Library) ist eine Untergruppe von PEAR f&uuml;r
PHP Erweiterung, die in C oder C++ geschrieben sind.<br>
<h3>  Was ist der Zusammenhang zwischen PHP und PEAR/PECL, wir sahen eine
gro&szlig;e Anzahl an Verschiebungen von Erweiterungen von PHP zu PECL (und
es scheint weitere werden folgen) ?</h3>
Immer mehr Erweiterungen werden nach PECL verschoben; mit der Zeit, wenn
PHP 5 erscheint, werden die meisten Erweiterungen 'gepickelt' ("PECL'ed").
Das ist der erste neue Schritt im Projektmanagment f&uuml;r PHP. Zuk&uuml;nftige
Versionen von PHP werden weiterhin mit einer gro&szlig;en Anzahl an Erweiterungen
ausgeliefert, die Erweiterungen werden w&auml;hrend des Release-Prozesses
importiert und in den Release-Tarball eingef&uuml;gt.<br>
<br>
Zweck daf&uuml;r ist die Verbesserung des PHP Release-Prozesses. Heute erfordert
ein neues PHP mehrere Monate. Mit dem Import stabiler Versionen von Erweiterungen
aus PECL in die PHP Quellcode-Distribution, statt sie im PHP CVS zu halten,
wird es weniger Unbekannte w&auml;hrend des PHP QA-Prozess geben,<br>
da die Erweiterungen von PECL ihre eigene QA haben. Das wird hoffentlich
den Release-Prozess von PHP auf Wochen statt Monate verk&uuml;rzen, und erh&ouml;ht
die allgemeine Qualit&auml;t von PHP-Erweiterungen. Ich m&ouml;chte betonen,
dass es nicht bedeutet, dass PHP zuk&uuml;nftig ohne Erweiterungen ausgeliefert
werden. PHP wird zuk&uuml;nftig auch mit Erweiterungen ausgeliefert werden,
aber ihre Qualit&auml;t wird mit PHP 5 h&ouml;her sein.<br>
<br>
Zus&auml;tzlich, wenn 'shared' Erweiterungen gebaut werden (nicht direkt
in PHP einkompliert, sondern als dynamisch ladbare Programmerweiterung),
wird es m&ouml;glich sein, Erweiterungen individuell ohne PHP selber zu updaten.<br>
<h3>Was ist der Unterschied zwischen den Kern-PEAR und den &uuml;brigen Bestandteilen?
</h3>
Die PHP beiligenden "Kern"-Pakete sind zweier Art: notwendig f&uuml;r den
Installler - und eine Satz von Paketen von hoher Qualit&auml;t und vom allgemeinen
Interesse.<br>
Die zweite Art wird hoffentlich sp&auml;ter die Grundlage f&uuml;r die "PHP
Fundation Classes" (PFC) bilden<br>
<h3>Darf der Package Manager und die Package-Definition von jedem PHP-Entwickler
f&uuml;r Projekt genutzt werden - privat oder kommerziell?<br>
</h3>
<h3></h3>
Jeder darf &nbsp;eine eigene Kopie von pear.php.net aufsetzen und f&uuml;r
den Vertrieb eigener PHP-Komponenten verwenden. Es gibt bereits eine Reihe
Projekte die beganneb die PEAR Tools f&uuml;r eigene Projekte zu verwenden.<br>
<h3>Was werden die n&auml;chsten Ziele f&uuml;r PEAR sein? </h3>
Als aller erstes mu&szlig; der Windows-Installer-Supoort stabil sein. Durch
die Weihnachstferien und schlechtes Timing wurde der PHP 4.3.0 Windows-Installer
ohne PEAR ausgeliefert, das wird mit PHP 4.3.1 korregiert. Auch muss der
Vertrieb von Win32-Binary-Releases klappen. Danach ben&ouml;tigen wir eine
plattform-&uuml;bergreifendes Paket-Signaturen-Infrastruktur, so dass die
Leute binary problemlos installieren k&ouml;nnen. Das ist aufwendiger f&uuml;r
PEAR als z.B. RPM, der PEAR Installer mu&szlig; eine gro&szlig;e Zahl an
Plattformen und Konfigurationen unterst&uuml;tzen. Und es gibt viel Arbeit
mit der Migration nach PHP 5.<br>
<h3>Immer mehr Menschen geh&ouml;ren zur PEAR Community mit dem hinzuf&uuml;gen
neuer Funktionen oder neuer konkurrierender Pakete, wie wird das verwaltet?
</h3>
Wir haben einen Abstimmungsprozess auf der pear-dev-Mailingliste, wo jeder
Stimmen f&uuml;r seinen Paket-Vorschlag sammeln kann. &Uuml;blicherweise
wird kein Projekt abgelehnt, auch wenn es sich mit anderen &uuml;berlappt.
Aber da wir eine gemeinsame Mailingliste f&uuml;r die PEAR Entwickler haben,
finden sich 'konkurrierende' Entwickler recht schnell zusammen und schaffen
eine gute L&ouml;sung aus eigenem Antrieb. Meine eigene Rolle ist einfach
die Community, von zeit zu Zeit, in die richtige Richtung anzustossen.
<hr>
<h2>PEAR-DEV Meldungen</h2>
<h3>Wer darf abstimmen?</h3>
<p>Auf der Mailingliste wurde gefragt, ob nur ein CVS-Account zur Abstimmung
&uuml;ber neue Packages berechtigt. Nach den <a
 href="file:///manual/en/developers.contributing.howto.php">Hinweisen</a>
was ein Entwickler ist, wird deutlich das ein Entwickler nicht unbedingt
einen CVS-Account haben muss - jeder auf der Liste darf abstimmen.<br>
</p>
<h3>Tutorial &uuml;ber PEAR auf Mac OS X</h3>
<p>Pierre-Alain Joye find ein <a
 href="http://www.somebodydial911.com/brainstem/osx_pear/">Tutorial</a> &uuml;ber
die PEAR-Installation auf Mac OS X. Das Tutorial ist umfassend, es beginnt
mit den Grundlagen &uuml;ber die Installation von PHP-CLI und dem Aufsetzen
der korrekten Umgebungsvariablen. Dazu finden sich Informationen &uuml;ber
die Installation und Benutzung des PEAR Package Managers,<br>
 Erzeugung von Entwicklerdokumentation mit PHPDoc und dem Einsatz der PEAR-Klassen
in eigenen Programmen.<br>
</p>
<p>Das Tutorial kann auch als F&uuml;hrer f&uuml;r die Installation von PEAR
auf Unix-Systemen genutzt werden, der einzige Unterschied besteht wohl in
der Kompilierung von PHP-CLI aus dem Quellcode.<br>
</p>
<p>Was noch fehlt ist ein &auml;hnliches Tutorial f&uuml;r Windows...</p>
======= 
<h3>PEAR-phpdoc-Template</h3>
<p>Christian Dickmann verk&uuml;ndete, dass seine <a
 href="http://dickmann.homeunix.org/pear/phpdoc/PEAR/">PEAR Templates</a>
f&uuml;r PHPDoc weitestgehend fertig sind und fragte nach Feedback. Die Templates
sehen sehr gut aus. <br>
Die Templates erfordern    <a href="http://www.phpdoc.org">phpDocumentor</a>.</p>
<h3>Windows-Verpackungsfehler</h3>
<p>F&uuml;r Konfusion unteer Windowsbenutzern f&uuml;hrte die Installation
von PEAR - der PEAR Installer ist nicht in der Windows Bin&auml;r-Distribution
enthalten. Das wurde nicht beabsichtigt und entstand durch einen Packfehler.
Dieser Fehler wird mit PHP 4.3.1 korregiert werden.<br>
</p>
<h3>Fehler und Korrekturen<br>
</h3>
<p>Danke f&uuml;r das Finden und Korregierenvon Fehlern an:    Lorenzo Alberton,
Tobias Schlitt, Michele Manzato, Markus Wolff</p>
<hr>
<h2>Neue und vorgeschlagene Packages</h2>
<h3>HTTP_Header, HTTP_Header_Cache</h3>
<p>  Wolfram Kriesings vorgestelltes Paket implementiert allgemeine Header-Methoden
und die Behandlung von Cache-Header.</p>
<h3>DB_Abstract</h3>
<p>  Wolfram Kriesing schlug auch ein Paket zur Erzeugung und Ausf&uuml;hrung
von Datenbank-Befehlen basierend auf DB vor. Das Paket hat &Auml;hnlichkeiten
mit DB_DataObject, konzentriert sich aber st&auml;rker auf die Erzeugung
von SQL-Befehlen statt auf das Erzeugen von Objekten.</p>
<h3>Enterprise A&amp;A</h3>
<p>  Tony Bibbs schlug eine neues Authentifizierungs&amp;Authorisierungs-Paket
vor. Nach einigen Diskussionen stieg die Wahrscheinlichkeit, sein Paket mit
LiveUser zu verbinden.</p>
<h3>GTK_VarDump</h3>
<p>  Alan Knowles Klasse liefert eine VarDump-Ausgabe in einem GTK-Fenster.</p>
<hr>
<h2>Development</h2>
<p>    CVS-Aktivit&auml;ten gab es bei: Net_SMTP, DBA_Relational,   PECL::session_pgsql,
PHPUnit, DB, MDB, XML_Transformer, HTML_QuickForm,   PECL::soap, Net_SmartIRC,
Cache_Lite, HTML_Template_Xipe, PECL::tclink,   Net_SMTP, Mail, Perm_LiveUser,
I18N, Spreadsheet_Excel_Writer,   Pager_Sliding, XML_XPath, Net_UserAgent,
Image_GIS, File_HtAccess,    HTML_TreeMenu, DB_QueryTool, HTTP_Header</p>
<br>
<br>
</body>
</html>
