<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<!-- $Id$ -->
<html>
<head>
  <title>x</title>
</head>
<body>
<p>
 <i>
  <small>
   by
   <a href="http://www.appelsiini.net/~tuupola/">Mika Tuupola</a> (tuupola@appelsiini.net),
   <a href="http://pear.php.net/account-info.php?handle=pajoye">Pierre-Alain Joye</a> (paj@pearfr.org)
  </small>
 </i>
</p>
<hr />
<!-- SECTION --><a name="1"></a>
<h2>Package de la semaine</h2>
<h3>Les packages de Richard Heyes</h3>
<h3>Qui est Richard Heyes ?</h3>
<p>
 Acutellement, je suis un d&eacute;velopeur ind&eacute;pendant. Je vends et 
 maintiens V-webmail commercialement qui, comme son nom l'indique, est un
 webmail (disponible ici: <a href="http://www.v-webmail.co.uk">
http://www.v-webmail.co.uk</a>).
</p>

<h3>Comment es-tu venu &agrave; PEAR ?</h3>
<p>
 J'ai commenc&eacute; simplement en proposant un couple de classes que j'avais
 pr&eacute;c&eacute;demment &eacute;crites, et cel&agrave; continue depuis ce 
 l&agrave;. Finalement il a &eacute;t&eacute; d'&eacute;crire directement mon 
 code en utilisant les conventions et styles de codage PEAR au lieu d'utiliser 
 ce que j'utilisais &agrave; cette &eacute;poque.
</p>

<h3>De quel(s) package(s) es-tu le plus fier ?</h3>
<p>
 Mon favori actuel devrait &ecirc;tre HTML_TreeMenu. C'est un ensemble de classe
 &eacute;tonnante (ndt: traduc perso, qqn a ca en fr?:) ) qui vous permet de cr&eacute;er
 tr&egrave;s facilement des menes en arbre (D)HTML. Vous pouvez l'utiliser soit manuellement,
 construisant votre structure d'abre dans votre script, ou, en utilisant les m&eacute;thodes
 r&eacute;cemment ajout&eacute;es ajout&eacute;es qui vous permettent d'importer des structures
 d'arbres existante depuis ma propre classe Tree, de la classe PEAR::TRee, ou le plus utile
 depuis un simple fichier XML. Ce dernier fait de la mainteance des menus de navigation une
 formalit&eacute;, m&ecirc;me pour les graphistes.
</p>

<h3>Quels sont les avantages et inconv&eacute;nients de publier votre travail dans PEAR ?</h3>
<p>
 Les avantages incluent une &eacute;vidente et large audience pour votre travail, laquelle,
 au tournant, vous fait entrer dans les tests libres et le report de bugs (parfois m&ecirc;me
 les fixes). :) Je ne peux pas vraiment penser a des d&eacute;savantages; peut-&ecirc;tre
 l'effort initial pour obtenir l'approbation, sp&eacute;cialement si il y a d&eacute;j&agrave;
 un package aux fonctionnalit&eacute;s similaires (ce qui fait sorit la mauvaise herbe de la paille
). et les rapports de bugs ;).
</p>

<h3>Tu travail sur un excellent webmail, v-webmail, peux-tu nous expliquer comment PEAR
t'aide dans sa r&eacute;alisation ?</h3>
<p>
 V-webmail utilise un grand nombre de packages PEAR, principalement mes propres ajouts
 &agrave; PEAR d&ucirc;s &agrave; mes besoins pour V-webmail. Il y a aussi quelques autres 
 packages incluant Log, Console_GetOpt et System. Je ne me repose pas vraiment sur l'installer
 purement pour rendre l'installation de l'application beaucoup plus simple. Les packages 
 n&eacute;cessaires sont distribu&eacute;s avec V-webmail et mise &agrave; jour quand cel&agrave;
 est n&eacute;cessaire. Cel&agrave; rend la vie plus simple gr&acirc;ce &agrave; la disparition
 des conflits de version, de packages manquants, etc.
</p>

<h3>Qu'esp&egrave;res-tu pour le futur de PEAR/PECL ?</h3>
<p>
 Je pense que PEAR manque actuellement cruellement d'un leadership fort, lequel
 devient vital si il vient &agrave; grandir avec un ensemble coh&eacute;rent de buts.
 Cel&agrave; pourrait &ecirc;tre quelques individus qui ont &eacute;t&eacute; sur le 
 projet durant un p&eacute;riode significative, un peu, si vous aimez,  comme le mode
 de fonctionnement du php-group, mais avec comme r&ocirc;le de diriger le projet dans
 la bonne direction et en l'amenant l&agrave;-bas, au lieu de t&acirc;ches purement
 administratives. Ceci et et le meilleur du code :).
</p>
<p>
Merci &agrave; Richard Heyes pour cette interview.
</p>
<h2>Dans la presse</h2>
<!-- SECTION --><a name="2"></a>
<p>
phpKitchen a publi&eacute; un tutorial sur HTML_TreeMenu
(<a href="http://www.phpkitchen.com/article.php?story=20030227061009685">http://www.phpkitchen.com</a>)
</p>
<p>
  phpwebsite (<a href="http://phpwebsite.appstate.edu/">http://phpwebsite.appstate.edu/</a>), un
  tr&egrave;s bon CMS, a sorti sa version 0.9.0 (stable). Il est toujours agr&eacute;able de voir de bons
  softs utiliser PEAR comme partie de leur core.
</p>
<hr>
<p>
 Si jamais vous lisez un article sur PEAR n'h&eacute;sitez pas &agrave; nous en faire
 part, envoyer un message (sur <a href="mailto:pear-dev@lists.php.net">pear-dev@lists.php.net</a>)
 avec les r&eacute;f&eacute;rences et cela sera ajout&eacute; &agrave; la lettre hebdomadaire.
</p>

<hr>

<h2>PEAR-DEV traffic</h2>

<!-- SECTION --><a name="3"></a>
<h3>pearfr.org, a dedicated site to PEAR</h3>
<p>
 <a href="http://www.pearfr.org">www.pearfr.org</a> est un nouveau site d&eacute;di&eacute; &agrave;
 PEAR. Le but principal est de mettre &agrave; disposition des tutoriaux et documentations utiles
 &agrave; la bonne compr&eacute;hension de PEAR. Ces documents sont disponibles en fran&ccedil;ais, 
 en anglais, et bient&ocirc;t en allemand.<br>
 Un autre but primordial est de f&eacute;d&eacute;rer les efforts de r&eacute;daction et de traductions de la
 documentation officielle.
 Vous pouvez les contacter si vous pensez pouvoir les aider en traduisant ou en &eacute;crivant les documentations 
 et tutoriaux, y compris dans d'autres langues que celles actuellement support&eacute;es.
/p>
<!-- SECTION --><a name="4"></a>
<h3>PFC, PEAR Foundation Classes RFC</h3>
<p>
  De tr&egrave;s bonne discussions ont eut lieu cette semaine &agrave; propos du futur de PEAR.
  Christian Stocker &eacute;crit un r&eacute;sum&eacute; vers le milieu de la semaine, commencant 
  ainsi:<br>
  "Le but de PEAR Foundation Classes est de fournir du code bien &eacute;crit,
  bien document&eacute;, bien test&eacute; et pouvant &ecirc;tre facilement &eacute;tendu 
  au sein de PEAR et le marq&eacute; comme tel. Afin de devenir un PFC, une classe 
  devra respecter des r&egrave;gles strictes. Des utilisateurs de PFCs peuvent assurer
  que ces classes pass&egrave;rent aux travers de r&eacute;examens et de tests et doit &ecirc;tre
  logiquement le premier choix pour une t&acirc;che donn&eacute;e."
  Vous pouvez lire la discussion compl&egrave;te  
  <a href="http://marc.theaimsgroup.com/?l=pear-dev&w=2&r=1&q=b&s=PFC-RFC+Update">here</a>.
</p>
<!-- SECTION --><a name="5"></a>
<h3>The PEAR Geographical stats</h3>
<p>
  Publi&eacute; par Damian Alejandro Fernandez Sosa, la publication d'informations g&eacute;graphiques 
  sur les membres de PEAR semble &ecirc; int&eacute;ressante, nous avons vu de beaux exemples d'autres
  statistiques g&eacute;ographiques.
</p>
<!-- SECTION --><a name="5"></a>
<h3></h3>
<p>
</p>

<!--
<h3>Bugs and Fixes</h3>
<p>
  Thanks to these people for spotting and fixing some bugs:
</p>
<hr>
-->

<h2>New and Proposed Packages</h2>
<!-- SECTION --><a name="5"></a>
<h3>DB_ldap2 and DB_ldap3</h3>
<p>
  DB/ldap2 and DB/ldap3 are DB backends for respectively LDAP V2 and V3 databases. They implement
  the common DB interface as much as possible, but unfortunately, it is not compatible with the current
  DB_ldap. However it supports prepare/execute statements (which are powerfull) and is more flexible, as
  said the author, Piotr Roszatycki.
</p>
<!-- SECTION --><a name="6"></a>
<h3>xsd2db conversion</h3>
<p>
 Sandro Zic did a proof of concept converting a XML schema definition to MySQL CREATE 
 TABLE statements with XSLT. A preview is available 
 <a href="http://cvs.sourceforge.net/cgi-bin/viewcvs.cgi/zzoss/zzoss/utils/xsd2db/">here</a>.
 The purposes of this package is to provide several xsd2db stylesheets for various RDMS and LDAP.
</p>
<!-- SECTION a name="7"></a>
<h3></h3>
<p>
</p>
-->
<h2>Development</h2>
<p>
  Active on CVS this week have been:
  XML_Parser, MDB, Cache_Lite, I8N, Net_UserAgent_Mobile, DB_ado,
  Net_DNS. PECL::imagick, DB_DataObject, Mail_Queue, Tree,
  Spreadsheet_Excel_Writer, PECL::soap, HTML_QuickForm, PECL::myphp,
  DB_QueryTool and Perm_LiveUser
</p>

</body>
</html>
