<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<!-- $Id$ -->
<html>
<head>
  <title>x</title>
</head>
<body>
<p>
 <i>
  <small>
   by
   <a href="http://www.pearfr.org">Pierre-Alain Joye</a> (paj@pearfr.org),<br>
   <a href="http://www.appelsiini.net/~tuupola/">Mika Tuupola</a> (tuupola@appelsiini.net)
  </small>
 </i>
</p>
<div align="center">
<h2>
  L'Ann&eacute;e de PEAR<br>
  <a href="http://www.php-mag.net/itr/ausgaben/psecom,id,133,nodeid,112.html">
    <img src="/gifs/phpmag02cover.gif" border ="0" align="center">
  </a>
</h2>
</div>
<h2>PEAR et Windows, enfin une r&eacute;alit&eacute;</h2>
<p>
 Apr&egrave;s des mois d'attente, les outils d'installations et de gestions de
 PEAR sont enfin stables et fonctionnels sur les plateformes Windows. Le script
 d'installation go-pear.php a &eacute;t&eacute; r&eacute;vis&eacute;
 enti&egrave;rement et test&eacute; intensivement sur les diff&eacute;ntes
 versions de windows actuellement disponibles.<br>
 Afin de b&eacute;n&eacute;ficier de l'ensemble des corrections, nous vous
 recommandons d'utiliser les modules et scripts livr&eacute;s avec les snapshots
 de PHP 4 (voir paragraphe suivant).
</p>
<p>
 Je (votre humble serviteur pierre ;-) ), tiens particuli&egrave;rement
 a remerci&eacute; les personnes suivantes pour avoir rendu possible ce
 petit "miracle" ;) soit par l'impl&eacute;mentations de nouvelles interfaces, en me
 fournissant des fixes ou des rapports d'erreurs tr&egrave;s complets:
 <ul>
 <li>Christian Dickmann, auteur de PEAR_Frontend_Web et de go-pear Web</li>
 <li>Urs Gehrig, tests intensifs sous Windows, corrections de bugs</li>
 <li>Stig S. Bakken, finalisations des changements sous linux, commits/MFH,
 ainsi que ses pr&eacute;cieux conseils</li>
 <li>Edin Kadribasic, int&eacute;gration des scripts de snapshots PEAR dans
 la distribution PHP</li>
 </ul>
</p>
<h2>PEAR, PHP 4.3.2 et snapshots</h2>
<p>
 Afin de permettre aux utilisateurs de windows de disposer du m&ecirc;me
 environnement que sur les plateformes Unix, PEAR sera &agrave; nouveau
 inclus dans les distributions PHP, et ce d&egrave;s la version 4.3.2 de PHP.
 Le script go-pear ainsi que les packages n&eacute;cessaires &agrave;
 l'installation de PEAR seront disponibles dans le dossier PEAR de la distribution.<br>
 Un simple click sur go-pear.bat lancera la proc&eacute;dure d'installation.
 <br>
 Les packages livr&eacute;s avec PHP:
 <ul>
 <li>PEAR</li>
 <li>phpUnit</li>
 <li>XML_Parser</li>
 <li>XML_RPC</li>
 <li>Archive_Tar</li>
 <li>Console_Getop</li>
 <li>DB-1.4b1</li>
 <li>Mail</li>
 <li>Net_SMTP</li>
 <li>Net_Socket</li>
 <li>Net_UserAgent_Detect</li>
 <li>PEAR_Frontend_Web</li>
 <li>HTML_Template_IT</li>
 <li>Pager</li>
 </ul>

 <br>
 <a href="http://snaps.php.net">PHP 4 Stable snapshots</a><br>
</p>
<h2>Go-pear, installation Web</h2>
<p>
 Bien qu'encore &agrave; au stade alpha, l'installation de PEAR via un
 navigateur Web ainsi que le fronted Web des outils PEAR se trouve
 livr&eacute; en standart dans PHP. Ceci permettant aux nombreux
 utilisateurs ne disposant pas d'acc&eagrave;s console de mettre en place
 un environnement PEAR via leur navigateur favori. Tous probl&egrave;mes
 ou bugs peuveut &ecirc;tre signal&eacute;s via l'interface habituelle
 <a href="bugs.php.net">bugs.php.net</a>.<br>
 <br>
 Utilisation de go-pear Web:
 <ul>
 <li>
 R&eacute;p&eacute;rer le script go-pear (t&eacute;l&ecute;charger
 depuis http://go-pear.org (enregistrer sous) ou dans les snaphots PHP)
 </li>
<li>
 Placer ce fichier go-pear quelques parts dans l'arborescence web de votre
 serveur. Le chemin le plus simple &eacute;tant de cr&eacute;er un nouveau
 dossier pour PEAR et de placer ce ficher dans celui-ci.
</li>
<li>
 Acc&eacute;der &agrave; ce fichier au traver de votre navigateur
 et suivez les instructions. Soyez s&ucirc;re que PHP ait un acc&egrave;
 en &eacute;criture &agrave; ce dossier.
</li>
<li>
 Apr&egrave;s avoir ex&eacute;ter go-pear, vous allez obtenir un lien vers
 le Frontent WEB de l'installeur PEAR. Je vous sugg&egrave;re de bookmarker ce lien.
</li>
<li>
 Prot&eacute;ger ce dossier et le script go-pear avec un mot de passe. Par exemple
 en utilisant un .htaccess sur les serveurs Apache.
</li>
</ul>
</p>
<hr />
<h2>L'Ann&eacute;e de PEAR </h2>
<p>

 C'est un r&eacute;el plaisir de voir notre projet figur&eacute; &agrave; la
 une de <a href="http://www.php-mag.net">PHP Magazine</a>.<br>
 Ce texte prometteur est une r&eacute;compense pour les membres de PEAR ayant
 activement contribuer &agrave; son &eacute;volution, sa promotion, ou en y
 ajoutant des packages de qualit&acute; ainsi qu'aux nombreux utilisateurs nous
 envoyant quotidiennement leurs impressions, d&eacute;sirs ainsi que les
 in&eacute;vitables rapports de bugs.<br>
 Nous remercions la soci&eacute;t&eacute; &eacute;ditrice du magazine
 Software&amp;Support Verlag GmbH et particuli&egrave;rement &agrave; leurs
 rédacteurs en chef:<br>
 <ul>
 <li>Derick Rethans</li>
 <li>Jan Lehnardt</li>
 </ul>
 Dans cet &eacute;dition sp&eacute;ciale PEAR, vous trouverez des articles de
 qualit&eacute; &eacute;crits par des membres  actifs et talentueux
 de la communaut&eacute; PHP et PEAR:
 <ul>
  <li>
  Introduction &agrave; PEAR, Stig S. Bakken<br>
  Stig introduit ici les notions de bases de PEAR, l'utilisation
  de l'installeur ainsi que quelques modules du coeur de PEAR.
  </li>
  <li>
  Syt&egrave;me de d&eacute;ploiement bas&eacute; sur PEAR, Alexander Merz<br>
  Alexander d&eacute;crit pas &agrave; pas la mise en place d'une infrastructure
  de d&eacute;ploiement pour vos applications en utilisant les APIs de gestions
  de packages de PEAR ainsi que les outils Server (utilis&eacute;s sur pear.php.net).
  </li>
  <li>
   Gestion d'erreur PEAR, Alexander Merz<br>
   Une excellente explication des m&eacute;canisme de gestion d'erreurs de PEAR.
   Un document devant figurer a cote de tous d&eacute;velopeur PEAR.
   (<a href="http://www.php-mag.net/itr/online_artikel/psecom,id,330,nodeid,114.html">disponible en ligne</a>)
  </li>
  <li>
  PEAR::Tree, Sterling Hugues<br>
  Utilisation du package PEAR::Tree
  </li>
  <li>
  PHPDocumentor, fantastic Documentation, by Greg Beaver<br>
  Greg, auteur de PHPDocumentor, aborde ici l'ensemble des &eacute;tapes pour
  la publication de documentations de qualit&eacute; en utilisant PHPDocumentor,
  tout en nous fournissant quelques conseils avis&eacute;s.
  </li>
  <li>
  XML Transformer, Kristian K&ouml;hntopp<br>
  XML Transformer, alternative &agrave; XSLT, est abord&eacute; ici par des
  exemples simples et clairs. Ouvrant ainsi la porte &agrave; la puissance
  et la "simplicit&eacute;" de XML Transformer.
  </li>
  <li>
  Python in PHP, Jon Parise<br>
  Jon Parise, auteur de l'extension Python (PECL) aborde l'utilisation
  de modules python dans des scripts PHP par des exemples d'interfaces pour
  l'excellent MailMan, concluant par une description des futures &eacute;volutions
  et limitations actuelles de ce module.
  </li>
  <li>
  Utilisation de l'API Stream dans PHP 4.3, Wez Furlong<br>
  Cet article n'est pas directement li&eacute; &agrave; PEAR, n&eacute;anmoins,
  il devrait int&eacute;resser les auteurs d'extensions PECL ayant besoin
  de gestions de stream. Wez a int&eacute;gr&eacute; &agrave; PHP 4.3 une API
  compl&eacute;te et simple de Streams, facilitant ainsi leurs utilisations
  au sein de PHP.
  </li>
 </ul>
  Le magazine est disponible depuis une semaine d&eacute;j&agrave; et se trouve
  dans tous les bonnes cr&egrave;meries.
  Vous pouvez vous abonnez ici:
  <a href="https://www.entwickler.com/ssl/pme_abo.php?check=1"><img src="/gifs/phpmagazine.gif" border="0"></a>.
</p>
<!-- SECTION --><a name="1"></a>
<h2>In the press</h2>
<p>
 <a href="http://www.phppatterns.com">::phpPatterns</a> a publi&eacute; une petite introduction
 &agrave; PEAR::Soap, <a href="">PEAR::SOAP Client Fast Start</a>
</p>

</body>
</html>