<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<!-- $Id$ -->
<html>
<head>
  <title>x</title>
</head>
<body>
<p>
 <i>
  <small>
   by
   <a href="http://www.appelsiini.net/~tuupola/">Mika Tuupola</a> (tuupola@appelsiini.net),
   <a href="http://pear.php.net/account-info.php?handle=pajoye">Pierre-Alain Joye</a> (paj@pearfr.org)
  </small>
 </i>
</p>
<hr />
<p>
 Une semaine charg&eacute;e en sorties, des discussions tr&egrave;s int&eacute;ressantes
 au sujet du meeting PEAR qui se tiendra lors de la PHP Conference &agrave; Amsterdam
 (<a href="http://www.php-conference.com/">PHP Conference</a>). PEAR continue son 
 &eacute;volution, dans une p&eacute;riode de grands changements.
</p>
<!-- SECTION --><a name="1"></a>
<h2>Dans la presse</h2>
<!-- SECTION --><a name="2"></a>
<p>
 Le tutorial PHPUnit est disponible en anglais, fran&ccedil;ais, allemand et portugais br&eacute;silien
 sur <a href="http://www.pearfr.org/index.php/fr/article/phpunit">www.pearfr.org</a>.
</p>
<hr>
<p>
 Si jamais vous lisez un article sur PEAR n'h&eacute;sitez pas &agrave; nous en faire
 part, envoyez un message (sur <a href="mailto:pear-dev@lists.php.net">pear-dev@lists.php.net</a>)
 avec les r&eacute;f&eacute;rences et cela sera ajout&eacute; &agrave; la lettre hebdomadaire.
</p>

<hr>

<h2>PEAR-DEV traffic</h2>

<!-- SECTION --><a name="3"></a>
<h3>PEAR meeting &agrave; Amsterdam</h3>
<p>
 Le meeting PEAR est maintenant planifi&eacute; pour le 9 mai 2003 &agrave;
 19:30, Amsterdam. Lukas Smith a propos&eacute; une liste de sujets qui 
 pourraient &ecirc;tre abord&eacute;s :
 <ul>
  <li>Qualit&eacute; vs. Quantit&eacute;?</li>
  <li>R&eacute;gularisation possible afin de pr&eacute;venir certains conflits r&eacute;cents
sur la ML</li>
  <li>PEAR CS (Convention de noms pour les m&eacute;thodes?)</li>
  <li>PFC RFC</li>
  <li>PEAR Installer</li>
  <li>PEAR sur windows</li>
  <li>PEARweb (syt&egrave;me de votes, syt&egrave;me de commentaires, propositions de packages)</li>
  <li>promotion de PEAR</li>
  <li>PHP5</li>
 </ul>
 Afin de ne pas surestimer les buts de ce meeting, nous pouvons d&eacute;finir
 les priorit&eacute;s suivantes:
 <ul>
  <li>am&eacute;liorer le sentiment g&eacute;n&eacute;ral au sein de la communaut&eacute; PEAR</li>
  <li>avoir une meilleure id&eacute;e de ce que PEAR devrait &ecirc;tre et trouver le meilleur
moyen d'y parvenir</li>
  <li>brainstorming sur le futur de PEAR</li>
 </ul>
</p>
<!-- SECTION --><a name="4"></a>
<h3>LiveUser, un package de gestion des permissions et des authentications</h3>
<p>
 LiveUser fournit les outils n&eacute;cessaires pour g&eacute;rer les permissions
 et authentifications de mani&egrave;re souple et simple. Son syst&egrave;me de container
 offre la possibilit&eacute; de disposer de diff&eacute;rentes sources pour l'authentification 
 ou les permissions.  L'int&eacute;gration &agrave; un syst&egrave;me existant est
 possible par la cr&eacute;ation d'un container sp&eacute;fique, permettant ainsi de toujours 
 disposer de la m&ecirc;me interface,  quelques soient les m&eacute;thodes utilis&eacute;es.<br>
 De grands travaux ont &eacute;t&eacute; r&eacute;alis&eacute;s cette semaine, une mise &agrave; jour 
 majeure est pr&eacute;vue pour lundi, marquant un pas important vers une version stable.
</p>
<!-- SECTION --><a name="5"></a>
<h3>Noms des m&eacute;thodes communes</h3>
<p>
 Une nouvelle fois, une discussion sur le nom des fonctions d'entr&eacute;es/sorties a d&eacute;marr&eacute;
 sur PEAR, avec cette fois, quelques suggestions ayant re&ccedil;u un bon accueil. Il s'agit
 principalement de la r&eacute;cup&eacute;ration de donn&eacute;es sous un format pr&eacute;cis,
 par exemple: "toHtml" ou "outputHTML", correspondant respectivement &agrave; la 
 r&eacute;cup&eacute;ration et l'impression en HTML, la pr&eacute;f&eacute;rence allant plut&ocirc;t vers 
 "display" au lieu de "output" dans un contexte de serveur WEB/Browser.
</p>
<!-- SECTION --><a name="6"></a>
<h3>Quickform et les syst&egrave;mes de templates</h3>
<p>
 Cette semaine marque le d&eacute;but des travaux d'int&eacute;gration des diff&eacute;rents
 syst&egrave;mes de templates au sein de ce gestionnaire de formulaire, facilitant ainsi la mise en
 page de ceux-ci. Alexey Borzov a fournit le squelette de base ainsi que la gestion du moteur IT[X]
 disponible au sein du package HTML_Template_IT, avec un peu d'avance sur les fonctionnalit&eacute;s.
</p>

<!--
<h3>Bugs and Fixes</h3>
<p>
  Thanks to these people for spotting and fixing some bugs:
</p>
<hr>
-->

<!-- <h2>New and Proposed Packages</h2>
-->
<h2>Development</h2>
<p>
 Active on CVS this week have been:
 LiveUser, XML_RSS, HTML_Template_Xipe, Tree, HTTP_Header, HTML_QuickForm, MDB, PECL/soap, 
 Auth, XML_fo2pdf, Cache, DB_DataObject, Net_URL, Crypt_CHAP, DB_ldap, imagick, HTML_Template_Flexy,
 PHPUnit, Image_GraphViz 
</p>

</body>
</html>
