<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>x</title>
</head>
<body>
<p>
 <i>
  <small>
   by 
   Mika Tuupola (tuupola@appelsiini.net), Pierre-Alain Joye (paj@pearfr.org)
  </small>
 </i>
</p>

<p>
  Afin de c&eacute;l&eacute;brer la sortie de PEAR en version stable et comme
  installeur par d&eacute;faut de PHP 4.3.0, les Weekly News reviennent.
  Comme préface &agrave; cette &eacute;dition, vous trouverez une interview
  de Stig S. Bakken, le fondateur du projet PEAR.<br /><br />
  Cette semaine inclut des details sur le syst&egrave;me de votes pour les
  propositions de packages, un tutorial PEAR pour Mac OS X, de nouveaux templates
  pour la documentation, et l'absence de PEAR dans la distribution binaires pour
  Win32.  
</p>
<hr>
<h2>UNE INTERVIEW DE STIG BAKKEN</h2>
<small>
  par Pierre-Alain Joye (paj@pearfr.org)
</small>
<h3>Who's Stig Bakken ?</h3>
  Stig (30) a travaill&eacute; avec Unix et les technoligies Web durant les 10 
  derni&egrave;res ann&eacute;es. Depuis 1999, il travaille comme ing&eacute;nieur
  Software Senior pour Search&Transfer (FAST) in Trondheim, Norv&egrave;ge. FAST est 
  le principal concurent de Google dans le march&eacute; OEM des moteurs de recherche,
  et Stig est le responsable technique pour les produits de recherche multimedias.
  Voir <a target="_new" href="http://www.alltheweb.com/">www.alltheweb.com</a> (&eacute;crit
  en PHP) pour une d&eacute;monstration.
<br />

<h3>Qu'est ce que PEAR ?</h3>
  PEAR est un sous-projet de PHP qui tend &agrave; fournir plusieurs choses :<br />
  <li>
    Une libraire de code PHP et d'extensions de haute qualit&eacute;
    et  r&eacute;utilisable
  </li>
  <li>
    Des directives de codages aidant à cr&eacute;er des composants avec
    APIs consistentes.
  </li>
  <li >
    Un framework de packaging, de distribution et d'installation pour ces
    composants
  </li>
    L'acronyme signifie "PHP Extension and Application Repository". Nous avons
    Nous avons bien s&ucirc;re créer l'acronyme avans sa signification.<br />

<h3>Qu'est-ce que PECL ?</h3>
  PECL (the PHP Extension Code Library) est un sous-ensemble de PEAR
  pour des extensions traditionnelles de PHP &eacute;crites en C ou C++.
<br />

<h3>
  Quelles sont les relations entre PHP et PEAR/PECL, nous avons vu beaucoup,
  d'extensions migrer de PHP vers PECL (et il semble que d'autres vont suivre
  dans le futur) ?
</h3>
  De plus en plus d'extensions bougent vers PECL, et avant la sortie de PHP 5,
  la plupart des extensions auront &eacute;t&eacute; marin&eacute;es (PECL'ed). Ceci
  est la 1&egrave;re &eacute;tape du changement dans la gestion de projet pour PHP.
  De futurs versions de PHP vont encore inclure beaucoup d'extensions, elles vont &eacute;tre
  import&eacute;es; durant le processus de release de PHP et inclut dans les archives
  de release.
<br /><br />
  La raison pour laquelle nous faisons cela est de rendre le process de release 
  g&eacute;rable. Actuellement, une release PHP prend plusieurs mois. En important
  les releases stable des extensions PECK, nous allons avoir moins d'inconnus 
  n&eacute;cessitant des tests durant le processus QA de PHP, simplement parce que les
  extension de PECL ont d&eacute; effectu&ecute; leurs propres processus QA.<br /><br />
  Si tout se d&eacute;roule bien, cel&agrave; ram&egrave;nera le processus 
  de release de PHP a des semaines, plut&ocirc;t que  des mois, et augmentera
  la qualit&eacute; g&eacute;n&eacute;rale des extensions incluses dans PHP.
  Je voudrais souligner que ce processus de marinage <i>ne signifie pas</i>
  que les utilisateurs n'auront pas d'extensions incluses dans PHP5.<br /><br />
  En outre, si des extensions sont compil&eacute;es de mani&egrave;re partag&eacute;
  (pas compil&eacute;es directement dans PHP, mais comme libraire dynamique), cel&agrave;
  rendra possible la mise &agrave; jour individuelle des extensions,
  sans mettre &agrave; jour PHP.
<br />

<h3>
  Quelles sont les diff&eacute;rences entre le coeur de PEAR (le gestionnaire 
  de package, les modules principaux) et le reste de PEAR ?
</h3>
  Les packages "core" incluent dans PHP sont de deux types: ceux requis par
  l'installeur, et un ensemble de modules de haute qualit&eacute; 
  et consid&eacute;s d'int&eacute;r&ecirc;ts communs. Le dernier ensemble
  de modules est le d&eacute;but de ce qui, si tout va bien, deviendra le
  "PHP Foundation Classes" (PFC).
<br />

<h3>
  Est-ce que le gestionnaire de packages et la d&eacute;finition des 
  packages peut &ecirc;tre utilis&eacute;s par n'importe quels 
  d&eacute;velopeurs dans leurs projets, priv&eacute;s ou commerciaux ?
</h3>
  Toute personne peut mettre en place sa propre copie de pear.php.net et
  l'utiliser pour distribuer des composants PHP maison. Il y a d&eacute;j&agrave;
  quelques projets qui commencent &agrave; utiliser les outils PEAR pour leurs
  propres besoins.
<br />

<h3>
  Quelles sont les prochaines grandes t&acirc;ches pour PEAR ?
</h3>
  La premi&egrave;re de toute est le support Windows de l'installeur doit
  &ecirc;tre solide. En raison des p&eacute;riodes de f&ecirc;tes, la version
  windows de PHP 4.3.0 a &eacute;t&eacute; livr&eacute;e sans PEAR. 4.3.1 va y
  rem&eacute;dier.<br /><br />

  Nous devons obtenir les releases binaires Win32 des packages PECL.<br />

  Ensuite, nous avons besoin de mettre en service une infrastructure portable
  et fonctionnelle de signature de package, ainsi les utilisateurs pourront 
  se sentir confiant lors de l'installation de releases binaires.<br />
  C'est beacoup plus difficile pour PEAR que pour, disons, RPM, l'installeur
  PEAR fonctionnant sur une myriade de plateforme et de configurations PHP.

  Et il reste beaucoup de travaille devant nous pour la cr&eacute;ation du pland
  de migration PHP 5.
<br />

<h3>
  De plus en plus de personnes sont impliqu&eacute;es dans la communaut&eacute;e PEAR,
  en ajoutant de nouvelles fonctionnalit&eacute;es ou des modules alternatifs concurents,
  Comment g&eacute;rez-vous cel&agrave; ?
</h3>
Nous avons un syst&egrave;me de votes sur la mailing list pear-dev, o&ugrave; les
personnes collectent des votes pour un package sp&eacute;fique. Habituellement, les 
packages ne sont pas rejet&eacute;s, m&ecirc;me si ils ont des fonctionnalit&eacute;es
proches d'autres packages. Mais depuis que nous avons une seule mailing list pour
les d&eacute;velopeurs PEAR, des auteurs de packages concurents se retrouvent 
rapidement et trouve une bonne solution de leurs propres chefs. Mon r&ocirc;le est de
pousser du coude la communaut&eacute; dans la bonne direction, de temps en temps.
<br />
<hr>
<h2>Traffique de PEAR-DEV</h2>

<h3>Qui peut voter ?</h3>
<p>
  Cette question int&eacute;ressante pos&eacute;e sur la lise demande si
  il faut avoir un compte CVS pour voter pour ou contre une proposition 
  de package. Des  <a href="/manual/en/developers.contributing.howto.php">Instructions</a>
  sur comment contribuer &agrave; PEAR. Depuis que vous pouvez &ecirc;tre un
  d&eacute;velopeur sans avoir de compte CVS, chacun sur la liste est qualifi&eacute; 
  pour voter.
</p>

<h3>Tutoril PEAR sur Mac OS X</h3>
<p>
  Pierre-Alain Joye a signal&eacute; l'existence d'un bon tutorial sur comment installer PEAR
  sur Mac OS X. Il semble vraiment complet, commencant par le travail de fond en installant
  php CLI et renseigner correctement les variables d'environnement. Vous trouverez aussi
  des instructions comment: install et utiliser l'installeur PEAR, g&eacute;n&eacute;rer les
  documentation d&eacute;velopeur depuis phpdoc et, non des moindres, comment utiliser 
  les classes PEAR dans vos applications.
  Lien suppl&eacute;mentaire:&nbsp;<a href="http://www.phpmac.com/">PHP and Mac</a>
</p>
<p>
  Le tutoriel peut aussi &ecirc;tre utilis&eacute; comme un guide d'installation de PEAR
  sur des unix traditionnels, la seule diff&eacute;rence &eacute;tant que vous 
  d&eacute;sirez certainement compiler PHP CLI par vous-m&ecirc;me.
</p>
<p>
  Ce qui nous manque est un tutoriel similaire pour windows.
</p>

<h3>PEAR phpdoc template</h3>
<p>
  Christian Dickmann a annonc&eacute; que ses 
  <a href="http://dickmann.homeunix.org/pear/phpdoc/PEAR/">templates PEAR</a>
  pour PHPDoc sont presque termin&eacute;s et attend quelques retours et commentaires.
  Les templates eux-m&ecirc;mes rendent vraiment bien. Des fonctionnalit&eacute;es
  additionnelles, comme de g&eacute;n&eacute;rer des documentations depuis chaque package
  PEAR, visualiser ou t&eacute;l&eacute;charger les documents, ou uploader un package
  de d&eacute;velopement afin de visualiser le r&eacute;sultat avec cette mise en page.
</p>
<p>
  Les templates sont suppos&eacute;s &ecirc;tre utilis&eacute;s avec :
  <a href="http://www.phpdoc.org">phpDocumentor</a>.
</p>

<h3>Erreur dans la distribution Windows</h3>
<p>
  Afin d'ajouter encore plus de confusion pour les utilisateurs Windows avec les
  probl&egrave;mes d'installation de PEAR, l'installeur n'a pas &eacute;t&eacute;
  inclut dans la distribution binaire Windows. Cette erreur va &ecirc;tre corrig&eacute;e
  avec la version 4.3.1 .
</p>


<h3>Bugs and Fixes</h3>
<p>
 Thanks to these people for spotting and fixing some bugs: 
  Lorenzo Alberton, Tobias Schlitt, Michele Manzato, Markus Wolff
</p>
<hr>
<h2>Nouveau package et propositions</h2>
<h3>HTTP_Header, HTTP_Header_Cache</h3>
<p>
  Wolfram Kriesing propose de nouveaux packages implementant
  des m&eacute;todes courantes pour les headers ainsi que pour
  la gestion des headers cache.
</p>

<h3>DB_Abstract</h3>
<p>
  Wolfram Kriesing propose aussi un constructeur et ex&eacute;cuteur de requ&ecirc;tes
  bas&eacute; sur DB. Ce package a quelques points similaires avec DB_DataObject mais est
  focalis&eacute; sur la construction de la requ&ecirc;te.
</p>

<h3>Enterprise A&A</h3>
<p>
  Tony Bibbs sugg&eacute;ra un nouveau package d'authentificatione et de permission.
  Apr&egrave;s quelques discussions, la possibilit&eacute; de fusionner son package avec
  LiveUser emerge&acirc;t.
</p>

<h3>GTK_VarDump</h3>
<p>
  Alan Knowles propose une classe de visualtion d'un VarDump dans une fen&ecirc;tre GTK.
</p>

<hr>
<h2>Development</h2>
<p> 
  Active on CVS this week has been: Net_SMTP, DBA_Relational,
  PECL::session_pgsql, PHPUnit, DB, MDB, XML_Transformer, HTML_QuickForm,
  PECL::soap, Net_SmartIRC, Cache_Lite, HTML_Template_Xipe, PECL::tclink,
  Net_SMTP, Mail, Perm_LiveUser, I18N, Spreadsheet_Excel_Writer,
  Pager_Sliding, XML_XPath, Net_UserAgent, Image_GIS, File_HtAccess, 
  HTML_TreeMenu, DB_QueryTool, HTTP_Header
</p>


</body>
</html>
