<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<!-- $Id$ -->
<html>
<head>
  <title>x</title>
</head>
<body>
<p>
 <i>
  <small>
   by
   <a href="http://www.appelsiini.net/~tuupola/">Mika Tuupola</a> (tuupola@appelsiini.net),
   <a href="http://pear.php.net/account-info.php?handle=pajoye">Pierre-Alain Joye</a> (paj@pearfr.org)
  </small>
 </i>
</p>
<p>
</p>
 A nouveau une semaine active dans le monde de PEAR avec neuf nouvelles sorties
 et deux packages fra&icirc;chement int&eacute;gr&eacute;s. Le total des packages 
 se montent actuellement &agrave; 151. La cat&eacute;gorie "Network" est la plus
 grande avec 27 packages, suivie de l'HTML avec 15 entr&eacute;es et les bases de
 donn&eacute;es avec 11. Ce qui nous am&egrave;me au fait que la qualit&eacute;
 est toujours pr&eacute;f&egrave;rable &agrave; la quatit&eacute;, sujet
 abord&eacute; cette semaine par Lukas Smith.
<hr />
<!-- SECTION <a name="1"></a>
<h2>Package of the week</h2>
<h3></h3>
<h3></h3>
<p>
</p>
-->

<h2>Dans la presse</h2>
<!-- SECTION --><a name="2"></a>
<h3></h3>
<p>
 Il n'y a pas de revue de presse cette semaine.
</p>

<hr>
<p>
Si jamais vous lisez un article sur PEAR n'h&eacute;sitez pas &agrave; nous en faire
part, envoyer un message (sur <a href="mailto:pear-dev@lists.php.net">pear-dev@lists.php.net</a>)
avec les r&eacute;f&eacute;rences et cela sera ajout&eacute; &agrave; la lettre hebdomadaire.
</p>

<hr>

<h2>PEAR-DEV traffic</h2>

<!-- SECTION --><a name="3"></a>
<h3>PEAR DB et MDB, d&eacute;velopement</h3>
<p>
 Lukas Smith nous fait part de ces doutes sur comment la proc&eacute;dure
 ajout&eacute; &agrave; PEAR::DB pourrait &ecirc;tre g&eacute;r&eacute; par
 MDB. Si MDB devait devenir la couche standart d'abstraction de PEAR, il doit
 maintenir une compatibilit&eacute; descendante avec DB. Si tel n'est pas le
 cas, il y aurait plus de libert&eacute; dans le d&eacute;velopement de MDB.
 Il n'y a pas encore de r&acute;ponse claire sur quelles vont &ecirc;tre les
 relations entre DB et MDB et est-ce que MDB remplacera DB à un certain moment
 ou devrait-il suivre son propre chemin.
</p>
<!-- SECTION --><a name="4"></a>
<h3>Maintainir une grande qualit&eacute;</h3>
<p>
 Lors d'un autre sujet, Lukas nous interroge sur le fait qu'il est 
 actuellement tr&egrave;s difficile de suivre quels packages ont 
 &eacute;t&eacute; propos&eacute;s, accept&eacute;s et pour quelles raisons.
 De plus, nous avons abaiss&eacute; le niveau d'acceptation et tous les 
 packages ne sont pas n&eacute;cessairement de haute qualit&eacute;.
</p>
<p>
 Comme solution pour les propositions et approbations de packages, l'ancienne
 id&eacute;e d'avoir une section 'New Package Proposal' sur le site de PEAR
 a &eacute;t&eacute; propos&eacute;. De nouveaux packages devront &ecirc;tre 
 propos&eacute;s et accept&eacute;s par le biais de cette section. Le syst&egrave;me
 de vote actuel fonctionne encore, cependant ce sera un probl&egrave;me dans un futur 
 proche, lorsque de plus en plus de d&eacute;velopeurs nous rejoindrons.
 in the future when more developers join in.
</p>
<p>
 A propos de la qualit&eacute;, c'est au d&eacute;velopeur de PEAR de d&eacute;cider
 s'ils pr&eacute;f&egrave;rent la quantit&eacute; &agrave; la qualit&eacute; ou vice et
 versa.
</p>
<!-- SECTION --><a name="5"></a>
<h3></h3>
<p>
</p>

<!--
<h3>Bugs and Fixes</h3>
<p>
  Thanks to these people for spotting and fixing some bugs:
</p>
<hr>
-->

<h2>Nouveaux et propositions de packages</h2>
<!-- SECTION --><a name="5"></a>
<h3>HTML_PageHandler</h3>
<p>
 Wolfram Kriesing propose sa classe HTML_PageHanlder, laquelle
 g&egrave;re les t&acirc;ches courantes lors de l'utilisation 
 de formulaires. Cette classe englobe une classe comme DB_QueryTool et
 appelle ses m&eacute;thodes quand des &eacute;v&egrave;nements comment
 l'enregistrement, la suppression ou l'&eacute;dition surgissent.
</p>
<!-- SECTION --><a name="6"></a>
<h3>HTTP_Session</h3>
<p>
 HHTP_Session, propos&eacute; par Alexander Radivanovich est un wrapper
 au dessus des fonctions natives de gestion des sessions, fournissant aussi
 une API object et un stockage des sessions en base de donn&eacute;es vie PEAR::DB.
 A l'heure actuelle, une premi&egrave;re release a d&ecute;j&agrave; &eacute;t&eacute;
 effectu&eacute;e.
</p>
<!-- SECTION --><a name="7"></a>
<h3>Net_IMAP</h3>
<p>
 Damian Alejandro Fernandez Sosa est en train d'impl&eacute;ment&eacute;
 le protocole IMAP de mani&egrave;re simplif&eacute;e, permettant &agrave; aux
 utilisateurs ne poss&eacute;dant pas le module IMAP des acc&egrave;s IMAP.
</p>

<!-- SECTION --><a name="8"></a>
<h3>Crypt_DES</h3>
<p>
 Tim Thorpe a cr&eacute;&eacute; un package impl&eacute;mentant le syst&egrave;me
 de cryptage DES, en PHP ou utilisant les fonctions du module mcrypt si ce dernier 
 est disponible.
</p>

<h2>D&eacute;velopement</h2>
<p>
  Active on CVS this week have been:
  HTML_Form, HTML_Template_Xipe, Config, DB_QueryTool, 
  HTTP_WebDAV_Server, Image_GraphViz, PEC::uuid, Auth_SAP,
  PEAR, PECL::ntuser, PECL::radius, Net_Ping, Tree, 
  HTML_QuickForm, Config, HTML_Template_Flexy, 
  HTML_Template_PHPLIB, Auth_SASL, Perm_LiveUser, PECL::cybercash,
  DB_DataObject, Net_Ident, Spreadsheet_Excel_Writer, 
  Image_GIS, DB, HTML_Form, File_HtAccess, Date, PECL::namazu
</p>

</body>
</html>
