<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>x</title>
</head>
<body>
<p><i><small> por <a href="http://www.pearfr.org">Pierre-Alain Joye</a> (paj@pearfr.org) 
e <a href="http://www.appelsiini.net/~tuupola/">Mika Tuupola</a> (tuupola@appelsiini.net)<br>
tradu&ccedil;&atilde;o de Silvano Girardi Jr. (sgj@dr.com)</small></i></p>

<div align="center">
  <h2>O Ano do PEAR<br>
  <a href="http://www.php-mag.net/itr/ausgaben/psecom,id,133,nodeid,112.html">
    <img src="/gifs/phpmag02cover.gif" border ="0" align="center">
  </a>
</h2>
</div>

<h2>PEAR e Windows, a realidade</h2>
<p> Ap&oacute;s meses de espera, as ferramentas de instala&ccedil;&atilde;o e 
  configura&ccedil;&atilde;o do PEAR est&atilde;o agora dispon&iacute;veis e totalmente 
  funcionais para as plataformas Windows. O script de instala&ccedil;&atilde;o 
  go-pear foi completamente revisado e testado v&aacute;rias vezes nas diferentes 
  vers&otilde;es dispon&iacute;veis do Windows.<br>
  Para conhecer todas as corre&ccedil;&otilde;es/not&iacute;cias, n&oacute;s recomendamos 
  o uso do pacote PEAR dispon&iacute;vel em <a href="http://snaps.php.net">PHP4 
  Stable snapshots</a> (veja o par&aacute;grafo seguinte).</p>
<p>Eu (seu humilde servo, pierre ;) ) gostaria de agradecer particularmente &agrave;s 
  seguintes pessoas que tornaram esse pequeno &quot;milagre&quot; poss&iacute;vel, 
  proporcionando novos features, bugfixes ou testes &uacute;teis e relat&oacute;rios 
  completos de bugs: 

<ul>
  <li>Christian Dickmann, autor do PEAR_Frontend_Web e go-pear Web.</li>
  <li>Urs Gehrig, v&aacute;rios testes em Win32 e corre&ccedil;&otilde;es de bugs.</li>
  <li>Stig S. Bakken, &uacute;ltimas corre&ccedil;&otilde;es/addons para UNIX, commits/MFH, t&atilde;o bem quanto seus conselhos preciosos.</li>
  <li>Edin Kadribasic, integra&ccedil;&atilde;o dos scripts de snap do PEAR com 
    o sistema de snapshot do PHP, testes e suporte.</li>
 </ul>
</p>

<h2>PEAR, PHP 4.3.2 e snapshots</h2>

<p>A fim de permitir que os usu&aacute;rios do Windows tenham as mesmas ferramentas 
  que os usu&aacute;rios de Unix, PEAR ser&aacute; empacotado novamente &agrave; 
  distribui&ccedil;&atilde;o do PHP, assim que for disponibilizado o PHP 4.3.2.. 
  O script go-pear e todo pacote necess&aacute;rio para a instala&ccedil;&atilde;o 
  estar&atilde;o dispon&iacute;veis na pasta PEAR da distribui&ccedil;&atilde;o; 
  go-pear.bat inicia a instala&ccedil;&atilde;o.<br>
  Os seguintes pacotes estar&atilde;o agora nas pr&oacute;ximas distribui&ccedil;&otilde;es 
  do PHP: 
<ul>
 <li>PEAR</li>
 <li>phpUnit</li>
 <li>XML_Parser</li>
 <li>XML_RPC</li>
 <li>Archive_Tar</li>
 <li>Console_Getop</li>
 <li>DB-1.4b1</li>
 <li>Mail</li>
 <li>Net_SMTP</li>
 <li>Net_Socket</li>
 <li>Net_UserAgent_Detect</li>
 <li>PEAR_Frontend_Web</li>
 <li>HTML_Template_IT</li>
 <li>Pager</li>
 </ul>

<br>
Nesse meio tempo, o <a href="http://snaps.php.net">PHP 4 Stable snapshots</a> 
j&aacute; cont&eacute;m o PEAR. <br>
</p>

<h2>Go-pear, interface Web de instala&ccedil;&atilde;o</h2>

<p>Ainda em vers&atilde;o alpha, a instala&ccedil;&atilde;o do PEAR atrav&eacute;s 
  de um navegador e o Web Frontend est&atilde;o empacotados com o PHP, tamb&eacute;m. 
  Um grande n&uacute;mero de usu&aacute;rios n&atilde;o tem nenhum acesso via 
  console em suas m&aacute;quinas ou ent&atilde;o n&atilde;o tem nenhum conhecimento 
  sobre a interface do console. Fornecer este tipo de GUI tornar&aacute; muito 
  mais acess&iacute;vel, assim eles poder&atilde;o instalar o PEAR diretamente 
  de seus navegadores favoritos.<br>
  Bugs e pedidos de novas features s&atilde;o bem vindos atrav&eacute;s do <a href="http://bugs.php.net">bugs.php.net</a> 
  ou as listas de e-mail do PEAR.<br>
<br>
  Uso do go-pear Web: 
<ul>
  <li> Fa&ccedil;a o download do script go-pear usando a fun&ccedil;&atilde;o 
    "Salvar destino como..." do seu navegador, em <a href="http://go-pear.org">go-pear.org</a>.</li>
  <li>Coloque o script em algum lugar dentro do diret&oacute;rio raiz do seu servidor. 
    A maneira mais f&aacute;cil &eacute; criar um novo diret&oacute;rio para o 
    pear e colocar o arquivo l&aacute;.</li>
  <li>Acesse o go-pear pelo seu servidor e siga as instru&ccedil;&otilde;es. Verifique 
    se o PHP tem permiss&atilde;o para escrita no diret&oacute;rio que voc&ecirc; 
    deseja instalar o PEAR.</li>
  <li>Ap&oacute;s rodar o go-pear, voc&ecirc; ter&aacute; um link para o Web Frontend 
    do instalador do PEAR. Recomendo colocar este link nos favoritos.</li>
  <li>Proteja o diret&oacute;rio do Web Frontend e o script go-pear com uma senha. 
    Use .htaccess em servidores Apache. por exemplo.</li>
</ul>
</p>

<hr />

<h2>O Ano do PEAR</h2>

<p>Estamos orgulhosos em ver nosso projeto na p&aacute;gina da atual <a href="http://www.php-mag.net">PHP 
  Magazine</a>.<br>
  Este t&iacute;tulo &eacute; uma grande recompensa para os membros do PEAR, que 
  trabalharam duro na evolu&ccedil;&atilde;o do projeto, na divulga&ccedil;&atilde;o 
  e adicionando pacotes de alta qualidade, e aos numerosos usu&aacute;rios que 
  t&ecirc;m enviado seus relat&oacute;rios de erros, pedidos de novos features 
  ou coment&aacute;rios.<br>
  N&oacute;s agradecemos &agrave; editora da <a href="http://www.php-mag.net">PHP 
  Magazine</a>, Software&amp;Support Verlag GmbH e particularmente aos editores 
  chefes:<br>

 <ul>
 <li>Derick Rethans</li>
 <li>Jan Lehnardt</li>
 </ul>

 Nesta edi&ccedil;&atilde;o especial do PEAR, voc&ecirc; encontrar&aacute; artigos 
de alta qualidade que tratam de v&aacute;rios pacotes e conceitos, dos respeitados 
e ativos membros da comunidade PHP e PEAR: 

<ul>
  <li>Introdu&ccedil;&atilde;o ao PEAR, Stig S. Bakken<br>
    Stig faz uma introdu&ccedil;&atilde;o com no&ccedil;&otilde;es b&aacute;sicas 
    de PEAR, uso do instalador e uso de alguns m&oacute;dulos do n&uacute;cleo 
    do PEAR.</li>
  <li>Distribui&ccedil;&atilde;o baseada de PEAR, Alexander Merz<br>
    Alexander ir&aacute; ajudar voc&ecirc; a conseguir uma infraestrutura para 
    distribuir suas aplica&ccedil;&otilde;es usando a API PEAR Package Manager 
    e as ferramentas do servidor pearweb (usado para a pear.php.net).</li>
  <li>PEAR-Error em detalhes, Alexander Merz<br>
    Dominando o PEAR-Error e uma explica&ccedil;&atilde;o das facilidades em usar 
    este gerenciador de erros. (<a href="http://www.php-mag.net/itr/online_artikel/psecom,id,330,nodeid,114.html">Artigo 
    Online</a>)</li>
  <li>PEAR::Tree, Sterling Hugues<br>
    Como usar o PEAR::Tree</li>
  <li>PHPDocumentor, fant&aacute;stica Documenta&ccedil;&atilde;o, por Greg Beaver<br>
    Greg, autor do PHPDocumentor, explica o uso desta maravilhosa aplica&ccedil;&atilde;o, 
    como ela pode ser usada para transformar uma boa documenta&ccedil;&atilde;o 
    em uma fant&aacute;stica documenta&ccedil;&atilde;o.</li>
  <li>XML Transformer, Kristian K&ouml;hntopp<br>
    XML Transformer, como uma alternativa pura em PHP para XSLT, &eacute; bem 
    descrita neste artigo, aprenda o b&aacute;sico e veja como ir al&eacute;m 
    com esta poderosa ferramenta.</li>
  <li>Python em PHP, Jon Parise<br>
    Jon Parise, autor da extens&atilde;o para Python (PECL), explica como ter 
    acesso total a uma aplica&ccedil;&atilde;o Python atrav&eacute;s do PHP, terminando 
    seu artigo com um pequeno guia e alguns conselhos &uacute;teis.</li>
  <li>Usando API's de Stream no PHP 4.3 (Part I), Wez Furlong<br>
    Mesmo n&atilde;o sendo diretamente relacionado ao PEAR, isto deve interessar 
    aos autores do PECL que precisam de fun&ccedil;&otilde;es de Streams dentro 
    de suas respectivas extens&otilde;es. Wez apresenta uma boa Stream em PHP 
    4.3, tornando nossa vida mais f&aacute;cil com todos os c&oacute;digos relacionados 
    a streams.</li>
</ul>

Esta edi&ccedil;&atilde;o foi lan&ccedil;ada h&aacute; uma semana ou mais e est&aacute; 
dispon&iacute;vel em qualquer banca de revistas.<br>
Voc&ecirc; pode assinar a revista aqui: <a href="https://www.entwickler.com/ssl/pme_abo.php?check=1"><img src="/gifs/phpmagazine.gif" border="0" align="center"></a>. </p> 

<!-- SECTION -->
<a name="1"></a> 
<h2>Na Imprensa</h2>
<p><a href="http://www.phppatterns.com">::phpPatterns</a> publicou uma pequena 
  introdu&ccedil;&atilde;o ao PEAR::Soap, <a href="">PEAR::SOAP Client Fast Start</a></p>

</body>
</html>